{"metadata":{"title":"Installing Python Modules with pip","layout":"lesson","date":"2013-05-06T00:00:00.000Z","authors":["Fred Gibbs"],"reviewers":["Ben Hurwitz","Amanda Morton"],"difficulty":1,"activity":"acquiring","topics":["get-ready","python"],"abstract":"There are many ways to install external python libraries; this tutorial explains one of the most common methods using pip.","exclude_from_check":["editors","review-ticket"],"redirect_from":"/lessons/installing-python-modules-pip","avatar_alt":"A branch with pears","doi":"10.46430/phen0029"},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"lesson-goals\">Lesson Goals</h2>\n<p>This lesson shows you how to download and install Python modules. There\nare many ways to install external modules, but for the purposes of this\nlesson, we’re going to use a program called pip, easily installable on <a href=\"https://pip.pypa.io/en/stable/\">mac/linux</a> and <a href=\"https://sites.google.com/site/pydatalog/python/pip-for-windows\">windows</a>. As of Python 2.7.9 and newer, pip is installed by default. This tutorial will be helpful for anyone using older versions of Python (which are still quite common).</p>\n<h2 id=\"introducing-modules\">Introducing Modules</h2>\n<p>One of the great things about using Python is the number of fantastic\ncode libraries that are widely and easily available that can save you a\nlot of coding, or simply make a particular task (like creating a CSV\nfile, or scraping a webpage) much easier. When Googling for solutions to\nproblems, you’ll often find sample code that uses code libraries you\nhaven’t heard about before. Don’t let these scare you away! Once these\nlibraries are installed on your computer, you can use them by importing\nthem at the beginning of your code; you can import as many libraries as\nyou’d like, such as</p>\n<pre><code class=\"language-python\">import csv\nimport requests\nimport kmlwriter\nimport pprint\n</code></pre>\n<p>For new Python users, it can be a bit intimidating to download and\ninstall external modules for the first time. There are many ways of\ndoing it (thus adding to the confusion); this lesson introduces one of\nthe easiest and most common ways of installing python modules.</p>\n<p>The goal here is to install software on your computer that can\nautomatically download and install Python modules for us. We’re going to\nuse a program called <a href=\"https://pip.pypa.io/en/stable/\">pip</a>.</p>\n<p>Note: As of Python 3.4, pip will be included in the regular install.\nThere are many reasons why you might not have this version yet, and in\ncase you don’t, these instructions should help.</p>\n<h2 id=\"mac-and-linux-instructions\">Mac and Linux instructions</h2>\n<p>As per the pip documentation, we can download a python script to install\npip for us. Using a Mac or Linux, we can install pip via the command\nline by using the <a href=\"http://www.thegeekstuff.com/2012/04/curl-examples/\">curl command</a>, which downloads the pip installation\nperl script.</p>\n<pre><code class=\"language-bash\">curl -O https://bootstrap.pypa.io/get-pip.py\n</code></pre>\n<p>once you’ve downloaded the get-pip.py file, you need to execute it with\nthe python interpreter. However, if you try to execute the script with\npython like</p>\n<pre><code class=\"language-bash\">python get-pip.py\n</code></pre>\n<p>the script will most likely fail because it won’t have permissions to\nupdate certain directories on your filesystem that are by default set so\nthat random scripts cannot change important files and give you viruses.\nIn this case—and in all cases where you need to allow a script that you\ntrust to write to your system folders—you can use the <strong>sudo</strong> command\n(short for “Super User DO”) in front of the python command, like</p>\n<pre><code class=\"language-bash\">sudo python get-pip.py\n</code></pre>\n<h2 id=\"windows-instructions\">Windows Instructions</h2>\n<p>As with the above platforms, the easiest way to install pip is through\nthe use of a python program called get-pip.py, which you can download\n<a href=\"https://bootstrap.pypa.io/get-pip.py\">here</a>. When you open this link, you might be scared of the massive\njumble of code that awaits you. Please don’t be. Simply use your browser\nto save this page under its default name, which is get-pip.py. It might\nbe a good idea to save this file in your python directory, so you know\nwhere to find it.</p>\n<p>Once you have saved this file, you need to run it, which can be done in\ntwo ways. If you prefer using your python interpreter, just right-click\non the file get-pip.py and choose “open with” and then choose whatever\npython interpreter you care to use.</p>\n<p>If you prefer to install pip using the windows command line, navigate to\nwhatever directory you’ve placed python and get-pip.py. For this\nexample, we’ll assume this directory is python27, so we’ll use the\ncommand C:\\&gt;cd python27. Once you are in this directory, to install pip run the\ncommand</p>\n<pre><code class=\"language-bash\">python get-pip.py\n</code></pre>\n<p>If you want more information or help with a weird error message, check out the <a href=\"http://stackoverflow.com/questions/4750806/how-to-install-pip-on-windows\">StackOverflow\npage</a> that seems to be regularly updated.</p>\n<h2 id=\"installing-python-modules\">Installing Python Modules</h2>\n<p>Now that you have pip, it is easy to install python modules since it\ndoes all the work for you. When you find a module that you want to use,\nusually the documentation or installation instructions will include the\nnecessary pip command, such as</p>\n<pre><code class=\"language-bash\">pip install requests\npip install beautifulsoup4\npip install simplekml\n</code></pre>\n<p>Remember, for the same reasons explained above (on Mac or Linux systems, but not Windows), you might need to run pip with sudo, like</p>\n<pre><code class=\"language-bash\">sudo pip install requests\n</code></pre>\n<p>Sometimes, especially on Windows, you may find it helpful to use the -m flag (to help python find the pip module), like</p>\n<pre><code class=\"language-bash\">python -m pip install XXX\n</code></pre>\n<p>Happy installing!</p>\n"}