{"metadata":{"title":"Georreferenciar con QGIS 2.0\n","collection":"lessons","layout":"lesson","slug":"georreferenciar-qgis","date":"2013-12-13T00:00:00.000Z","translation_date":"2020-06-05T00:00:00.000Z","authors":["Jim Clifford","Josh MacFadyen","Daniel Macfarlane"],"reviewers":["Finn Arne Jørgensen","Peter Webster","Abby Schreiber"],"editors":["Adam Crymble"],"translator":["Lorena Campuzano"],"translation-editor":["Maria José Afanador-Llach","Victor Gayol"],"translation-reviewer":["Jairo Melo","Camilo Murcia Galindo"],"original":"georeferencing-qgis","review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/163","prev":"vector-layers-qgis","difficulty":2,"activity":"transforming","topics":["mapping"],"abstract":"En esta lección aprenderás cómo georreferenciar mapas históricos para que puedan añadirse a un SIG (Sistema de Información Geográfica) como una capa ráster.","avatar_alt":"Mapa de una ciudad de montaña","doi":"10.46430/phes0047"},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"objetivos-de-la-lección\">Objetivos de la lección</h2>\n<p>En esta lección aprenderás cómo georreferenciar mapas históricos para que puedan añadirse a un SIG (Sistema de Información Geográfica) como una capa ráster. La georreferenciación es una herramienta necesaria para digitalizar los datos que se encuentran en los mapas de papel. Además, como los historiadores trabajamos sobre todo en un reino de papel, la georreferenciación es una de las herramientas que más utilizamos. La técnica consiste en utilizar una serie de puntos de control para vincular a objetos bidimensionales, como un mapa en papel, las coordenadas reales necesarias para que se realice la alineación con las características tridimensionales de la tierra en un programa SIG (en <a href=\"/es/lecciones/intro-a-google-maps-y-google-earth\">Introducción a Google Maps y Google Earth</a> vemos un &#39;overlay&#39;, que es una especie de atajo para la georreferenciación en Google Earth).</p>\n<p>Georreferenciar un mapa histórico requiere un conocimiento de la geografía e historia del lugar que estás estudiando para así asegurar precisión. Los paisajes construidos y naturales se transforman con el tiempo, por lo cual es importante verificar si la localización de los puntos de control --sean casas, intersecciones o pueblos-- se ha mantenido constante. Introducir puntos de control en un SIG es fácil, pero detrás de bambalinas, la georreferenciación utiliza procesos complejos de transformación y compresión. Estos se utilizan para corregir las distorsiones e inexactitudes que se encuentran en muchos mapas históricos y estirarlos para que quepan dentro de coordenadas geográficas. En cartografía esto se conoce como <em><a href=\"http://en.wikipedia.org/wiki/Rubbersheeting\">rubber-sheeting</a></em> porque se trata al mapa como si estuviera hecho de caucho (<em>rubber</em> en inglés) y a los puntos de control como si fueran tachuelas &quot;clavando&quot; el documento histórico en una superficie tridimensional como el globo terránqueo.   </p>\n<h2 id=\"para-empezar\">Para empezar</h2>\n<p>Antes de empezar a georreferenciar en Quantum GIS, necesitamos activar unos <em>Complementos</em>. En la barra de herramientas ve a <em>&quot;Complementos -&gt;Administrar e instalar complementos&quot;</em></p>\n<p>{% include figure.html filename=&quot;geo110.png&quot; caption=&quot;Figura 1&quot; %}</p>\n<p>Se abrirá un cuadro de diálogo llamado <em>Administrador de complementos</em>. Desplázate hasta <em>&quot;Georreferenciador GDAL&quot;</em> y activa la casilla que está a su lado y haz clic en OK.</p>\n<p>{% include figure.html filename=&quot;geo210.png&quot; caption=&quot;Figura 2&quot; %}</p>\n<ul>\n<li><p>En este momento necesitas cerrar y volver a abrir QGIS. Para el propósito de este ejemplo y mantener las cosas lo más simple posible, no cargues de nuevo tu proyecto. Comienza uno diferente.</p>\n</li>\n<li><p>Configura el <em>[Sistema de Referencia de Coordenadas][]</em> (SRC) correctamente (ver <a href=\"/lessons/qgis-layers\">Installing QGIS 2.0 and adding Layers</a> para recordar cómo hacerlo).</p>\n</li>\n<li><p>Guarda este nuevo proyecto (en el menú <em>Proyecto</em>, selecciona <em>&quot;Guardar&quot;</em>) y nómbralo &#39;georreferenciar.&#39;</p>\n</li>\n<li><p>Añade la capa <em>&#39;coastline_polygon&#39;</em> (ver <a href=\"/lessons/qgis-layers\">Installing QGIS 2.0 and adding Layers</a> para recordar cómo).</p>\n</li>\n</ul>\n<h2 id=\"abre-las-capas-de-gis-necesarias\">Abre las capas de GIS necesarias</h2>\n<p>Para el estudio de caso de la Isla del Príncipe Eduardo (conocida por sus siglas en inglés como PEI), usaremos las fronteras de la municipalidad como puntos de control debido a que estas fronteras se establecieron en 1764 por Samuel Holland, están identificadas en la mayoría de los mapas de PEI y han cambiado muy poco desde que fueron creadas.</p>\n<p><em>Descargar lot_township_polygon:</em></p>\n<p>Este es el shapefile (archivo de entidades vectoriales) que contiene la capa de vectores actuales que usaremos para georreferenciar el mapa histórico.  Nótese que las municipalidades no tenían nombres en 1764, sin embargo, tenían números asignados a cada lote, razón por la cual son referidos como &quot;Lots&quot; en PEI. De ahí que el archivo se llame &#39;lot_township_polygon&#39;.</p>\n<ul>\n<li>Navegua al siguiente enlace, acepta la licencia de uso y descargua &#39;lot_township_polygon&#39;  (En algunas ocasiones te preguntarán tu nombre y correo electrónico antes de poder descargar el archivo).</li>\n</ul>\n<p><a href=\"http://www.gov.pe.ca/gis/license_agreement.php3?name=lot_town&amp;file_format=SHP\">http://www.gov.pe.ca/gis/license_agreement.php3?name=lot_town&amp;file_format=SHP</a></p>\n<ul>\n<li>Después de descargar el archivo llamado &#39;lot \\ _township \\ _polygon&#39;, muévelo a una carpeta que puedas encontrar después y descomprime el archivo. (Recuerda mantener los archivos juntos ya que todos son necesarios para abrir esta capa en tu SIG)</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo310.png&quot; caption=&quot;Figure 3&quot; %}</p>\n<p><em>Añadir lot_township_polygon to QGIS:</em></p>\n<ul>\n<li><p>En la barra de herramientas ve a <em>&quot;Capa&quot;</em>, escoje <em>&quot;Añadir capa vectorial&quot;</em> (alternativamente, el mismo ícono que se ve al lado de <em>&quot;Añadir capa vectorial&quot;</em> también se puede seleccionar desde la barra de herramientas).</p>\n</li>\n<li><p>Haz clic en <em>&quot;Explorar&quot;</em>. Navegua a tu archivo descomprimido y selecciona el archivo &#39;lot \\ _township \\ _polygon.shp&#39;</p>\n</li>\n<li><p>Haz clic en <em>&quot;Abrir&quot;</em></p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo41.png&quot; caption=&quot;Figure 4&quot; %}</p>\n<p>Para más información sobre añadir y visualizar capas ver <a href=\"/lessons/qgis-layers\">Installing QGIS 2.0 and adding Layers</a>.</p>\n<p>{% include figure.html filename=&quot;geo51.png&quot; caption=&quot;Figure 5&quot; %}</p>\n<h2 id=\"abrir-la-herramienta-para-georreferenciar-georeferencer-tool\">Abrir la herramienta para georreferenciar (Georeferencer Tool)</h2>\n<p>&quot;Georreferenciador&quot; ahora está disponible en el menú &quot;Ráster&quot; en la barra de herramientas. Selecciónalo.</p>\n<p>{% include figure.html filename=&quot;geo61.png&quot; caption=&quot;Figure 6&quot; %}</p>\n<p><em>Añadir tu mapa histórico:</em></p>\n<ul>\n<li>En la ventana resultante, haz clic en &quot;Abrir ráster&quot; en la izquierda arriba,  (el cual luce similar a &quot;Abrir capa ráster&quot;).</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo71.png&quot; caption=&quot;Figure 7&quot; %}</p>\n<ul>\n<li>Busca el archivo &#39;PEI_LakeMap1863.jpg&#39; en tu computador y selecciona &quot;Abrir&quot; (el archivo [puede descargarse aquí][] o en su locación original en la web <a href=\"https://web.archive.org/web/20180922004858/http://www.islandimagined.ca:80/fedora/repository/imagined:208687\">Island Imagined</a>)</li>\n<li>El programa te pedirá definir el sistema coordenado de la capa. Busca en &quot;Filtro&quot; el número &#39;2291′, y luego en el cuadro debajo de éste selecciona &#39;NAD83(CSRS98) / Prince Edward …&#39;</li>\n</ul>\n<p>El resultado lucirá así:</p>\n<p>{% include figure.html filename=&quot;geo81.png&quot; caption=&quot;Figure 8&quot; %}</p>\n<p><em>Añadir puntos de control</em></p>\n<p>Planifica previamente los lugares que vas a utilizar como puntos de control antes de los pasos que siguen. Es mucho más fácil navegar con anterioridad el mapa histórico para así hacerse a una idea de los mejores puntos a utilizar y tenerlos en cuenta para usarlos posteriormente. Algunas sugerencias para escoger los puntos de referencia:</p>\n<ul>\n<li>¿<strong>Cuántos</strong> puntos necesitas? Usualmente, entre más puntos asignes, más preciso será tu mapa georeferenciado. Dos puntos de control le indicarán al GIS que rote y escale el mapa en torno a ellos, pero para hacer <em>rubbersheeting</em> necesitas añadir más puntos.</li>\n<li>¿<strong>Dónde</strong> debes poner los puntos de control? Selecciona puntos en áreas lo más cerca posible de las cuatro esquinas de tu mapa para que estas áreas externas no se omitan del <em>rubbersheeting</em>.</li>\n<li>Selecciona puntos adicionales cercanos al área de tu interés. Todo aquello que se encuentre entre las cuatro esquinas de control puede georreferenciarse sin problema, pero si te preocupa la precisión de un lugar en particular, asegúrate de seleccionar puntos de control adicionales en esa zona.</li>\n<li>Selecciona puntos de control en el medio de intersecciones y caminos, porque los bordes de los caminos cambian con el tiempo a medida que se hacen mejoras a las vías.</li>\n<li>Verifica que tus puntos de control no hayan cambiado de ubicación a lo largo del tiempo. Las carreteras fueron redirigidas a menudo, del mismo modo casas y edificios fueron trasladados ¡especialmente [en las provincias atlánticas de Canadá]{.underline}!</li>\n</ul>\n<p><em>Añadir el primer punto de control:</em></p>\n<p><strong>Primero</strong>, navega a la ubicación de tu primer punto de control en el <strong>mapa histórico</strong>.</p>\n<ul>\n<li>Haz clic en &quot;Acercar zum&quot; en la barra de herramientas o magnifica el punto con la rueda del mouse.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo91.png&quot; caption=&quot;Figure 9&quot; %}</p>\n<ul>\n<li><p>Acercate y magnifica un punto que puedas reconocer tanto en tu mapa impreso como en tu SIG.</p>\n</li>\n<li><p>Haz clic  en &quot;Añadir punto&quot; en la barra de herramientas.</p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo101.png&quot; caption=&quot;Figure 10&quot; %}</p>\n<ul>\n<li>Haz clic en el lugar del mapa impreso que puedas localizar en tu SIG (es decir, el punto de control). La ventana de georreferenciación se minimizará automáticamente. Si no lo hace (algunas versiones tienen un problema con este complemento), hazlo manualmente.  </li>\n<li>Si no es posible hacerlo manualmente, al hacer clic en el punto del mapa en el georreferenciador se abre una ventana que solicita &quot;Introducir las coordenadas del mapa&quot;. Para proseguir según las indicaciones de este tutorial es necesario seleccionar el botón &quot;A partir del lienzo del mapa&quot;, entonces la ventana se cerrará automáticamente y será posible continuar.</li>\n<li>Haz clic en el lugar del SIG que coincida con el punto de control del mapa impreso.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo111.png&quot; caption=&quot;Figure 11&quot; %}</p>\n<ul>\n<li>En esta etapa identificamos un problema en los límites de los lotes. Habíamos planeado usar la ubicación donde el límite sur del lote 1, en el extremo oeste de la provincia, contiene un pliege abrupto cerca del centro de la masa terrestre. Sin embargo, se observa que no todos estos quiebres abruptos en los límites de los lotes coincidían con el mapa histórico. Es posible que los límites de los lotes hayan cambiado algo en los 250 años desde que se establecieron, por lo que es mejor elegir el punto del que se está más seguro. En este caso, el pliegue abrupto entre el Lote 2 y el Lote 3 estaba bien (ver flecha roja en la figura). Fue el límite de los lotes 3 y 4 el que ha cambiado. La discrepancia entre los límites de los lotes 1 y 2 muestra la necesidad de insertar más puntos de control para realizar correctamente el rubbersheeting en este parcialmente distorsionado mapa de 1863 para que coincida con la capa de la provincia en el GIS.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo121.png&quot; caption=&quot;Figure 12&quot; %}</p>\n<p><em>Añadir al menos otro punto de control más:</em></p>\n<ul>\n<li>Vuelve a la ventana &quot;Georreferenciador&quot; y repite los pasos de &#39;* Añadir tu primer punto de control *&#39; arriba para añadir puntos de control adicionales.</li>\n<li>Agrega un punto cerca del lado opuesto de tu mapa impreso (cuanto más separados estén los puntos de control, más exacto será el proceso de georreferenciación) y otro cerca de Charlottetown.</li>\n<li>Vuelve a la ventana &quot;Georreferenciador&quot;. Deberías ver tres puntos rojos en el mapa impreso y tres registros en la Tabla de PCT (Puntos de Control sobre el Terreno) en la parte inferior de la ventana (en rojo en la siguiente imagen).</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo131.png&quot; caption=&quot;Figure 13&quot; %}</p>\n<p><em>Determinar la configuración de la transformación:</em></p>\n<p>Antes de que hagas clic en &quot;Comenzar&quot; e inicie el proceso automático de georeferenciación, debes especificarle a QGIS dónde guardar el archivo (el cual será una imagen ráster), cómo el programa debe interpretar sus puntos de control y cómo debe comprimir la imagen.  </p>\n<ul>\n<li>Haz clic en &quot;Configuración de la transformación&quot;</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo141.png&quot; caption=&quot;Figure 14&quot; %}</p>\n<p>La mayoría de las opciones de configuración pueden dejarse como estén predeterminadas: &quot;Tipo de transformación lineal&quot;, &quot;Vecino más próximo como método de remuestreo&quot; y &quot;Compresión LZW&quot;. (El [archivo de referenciación][] no es necesario, a menos que desees georreferenciar la misma imagen otra vez en otro SIG o si alguien más necesita georreferenciar la imagen y no tiene acceso a tu información SIG, sistema de referencia de coordenadas, etc.) El SER de destino no es importante, pero podrías usar esta función para darle al nuevo ráster un sistema de referencia diferente.</p>\n<ul>\n<li>Asigna una carpeta para tu nuevo archivo de ráster georreferenciado. <a href=\"http://en.wikipedia.org/wiki/Tagged_Image_File_Format\">Tif</a> [] es el formato predeterminado para los rásteres georeferenciados en QGIS.</li>\n<li>Ten en cuenta que un archivo Tif va a ser mucho más grande que su mapa original, incluso con compresión LZW, así que asegúrate de tener suficiente espacio si estás utilizando un disco externo o USB. (<em>Advertencia:</em> El archivo TIF producido a partir de este 6.8 Mb .jpg será de <strong>más de 1 GB</strong> una vez georeferenciado. Una forma de controlar el tamaño del archivo raster georreferenciado manteniendo una resolución lo suficientemente alta para la legibilidad consiste en  recortar únicamente el área del mapa necesaria para el proyecto. En este caso, también está disponible una opción de menor resolución del repositorio de mapas en línea <a href=\"https://web.archive.org/web/20180922004858/http://www.islandimagined.ca:80/fedora/repository/imagined:208687\">Island Imagined</a> []).</li>\n<li>Deja la resolución del mapa georeferenciado en el valor predeterminado.</li>\n<li>Puedes seleccionar ‘Usar 0 para transparencia cuando sea necesario’ para eliminar espacios negros alrededor de los bordes del mapa, pero no es necesario, aunque puedes experimentar cuando consideres conveniente.</li>\n<li>Asegúrate de que esté seleccionado &#39;Cargar en QGIS&#39;. Esto agregará automáticamente el nuevo archivo a la tabla de contenido de tu SIG para que no tenga que ir a buscar el archivo Tif más tarde.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo151.png&quot; caption=&quot;Figure 15&quot; %}</p>\n<h2 id=\"¡georreferenciar\">¡Georreferenciar!</h2>\n<ul>\n<li>Haz clic en &quot;Comenzar georreferenciado&quot; en la barra de herramientas ( al lado de &quot;Abrir ráster&quot;). Esto inicia el proceso de georreferenciación.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo161.png&quot; caption=&quot;Figure 16&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo171.png&quot; caption=&quot;Figure 17&quot; %}</p>\n<ul>\n<li>Se abrirá una ventana pidiendo que definas SRC. Selecciona &quot;2291&quot; y presiona &quot;Aceptar&quot;.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo181.png&quot; caption=&quot;Figure 18&quot; %}</p>\n<p><em>Explorar tu mapa:</em></p>\n<ul>\n<li>Arrastra la nueva capa &#39;PEI_LakeMap1863_modified&#39; al final de tu &quot;Lista de contenidos&quot; (debajo de la capa &#39;lot_township_polygon&#39;)</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo191.png&quot; caption=&quot;Figure 19&quot; %}</p>\n<ul>\n<li>Cambia el relleno de la capa &#39;lot_township_polygon&#39;  a &quot;sin relleno&quot; seleccionando la pestaña Capa, opción&quot; Propiedades&quot; y haciendo clic en &quot;Capas de símbolos&quot;. Oprime OK.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo201.png&quot; caption=&quot;Figure 20&quot; %}</p>\n<ul>\n<li>Ahora deberías ver la capa SIG moderna con el mapa histórico de fondo.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo211.png&quot; caption=&quot;Figure 21&quot; %}</p>\n<p>Ahora que tienes el mapa georreferenciado en tu SIG, puedes explorar la capa, ajustar la transparencia, el contraste y el brillo, y nuevamente [Crear nuevas capas de vectores en QGIS] [] para digitalizar parte de la información histórica que has creado. Por ejemplo, este mapa georreferenciado de PEI muestra las ubicaciones de todas las casas en 1863, incluido el nombre del jefe de hogar. Al asignar puntos en el mapa, puedes ingresar la ubicación de las casas y los nombres de propietario para luego analizar o compartir esa nueva capa geoespacial como un <em>shapefile.</em></p>\n<p>Al digitalizar vectores lineales como carreteras o costas, puedes comparar la ubicación de estas características con otros datos históricos, o simplemente compararlos visualmente con la capa &#39;lot_township_polygon&#39; en este SIG.</p>\n<p>En procesos más avanzados, puedes incluso cubrir esta imagen georreferenciada con un DEM (modelo de elevación digital) para darle un juego de sombras que indiquen altura (&quot;hillshade&quot;) o un efecto 3D y realizar un sobrevuelo (&quot;fly-over&quot;) a los hogares del PEI en el siglo XIX.</p>\n<p><em>Este tutorial es parte de <a href=\"http://geospatialhistorian.wordpress.com/\">Geospatial Historian</a>.</em></p>\n"}