{"metadata":{"title":"Creación de un entorno de desarrollo integrado para Python (Windows)","authors":["William J. Turkel","Adam Crymble"],"date":"2012-07-17T00:00:00.000Z","translation_date":"2017-03-15T00:00:00.000Z","editors":["Miriam Posner"],"reviewers":["Jim Clifford","Amanda Morton"],"translator":["Víctor Gayol"],"translation-editor":["Adam Crymble"],"translation-reviewer":["Jairo A. Melo","Maria José Afanador-Llach","Antonio Rojas Castro"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/37","layout":"lesson","original":"windows-installation","avatar_alt":"Tres hombres tocando instrumentos musicales","difficulty":1,"activity":"transforming","topics":["get-ready","python"],"abstract":"Este tutorial te ayudará a configurar un entorno de desarrollo integrado para Python en un computador con el sistema operativo de Windows.","doi":"10.46430/phes0011"},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"respalda-toda-tu-computadora\">Respalda toda tu computadora.</h2>\n<p>Siempre es importante asegurarse de tener copias de seguridad hechas de modo regular y, sobre todo, recientes. Este es un buen consejo de por vida y no se limita a los momentos en los que estés dedicado a programar.</p>\n<h2 id=\"instalar-python-v3\">Instalar Python v.3</h2>\n<p>Dirígete al <a href=\"https://www.python.org\">sitio web de Python</a>, descarga la última versión estable del lenguaje de programación Python (3.8 es la correspondiente a noviembre de 2019), e instálalo siguiendo las instrucciones del sitio web de Python.</p>\n<h2 id=\"creación-de-un-directorio\">Creación de un directorio</h2>\n<p>Para mantener organizados los datos en tu equipo, lo mejor es crear un directorio o carpeta en tu computadora dedicado exclusivamente a almacenar todos tus programas que escribas con Python (i.e, <code>programming-historian</code>) y mantenlo en el lugar de tu disco duro que mejor te acomode.</p>\n<h2 id=\"instalar-komodo-edit\">Instalar Komodo Edit</h2>\n<p>Komodo Edit es un editor de texto libre y de código abierto, pero puedes utilizar varias <a href=\"https://wiki.python.org/moin/PythonEditors/\">opciones de editores de texto</a> si quieres utilizar otros programas. Puedes descargar una copia desde el <a href=\"http://komodoide.com/komodo-edit/\">sitio web de Komodo Edit</a>.</p>\n<h2 id=\"inicia-komodo-edit\">Inicia Komodo Edit</h2>\n<p>Se deberá ver algo parecido a la siguiente ventana:</p>\n<p>{% include figure.html filename=&quot;komodo-edit11-windows-main.png&quot; caption=&quot;Komodo Edit en Windows&quot; %}</p>\n<p>Si no está visible el panel de Caja de Herramientas (Toolbox) de la derecha, es necesario activarlo en el menú correspondiente. Selecciona <code>View -&gt; Tabs -&gt; Toolbox</code>. No importa si el panel del proyecto está abierto o no. Tómate un tiempo para familiarizarte con el diseño del Komodo Editor. El archivo de ayuda es bastante bueno.</p>\n<h3 id=\"configuración-de-komodo-edit\">Configuración de Komodo Edit</h3>\n<p>Ahora es necesario configurarlo para que puedas correr los programas de Python.</p>\n<p>1 .  Selecciona <code>Edit -&gt; Preferences</code>. Esto abrirá una nueva ventana de diálogo. En &quot;<em>Languages</em>&quot; y &quot;<em>Python 3</em>&quot; selecciona &quot;<em>Browse</em>&quot; y navega hasta <code>C:\\Users\\tunombredeusuario\\AppData\\Local\\Programs\\Python\\Python38-32</code>)\nSi se ve más o menos así, oprime OK:</p>\n<p>{% include figure.html filename=&quot;komodo-edit11-windows-interpreter.png&quot; caption=&quot;Seleccionar Python como intérprete por defecto.&quot; %}</p>\n<p>2 .  Enseguida en la sección  &quot;<em>Preferences</em>&quot; selecciona <em>Internacionalization</em>. Selecciona <em>Python</em> del menú despegable que se llama <em>Language-specific Default Encoding</em> y asegúrate que <a href=\"https://es.wikipedia.org/wiki/UTF-8\">UTF-8</a> esté seleccionado como el método de codificación por defecto.</p>\n<p>{% include figure.html filename=&quot;komodo-edit11-windows-utf-set.png&quot; caption=&quot;Configurar lenguaje a UFT-8.&quot; %}</p>\n<p>Enseguida selecciona <code>Toolbox -&gt; Add -&gt; New Command</code> . Esto abrirá una nueva ventana de diálogo en la que deberás renombrar tu comando como <code>Run Python</code>. Debajo de <code>Command</code> teclea:</p>\n<pre><code class=\"language-python\">%(python3) %f\n</code></pre>\n<p>Si olvidas este comando, Python se quedará colgado porque no estará recibiendo las órdenes (input).</p>\n<p>El campo activo ‘Start in’ debes escribir:</p>\n<pre><code class=\"language-python\">%D\n</code></pre>\n<p>Si se ve así, oprime OK:</p>\n<p>{% include figure.html filename=&quot;komodo-edit11-windows-python-command.png&quot; caption=&quot;Configuración del comando &#39;Run Python&#39;.&quot; %}\n{% include figure.html filename=&quot;komodo-edit11-windows-python-start.png&quot; caption=&quot;Configuración del comando &#39;Run Python Start&#39;.&quot; %}</p>\n<p>Tu nuevo comando debe aparecer en el panel de la caja de herramientas (<em>Toolbox</em>). Probablemente deberás reiniciar tu computadora para completar el paso antes de que Python trabaje con Komodo Edit.</p>\n<h2 id=\"paso-2--hola-mundo-en-python\">Paso 2 – “Hola Mundo” en Python</h2>\n<p>Es tradicional que para comenzar a programar en un nuevo lenguaje tratemos de crear un programa que despliegue la frase “Hola Mundo” y termine. Vamos a mostrar cómo hacer esto en Python y en HTML.</p>\n<p>Python es un buen lenguaje de programación para principiantes gracias a que es un lenguaje de programación de muy alto nivel. Es posible, en otras palabras, escribir programas cortos que realizan una gran cantidad de procesos. Entre más corto es el programa, lo más probable es que todo quepa en una pantalla y que sea más fácil hacer un seguimiento de todo en tu mente.</p>\n<p>Python es un lenguaje de programación &quot;interpretado&quot;. Esto significa que hay un programa de cómputo especial (conocido como intérprete) que sabe cómo seguir las instrucciones escritas en este lenguaje. Una manera de usar el intérprete es guardar todas tus instrucciones en un archivo y luego ejecutar el intérprete sobre ese archivo. El archivo que contiene instrucciones de lenguaje de programación es conocido como programa.  El intérprete ejecutará cada una de las instrucciones que le hayas dado en tu programa y luego se detendrá. Vamos a intentar esto.</p>\n<p>En tu editor de texto crea un nuevo archivo y escribe el siguiente programa de dos líneas y guárdalo en tu carpeta <code>programming-historian</code> con el nombre <code>hola-mundo.py</code>.</p>\n<pre><code class=\"language-python\"># hola-mundo.py\nprint(&#39;hola mundo&#39;)\n</code></pre>\n<p>El editor de texto que seleccionaste debe tener un botón <code>Run</code>  que te permitirá ejecutar tu programa. Si todo funciona bien, deberás ver algo como sigue (El ejemplo es como se ve en Komodo Edit. Da un clic en la imagen para ver una copia en tamaño completo):</p>\n<p>{% include figure.html filename=&quot;komodo-edit11-windows-hola.png&quot; caption=&quot;Hola Mundo en Komodo Edit&quot; %}</p>\n<h2 id=\"interactuar-con-el-intérprete-de-comandos-shell-de-python\">Interactuar con el intérprete de comandos (shell) de Python</h2>\n<p>Otra manera de interactuar con un intérprete es usando lo que se conoce como <em>shell</em> o intérprete de comandos. Se puede escribir en una declaración y oprimir la tecla Enter, y el shell responderá a tus comandos. Utilizar un shell es una excelente forma de comprobar que la construcción de tus declaraciones es adecuada al asegurarte que hace lo que tu piensas que debería hacer. Esto se puede hacer de maneras un tanto distintas en las diversas plataformas (Mac, Windows o Linux).</p>\n<p>Puedes ejecutar un shell de Python haciendo doble clic en el archivo ejecutable <code>python.exe</code>. Si instalaste la más reciente versión de Python 3.8 (la más reciente para noviembre de 2019), probablemente el archivo .exe  esté localizado en el directorio <code>C:\\Users\\tunombredeusuario\\AppData\\Local\\Programs\\Python\\Python38-32</code>. En la ventana del intérprete de comandos (&quot;Símbolo de Sistema&quot;), escribe:</p>\n<pre><code class=\"language-python\">print(&#39;Hola Mundo&#39;)\n</code></pre>\n<p>Oprime la tecla Enter. La computadora responderá con:</p>\n<pre><code class=\"language-python\">Hola Mundo\n</code></pre>\n<p>Cuando queramos representar la interacción con el intérprete de comandos usaremos -&gt; para indicar la respuesta del shell a tus comandos, como se muestra inmediatamente:</p>\n<pre><code class=\"language-python\">Print(&#39;Hola Mundo&#39;)\n-&gt; Hola Mundo\n</code></pre>\n<p>En la pantalla de tu computadora aparecerá de esta manera:</p>\n<p>{% include figure.html filename=&quot;windows-python3-cmd.png&quot; caption=&quot;Python Shell en Windows&quot; %}</p>\n<p>Ahora que tú y tu computadora están en marcha y funcionando, podemos movernos hacia unas tareas algo más interesantes. Si estás trabajando de manera ordenada las lecciones de Python, te sugerimos que pases ahora a la lección <a href=\"/es/lecciones/ver-archivos-html\">Para entender páginas web y HTML</a>.</p>\n"}