{"metadata":{"title":"Python Introduction and Installation","layout":"lesson","date":"2012-07-17T00:00:00.000Z","authors":["William J. Turkel","Adam Crymble"],"reviewers":["Jim Clifford","Amanda Morton"],"editors":["Miriam Posner"],"difficulty":1,"exclude_from_check":["review-ticket"],"activity":"transforming","topics":["python","get-ready"],"abstract":"This first lesson in our section on dealing with Online Sources is designed to get you and your computer set up to start programming. We will focus on installing the relevant software – all free and reputable – and finally we will help you to get your toes wet with some simple programming that provides immediate results.","redirect_from":"/lessons/introduction-and-installation","avatar_alt":"A curled-up snake","doi":"10.46430/phen0009","next":"viewing-html-files","series_total":"15 lessons","sequence":1},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"lesson-goals\">Lesson Goals</h2>\n<p>This first lesson in our section on dealing with Online Sources is\ndesigned to get you and your computer set up to start programming. We\nwill focus on installing the relevant software – all free and reputable\n– and finally we will help you to get your toes wet with some simple\nprogramming that provides immediate results.</p>\n<p>In this opening module you will install the <a href=\"http://www.python.org/\">Python programming\nlanguage</a>, the <a href=\"http://www.crummy.com/software/BeautifulSoup/\">Beautiful Soup HTML/XML parser</a>, and a text editor.\nScreencaps provided here come from <a href=\"http://www.activestate.com/komodo-edit\">Komodo Edit</a>, but you can use any\ntext editor capable of working with Python. Here&#39;s a list of other\noptions: <a href=\"http://wiki.python.org/moin/PythonEditors/\">Python Editors</a>. Once everything is installed, you will\nwrite your first programs, &quot;Hello World&quot; in Python and HTML.</p>\n<h2 id=\"the-python-programming-language\">the Python Programming Language</h2>\n<p>The programming language we will use in this series of lessons is Python,\na free, open source language. Unless otherwise noted, we will be using\n<strong>Python 3</strong> throughout. Version 2 is no longer officially supported,\nbut you might still find it used in older projects or lessons.\n<a href=\"http://sebastianraschka.com/Articles/2014_python_2_3_key_diff.html\">Python 3 has a few differences in formatting</a> (think grammar rules), so beware if you find examples online that still use Python 2. They might not run under current versions of Python.</p>\n<h2 id=\"backup-your-work\">Backup Your Work!</h2>\n<p>Before you download or install any new software, it is crucial that you\nmake backups of your work. You should back up your whole computer at least\nweekly, and preferably more frequently. It is also a good idea to make\noff-site backups of your work, so that you don&#39;t lose everything if\nsomething happens to your computer or to your home or office. Sites like\n<a href=\"https://www.jungledisk.com/\">Jungle Disk</a> and <a href=\"https://www.dropbox.com/home\">Dropbox</a> provide easy-to-use and relatively\ninexpensive online backup options.</p>\n<h3 id=\"choose-your-operating-system\">Choose Your Operating System</h3>\n<h2 id=\"step-1--install-and-set-up-software\">Step 1 – Install and Set Up Software</h2>\n<p>In order to work through the techniques in this website, you will need to\ndownload and install some freely available software. We have provided\ninstructions for Mac, Windows and Linux. Once you have installed the\nsoftware for your operating system, move on to &#39;<a href=\"/lessons/viewing-html-files\">Viewing HTML Files</a>&#39;.\nIf you run into trouble with our instructions or find something that\ndoesn&#39;t work on your platform, please let us know.</p>\n<ul>\n<li><a href=\"/lessons/mac-installation\">Mac Python Installation</a></li>\n<li><a href=\"/lessons/windows-installation\">Windows Python Installation</a></li>\n<li><a href=\"/lessons/linux-installation\">Linux Python Installation</a></li>\n</ul>\n"}