{"metadata":{"title":"Working with batches of PDF files","collection":"lessons","layout":"lesson","slug":"working-with-batches-of-pdf-files","date":"2020-01-30T00:00:00.000Z","authors":["Moritz Mähr"],"reviewers":["Catherine DeRose","Jack Pay"],"editors":["Anna-Maria Sichani"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/258","difficulty":2,"activity":"transforming","topics":["data-manipulation","data-management"],"abstract":"Learn how to perform OCR and text extraction with free command line tools like Tesseract and Poppler and how to get an overview of large numbers of PDF documents using topic modeling.","avatar_alt":"working-with-batches-of-pdf-files","doi":"10.46430/phen0088"},"html_body":"<h1 id=\"a-table-of-contents\">A Table of Contents</h1>\n<p>{% include toc.html %}</p>\n<h1 id=\"overview\">Overview</h1>\n<h2 id=\"motivation\">Motivation</h2>\n<p>Humanities scholars often work with text-based historical and contemporary sources. In most cases, the <a href=\"https://en.wikipedia.org/wiki/PDF\">Portable Document Format (PDF)</a> is used as an exchange format. This includes digital reproductions of physical sources such as books and photographs as well as digitally created documents. The digitisation of these objects increases their accessibility and availability. Archives have begun to digitise entire collections and make them accessible via the Internet. Even more dramatic is the increase in the amount of data in digitally created sources such as those necessary for corporate and government reporting. As a result, humanities scholars are increasingly exploring larger collections by means of Distant Reading and other algorithmic tools. However, PDF documents are only suitable for digital processing to a limited extent and must first be converted into plain text files.</p>\n<h2 id=\"scope\">Scope</h2>\n<p>If you meet one or more of the following criteria, this lesson will be instructive for you:</p>\n<ul>\n<li>You work with text-based sources and need to extract the content of the sources</li>\n<li>Your files are in PDF file format or can be converted to this file format</li>\n<li>You work with a large corpus and you do not want to touch each file individually (batch processing)</li>\n<li>You want to examine your corpus by the means of <a href=\"/en/lessons/?topic=distant-reading\">Distant Reading</a> and therefore need it to be in plain text format</li>\n<li>You don’t have access to commercial software, such as Adobe Acrobat Professional or Abbyy FineReader</li>\n</ul>\n<h2 id=\"objectives\">Objectives</h2>\n<p>In more technical terms, in this lesson you will learn to:</p>\n<ul>\n<li>Recognize and extract texts in PDFs with <a href=\"https://en.wikipedia.org/wiki/Optical_character_recognition\">Optical Character Recognition (OCR)</a></li>\n<li>Extract embedded texts from PDFs</li>\n<li>Extract embedded images from PDFs</li>\n<li>Combine images and PDFs into a single PDF file</li>\n<li>Do all of the above at once (batch processing) with a large corpus.</li>\n<li>Analyze a large corpus using <a href=\"https://en.wikipedia.org/wiki/Topic_model\">Topic Modelling</a> to get a quick overview of the topics it contains</li>\n</ul>\n<div class=\"alert alert-info\">\n<a href=\"https://en.wikipedia.org/wiki/Tesseract_(software)\">Tesseract OCR software</a> used in this lesson supports over 110 languages including non-western languages and writing systems.\n\n</div>\n\n<h1 id=\"prerequisites\">Prerequisites</h1>\n<h2 id=\"skills\">Skills</h2>\n<p>You should feel comfortable using the command line of your computer. Windows users should take a look at <a href=\"/en/lessons/intro-to-powershell\">Introduction to the Windows Command Line with PowerShell</a>. MacOS and Linux users should take a look at <a href=\"/en/lessons/intro-to-bash\">Introduction to the Bash Command Line</a>.</p>\n<h2 id=\"software\">Software</h2>\n<h3 id=\"windows-10\">Windows 10</h3>\n<p>Some components of the unix-based open source software used in this lesson do not run on Windows systems natively. Fortunately, since the Windows 10 Fall Creators Update there is a workaround. Open <a href=\"https://docs.microsoft.com/en-us/powershell/scripting/getting-started/starting-windows-powershell\">PowerShell</a> as administrator and run <code>Enable-WindowsOptionalFeature -Online -FeatureName Microsoft-Windows-Subsystem-Linux</code>. Install <a href=\"https://www.microsoft.com/store/apps/9N9TNGVNDL3Q\">Ubuntu 18.04 LTS</a> from the Microsoft Store. To <a href=\"https://docs.microsoft.com/en-us/windows/wsl/\">initialize</a> the Windows Subsystem for Linux (WSL) click on the Ubuntu tile in the Start Menu and create a user account.[^1]</p>\n<div class=\"alert alert-warning\">\n\n<p>Follow these instructions carefully and do not lose your credentials. You will need them as soon as you run programs as administrator.</p>\n</div>\n\n<p>Once the WSL is up and running, navigate to your working directory (for example Downloads). Invoke <code>bash</code> through PowerShell and install all requirements via the built-in package manager <a href=\"https://wiki.debian.org/Aptitude\">Aptitude</a>.</p>\n<pre><code class=\"language-powershell\">bash\n</code></pre>\n<pre><code class=\"language-bash\">sudo apt install ocrmypdf tesseract-ocr-all poppler-utils imagemagick\n</code></pre>\n<h3 id=\"macos\">MacOS</h3>\n<p>Installing all the requirements without a package manager is cumbersome. Therefore install the <a href=\"https://itunes.apple.com/us/app/xcode/id497799835\">Command Line Tools for Xcode</a> and <a href=\"https://brew.sh\">Homebrew</a> first. It offers an easy way to install all the tools and software needed for this lesson.</p>\n<pre><code class=\"language-bash\">xcode-select --install\n/usr/bin/ruby -e &quot;$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)&quot;\nbrew install ocrmypdf tesseract-lang poppler imagemagick\n</code></pre>\n<h3 id=\"linux\">Linux</h3>\n<p>On <a href=\"https://ubuntu.com/download/desktop\">Ubuntu 18.04 LTS</a> and most Debian-based Linux distributions you can install all requirements via <code>aptitude</code>.</p>\n<pre><code class=\"language-bash\">apt install ocrmypdf tesseract-ocr-all poppler-utils imagemagick\n</code></pre>\n<p>Even though all tools used in this lesson are shipped with Ubuntu, an update is recommended.</p>\n<h3 id=\"topic-modelling\">Topic Modelling</h3>\n<p>The Topic Modelling in the case study is performed with the <a href=\"https://dariah-de.github.io/TopicsExplorer/\">DARIAH Topics Explorer</a>. It is a very easy to use tool with a graphical user interface. You can download the open source program for Windows, Mac and Linux <a href=\"https://github.com/DARIAH-DE/TopicsExplorer/releases\">here</a>.</p>\n<div class=\"alert alert-warning\">\n\n<p>If you are using a Mac and receive an error message that the file is from an “unidentified developer,” you can overwrite it by holding control while double-clicking it. If that doesn&#39;t work, go to Systems Preferences, click on Security &amp; Privacy, and then click Open Anyway.</p>\n</div>\n\n<h2 id=\"data\">Data</h2>\n<p>Throughout this lesson you will work with historical documents from the <a href=\"https://web.archive.org/web/20200606003222/https://ilostat.ilo.org/resources/methods/icls/icls-documents/\">First International Conference of Labour Statisticians</a> from 1923. The data of all past conferences is provided by the <a href=\"https://www.ilo.org/global/about-the-ilo/history/lang--en/index.htm\">International Labour Organization (ILO)</a> and is <a href=\"https://www.ilo.org/public/libdoc/ilo/ILO-SR/\">publicly available</a>.</p>\n<p>To make it easier for you to navigate through the file system and create folders, here are some basic commands of the Bash Command Line:</p>\n<ul>\n<li>Display the path of the current folder with <code>pwd</code></li>\n<li>Display the contents of the current folder with <code>ls</code></li>\n<li>Display only PDF files in the current folder with <code>ls *.pdf</code></li>\n<li>Create a folder named proghist with <code>mkdir proghist</code></li>\n<li>Change to this folder with <code>cd proghist</code></li>\n<li>Open your current folder with a file browser <code>open .</code> (On Windows use <code>explorer.exe .</code>)</li>\n<li>Change to the parent folder with <code>cd ..</code></li>\n<li>Change to your users home directory with <code>cd</code></li>\n<li>Paste the code snippets into <a href=\"https://explainshell.com/\">explainshell.com</a> to see what the code actually does</li>\n</ul>\n<div class=\"alert alert-warning\">\n\n<p>Throughout the lesson I will assume that &#39;proghist&#39; is your working directory.</p>\n</div>\n\n<p>Save all files below to your working directory:</p>\n<ul>\n<li><a href=\"https://www.ilo.org/public/libdoc/ilo/ILO-SR/ILO-SR_N1_engl.pdf\">Classification of industries</a><!--text extraction--></li>\n<li><a href=\"https://www.ilo.org/public/libdoc/ilo/ILO-SR/ILO-SR_N2_engl.pdf\">Statistics of wages and hours of labour</a><!--ocr--></li>\n<li><a href=\"https://www.ilo.org/public/libdoc/ilo/ILO-SR/ILO-SR_N3_engl.pdf\">Statistics of industrial accidents</a><!--text extraction--></li>\n<li><a href=\"https://www.ilo.org/public/libdoc/ilo/ILO-SR/ILO-SR_N4_engl.pdf\">Report of the Conference</a><!--text extraction--></li>\n<li><a href=\"https://www.ilo.org/public/libdoc/ilo/P/09602/09602(1924-9-1)3-30.pdf\">International labour review</a><!--text extraction--></li>\n</ul>\n<p>To illustrate image extraction and PDF merging you will include one more files to our corpus that is not directly related to the First International Conference of Labour Statisticians from 1923.</p>\n<ul>\n<li><a href=\"https://www.ilo.org/public/libdoc/ilo/1923/23B09_5_engl.pdf\">Speeches made at the ceremony on 21 October 1923</a> <!--extract images, combine documents--></li>\n</ul>\n<p>For the Topic Modelling of the <a href=\"#use-topic-modelling-to-analyze-the-corpus\">case study</a> you will download more files later in the lesson.</p>\n<div class=\"alert alert-danger\">\n\n<p>Always make a backup copy of your data before using the commands in this course. Text recognition and combining PDFs can change the original files.</p>\n</div>\n\n<h1 id=\"assessing-your-pdfs\">Assessing Your PDF(s)</h1>\n<p>In order to make this lesson as realistic as possible, you will be guided by a concrete historical case study. The study draws on the extensive collection of the <a href=\"http://web.archive.org/web/20200606003222/https://ilostat.ilo.org/resources/methods/icls/icls-documents/\">International Labour Organization (ILO)</a>, in particular the sources of the First International Conference of Labour Statisticians.</p>\n<p>You are interested in what topics were discussed by the labour statisticians. For this purpose you will want to analyze all available documents of this conference using Topic Modelling. This assumes that all documents are available in plain text.</p>\n<p>First you will get an overview of our corpus. Large databases can create a false impression of evidence. Therefore, the documents must be subjected to qualitative analysis. For this you will use scientific methods such as <a href=\"https://en.wikipedia.org/wiki/Source_criticism\">source criticism</a>. All documents are written in English and are set in the same font. <code>ILO-SR_N1_engl.pdf</code>, <code>ILO-SR_N2_engl.pdf</code>, <code>ILO-SR_N3_engl.pdf</code> and <code>ILO-SR_N4_engl.pdf</code> are part of the same series. In addition, you note that the <code>ILO-SR_N2_engl.pdf</code> file does not contain any embedded text. You also note that <code>23B09_5_engl.pdf</code> contains images. One of these images contains text.[^2]</p>\n<ol>\n<li>You will recognize the text of <code>ILO-SR_N2_engl.pdf</code></li>\n<li>You will extract the text from all PDF files</li>\n<li>You will extract images from <code>23B09_5_engl.pdf</code></li>\n<li>For illustrative purposes, you will combine different images and documents into a single PDF document. This can be helpful if the scanning process involves individual image files that are to be combined into a single document</li>\n<li>You will analyze a lot of plain text files using Topic Modelling</li>\n</ol>\n<h2 id=\"text-recognition-in-pdf-files\">Text Recognition in PDF Files</h2>\n<p>For the text recognition, you will use <a href=\"https://ocrmypdf.readthedocs.io\">OCRmyPDF</a>. This software is based on the state-of-the-art open source text recognition software <a href=\"https://github.com/tesseract-ocr/tesseract\">Tesseract</a>, which is maintained and further developed by Google. The software automatically recognizes the page orientation, corrects skewed pages, cleans up image artifacts, and adds an OCR text layer to the PDF. Only the document language must be given as a parameter.</p>\n<pre><code class=\"language-bash\">ocrmypdf --language eng --deskew --clean &#39;ILO-SR_N2_engl.pdf&#39; &#39;ILO-SR_N2_engl.pdf&#39;\n</code></pre>\n<p>{% include figure.html filename=&quot;working-with-batches-of-pdf-files1.png&quot; caption=&quot;Figure 1: The status messages of the software indicate recognition errors in the OCR process.&quot; %}</p>\n<p>The status messages of the software indicate recognition errors during the OCR process (see Figure 1). If certain errors occur systematically, it may be worthwhile to write a correction script. See <a href=\"/en/lessons/cleaning-ocrd-text-with-regular-expressions\">Cleaning OCR’d text with Regular Expressions</a>.</p>\n<div class=\"alert alert-info\">\n\n<p>OCRmyPDF has many useful parameters to optimize your results. See the <a href=\"https://ocrmypdf.readthedocs.io/en/latest/cookbook.html\">documentation</a>. The output might look slightly different depending on the version used.</p>\n</div>\n\n<p>To process all PDF files in your working directory at once. OCRmyPDF automatically skips PDFs that already contain embedded text.</p>\n<pre><code class=\"language-bash\">find . -name &#39;*.pdf&#39; -exec ocrmypdf --language eng --deskew --clean &#39;{}&#39; &#39;{}&#39; \\;\n</code></pre>\n<h2 id=\"extract-embedded-text-from-pdfs\">Extract Embedded Text from PDFs</h2>\n<p>To extract the embedded texts from the PDF files use <a href=\"https://en.wikipedia.org/wiki/Poppler_(software)\">Poppler</a>). It is a very powerful command line tool for processing PDF files that is used by many other programs.</p>\n<pre><code class=\"language-bash\">pdftotext &#39;ILO-SR_N1_engl.pdf&#39; &#39;ILO-SR_N1_engl.txt&#39;\n</code></pre>\n<p>To process all PDF files in your working directory at once. The status message <code>Syntax Warning: Invalid Font Weight</code> means that the file contains formatting that does not meet the standard specifications of PDF. You can safely ignore this message.</p>\n<pre><code class=\"language-bash\">find . -name &#39;*.pdf&#39; -exec pdftotext &#39;{}&#39; &#39;{}.txt&#39; \\;\n</code></pre>\n<p>Once you have extracted all the embedded text from the PDFs, you can easily browse the text files. You can use the Windows Explorer, MacOS Finder, or a command line program like <code>grep</code>. You can display all the mentions of the term “statistics”.</p>\n<pre><code class=\"language-bash\">grep &#39;statistic&#39; . -R\n</code></pre>\n<p><code>grep</code> is also able to process complicated search queries (so-called <a href=\"https://manpages.ubuntu.com/manpages/bionic/en/man1/grep.1.html#regular%20expressions\">regular expressions</a>). For example, you can also search for all files containing either “labour statistics” or “wage statistics”.</p>\n<pre><code class=\"language-bash\">grep -E &#39;labour statistics|wage statistics&#39; . -R\n</code></pre>\n<p>Regular expressions also include numbers. This is particularly interesting for historians. This command displays all years in the twentieth century.</p>\n<pre><code class=\"language-bash\">grep -E &#39;19[0-9][0-9]&#39; . -R\n</code></pre>\n<p>Once you have successfully extracted all text from the PDF files, they can be further analyzed using methods of <a href=\"/en/lessons/?topic=distant-reading\">Distant Reading</a> such as <a href=\"/en/lessons/topic-modeling-and-mallet\">Topic Modelling</a>. You will apply such methods to the case study later in this lesson.</p>\n<h2 id=\"extract-embedded-images-from-pdfs\">Extract Embedded Images from PDFs</h2>\n<p>PDF is a container file format and can contain multiple embedded images per page. You can also use Poppler to extract those images. The program allows us to select a target format for the extracted images. It is recommended to you use a lossless image format like PNG when working with the images.</p>\n<pre><code class=\"language-bash\">pdfimages -png &#39;23B09_5_engl.pdf&#39; &#39;23B09_5_engl&#39;\n</code></pre>\n<div class=\"alert alert-info\">\n\n<p>For digitally created documents, Poppler extracts all embedded image files. This often includes image files that are outside the visible area or overlaid by other objects.</p>\n</div>\n\n<p>To process all PDF files in your working directory at once.</p>\n<pre><code class=\"language-bash\">find . -name &#39;*.pdf&#39; -exec pdfimages -png &#39;{}&#39; &#39;{}&#39; \\;\n</code></pre>\n<p>Poppler can only extract illustrations if they are available as individual images in the PDF file. If you want to extract illustrations from a scanned page take a look at this lesson: <a href=\"/en/lessons/extracting-illustrated-pages\">Extracting Illustrated Pages from Digital Libraries with Python</a>.</p>\n<h2 id=\"combine-images-and-pdfs-into-a-single-pdf\">Combine Images and PDFs into a Single PDF</h2>\n<p>Although OCRmyPDF can process image files directly, there are cases where you first want to combine the images into a PDF document. Because most image formats do not support multiple pages, each page of a document has to be saved as a single file. With the widespread command line image editing software <a href=\"https://imagemagick.org/\">ImageMagick</a> you can achieve this very easily.</p>\n<pre><code class=\"language-bash\">convert &#39;23B09_5_engl-002.png&#39; &#39;23B09_5_engl-004.png&#39; &#39;23B09_5_engl-006.png&#39; &#39;23B09_5_engl-007.png&#39; &#39;some-images-combined.pdf&#39;\n</code></pre>\n<p>To combine all images into a PDF file at once use the wildcard operator <code>*.png</code>. This step could take a few minutes.</p>\n<pre><code class=\"language-bash\">convert &#39;*.png&#39; &#39;all-images-combined.pdf&#39;\n</code></pre>\n<p>If you want to combine different PDF files, you can rely on Poppler. Poppler does this job much faster than ImageMagick and preserves attributes of the original documents.</p>\n<pre><code class=\"language-bash\">pdfunite &#39;ILO-SR_N1_engl.pdf&#39; &#39;ILO-SR_N2_engl.pdf&#39; &#39;ILO-SR_N3_engl.pdf&#39; &#39;ILO-SR_N4_engl.pdf&#39; &#39;some-pdfs-combined.pdf&#39;\n</code></pre>\n<h2 id=\"use-topic-modelling-to-analyze-the-corpus\">Use Topic Modelling to Analyze the Corpus</h2>\n<p>Now that you have performed all the steps of the PDF processing on some examples, you can return to the historical question of the case study. Which topics were discussed by the labour statisticians at the international conferences of the ILO? In order to answer this question using Topic Modelling, the following steps are necessary:</p>\n<ol>\n<li>Download the corpus</li>\n<li>Prepare and clean up the corpus</li>\n<li>Create the Topic Model</li>\n<li>Evaluate the Topic Model</li>\n</ol>\n<div class=\"alert alert-info\">\n  Both the download and the processing of the corpus are time consuming and resource intensive. At <a href=\"https://zenodo.org/record/3582818/files/20191218-ilo-dataset.zip?download=1\">doi.org/10.5281/zenodo.3582736</a> you can download the collection as a ZIP file and go directly to step\n  3.\n</div>\n\n<h3 id=\"download-the-corpus\">Download the Corpus</h3>\n<p>To avoid confusion create a new folder with <code>mkdir</code> and open it with <code>cd</code>.</p>\n<pre><code class=\"language-bash\">mkdir case_study\ncd case_study\n</code></pre>\n<p>You can download the corpus from the <a href=\"https://www.ilo.org/public/libdoc/ilo/ILO-SR/\">ILO website</a>. All English documents contain ‘engl’ in the title. It’s over a gigabyte of data. Depending on your internet speed this may take a while.</p>\n<p>To automate this step you can use the following command line commands. This will download all English documents (340 files) at once.</p>\n<pre><code class=\"language-bash\">curl https://www.ilo.org/public/libdoc/ilo/ILO-SR/ |\ngrep -o &#39;ILO[^&quot;]*engl[^&quot;&gt;&lt;\\/]*&#39; |\nuniq |\nsed &#39;s,ILO,https://www.ilo.org/public/libdoc/ilo/ILO-SR/ILO,g&#39; &gt; list_of_files.txt\nxargs -n 1 curl -O &lt; list_of_files.txt\nrm list_of_files.txt\n</code></pre>\n<h3 id=\"prepare-and-clean-up-the-corpus\">Prepare and Clean Up the Corpus</h3>\n<p>Now you can batch process all downloaded PDF files. First, perform text recognition on all files that don’t have embedded text. Then extract all embedded text from the files. Depending on the performance of your computer, this step may take several hours.</p>\n<pre><code class=\"language-bash\">find . -name &#39;*.pdf&#39; -exec ocrmypdf --language eng --deskew --clean &#39;{}&#39; &#39;{}&#39; \\; &amp;&amp;\nfind . -name &#39;*.pdf&#39; -exec pdftotext &#39;{}&#39; &#39;{}.txt&#39; \\;\n</code></pre>\n<h3 id=\"create-the-topic-model\">Create the Topic Model</h3>\n<p>In order to create a Topic Model with the DARIAH Topics Explorer, you don’t need to have any deeper mathematical knowledge about the Latent Dirichlet Allocation (LDA) that is used.[^3] Nevertheless, it is worth clarifying some implicit assumptions of the model before you begin:</p>\n<ul>\n<li>A corpus consists of documents. Each document consists of words. Words are carriers of meaning. The order (sentences, sections, etc.) of the words is very important to understand its content. But it is not factored in for the purposes of this analysis. Only the frequency of words in a document or corpus (or more precisely the co-occurrence of words) is measured</li>\n<li>You determine how many topics are present in the corpus.</li>\n<li>Each word has a specific probability of belonging to a topic. The algorithm finds the corresponding probabilities of the individual words</li>\n<li>Words that occur very frequently do little to discriminate between the individual topics. They are often function words such as &#39;and&#39;, &#39;but&#39; and so forth. Therefore, they should not be included in the analysis</li>\n<li>Topic modeling using LDA is non-deterministic. This means that a different result can be obtained for each run. Fortunately, the result usually converges towards a stable state. Run it several times and compare the results. You will quickly see if the topics remain stable</li>\n</ul>\n<p>Now open the <a href=\"https://dariah-de.github.io/TopicsExplorer/\">DARIAH Topics Explorer</a> and follow the steps given in the software. Then:</p>\n<ol>\n<li>Select all 340 text files for the analysis.</li>\n<li>Remove the 150 most common words. Alternatively, you can also load the file with the English stop words contained in the <a href=\"https://github.com/DARIAH-DE/TopicsExplorer/tree/master/data\">example Corpus</a> of the DARIAH Topics Explorer.</li>\n<li>Choose 30 for the number of topics and 200 for the number of iterations. You should play with the number of topics and choose a value between 10 and 100. With the number of iterations you increase the accuracy to the price of the calculation duration.</li>\n<li>Click on &#39;Train Model&#39;. Depending on the speed of your computer, this process may take several minutes.</li>\n</ol>\n<h3 id=\"evaluate-the-topic-model\">Evaluate the Topic Model</h3>\n<p>The <a href=\"https://dariah-de.github.io/TopicsExplorer/\">DARIAH Topics Explorer</a> has a graphical user interface that makes it very easy to explore and evaluate the Topic Model and its thirty topics. In this run, the second topic looks like this (see Figure 2).</p>\n<p>{% include figure.html filename=&quot;working-with-batches-of-pdf-files2.png&quot; caption=&quot;Figure 2: DARIAH Topics Explorer showing related words, related documents and similar topics of a single topic.&quot; %}</p>\n<p>This topic deals with various social insurance schemes. Both old-age provision and unemployment benefits are included. The words are sorted in descending order of relevance and give a good overview of the topic. You can also see which documents have the highest correspondence with this topic. As you can see when you look at related topics, this topic is close to accident insurance and legislation.</p>\n<p>To further process or visualize the results with a spreadsheet program, click on the &#39;Export Data&#39; button. The paper &#39;Parliament’s Debates about Infrastructure&#39; by Jo Guldi illustrates how Topic Modelling can be put to use for historical research.[^4]</p>\n<h1 id=\"concluding-remarks\">Concluding Remarks</h1>\n<p>Over the past decades, PDF has become the de facto standard for archiving and exchanging digital text documents.[^5] However, this is not only the case for projects that focus primarily on digitized historical sources. For most digitally generated content, such as websites and interactive documents, as yet no generally accepted archiving formats have been established. Therefore, PDF is often used in these cases as well. Sometimes contemporary source documents present us with the same challenges as inferior scans of historical documents.</p>\n<p>The Mueller Report is the official report documenting the findings and conclusions of the investigation by former Special Advisor Robert Mueller into Russian efforts to interfere in the 2016 presidential election in the United States, the allegation of conspiracy or coordination between Donald Trump&#39;s presidential campaign and Russia, and the allegation of obstruction of justice. As a technical analysis by Duff Johnson shows, the Mueller Report was digitally created, printed, scanned at least once, and sent for text recognition in an inferior version. Text and metadata were lost, which would have made working with the document much easier. It is unclear whether this deterioration in quality is intentional or due to complicated administrative procedures. In any case, it makes researchers&#39; lives more difficult.[^6]</p>\n<h2 id=\"alternatives\">Alternatives</h2>\n<p>This lesson focused on tools that are easy to use and are available as open source software free of charge. There are a lot of open source and commercial <a href=\"https://en.wikipedia.org/wiki/List_of_PDF_software\">alternatives</a> to process PDF files.[^7] <a href=\"/en/lessons/topic-modeling-and-mallet\">Getting Started with Topic Modeling and MALLET</a> covers one of many alternatives for Topic Modelling.</p>\n<p>[^1]: If you run into troubles <a href=\"https://docs.microsoft.com/en-us/windows/wsl/install-win10\">activating</a> the WSL check out the <a href=\"https://docs.microsoft.com/en-us/windows/wsl/troubleshooting\">troubleshooting</a>, <a href=\"https://aka.ms/wsldocs\">documentation</a>, or the <a href=\"https://aka.ms/learnwsl\">learning</a> resources.</p>\n<p>[^2]: In the case of a larger corpus, it is advisable to carry out random sampling instead of a detailed analysis. If no text is embedded in certain files, text recognition can be run over the entire corpus. Text recognition identifies embedded text when it is missing, and attempts to recognize it.</p>\n<p>[^3]: If you still want to learn more, see Ganegedara, Thushan. “Intuitive Guide to Latent Dirichlet Allocation.” <em>Medium</em>, August 23, 2018. <a href=\"https://towardsdatascience.com/light-on-math-machine-learning-intuitive-guide-to-latent-dirichlet-allocation-437c81220158\">https://towardsdatascience.com/light-on-math-machine-learning-intuitive-guide-to-latent-dirichlet-allocation-437c81220158</a>.</p>\n<p>[^4]: Guldi, Jo. “Parliament’s Debates about Infrastructure: An Exercise in Using Dynamic Topic Models to Synthesize Historical Change.” <em>Technology and Culture</em> 60, no. 1 (2019): 1–33. <a href=\"https://doi.org/10.1353/tech.2019.0000\">https://doi.org/10.1353/tech.2019.0000</a>.</p>\n<p>[^5]: The fourth chapter describes in detail the history of the PDF file format and the associated socio-technological upheaval, see Gitelman, Lisa. <em>Paper Knowledge: Toward a Media History of Documents.</em> Durham: Duke University Press, 2014.</p>\n<p>[^6]: Johnson, Duff. “A Technical and Cultural Assessment of the Mueller Report PDF.” <em>PDF Association</em> (blog), April 19, 2019. <a href=\"https://www.pdfa.org/a-technical-and-cultural-assessment-of-the-mueller-report-pdf/\">https://www.pdfa.org/a-technical-and-cultural-assessment-of-the-mueller-report-pdf/</a>.</p>\n<p>[^7]: Especially worth mentioning are the German wiki pages of the Ubuntu community about <a href=\"https://wiki.ubuntuusers.de/PDF/\">PDF</a> and <a href=\"https://wiki.ubuntuusers.de/Texterkennung/\">OCR</a>. These pages contain references to free software for working with PDF files and improving text recognition. Unfortunately, there are no translations into other languages for these pages, so a translation service should be used.</p>\n"}