{"metadata":{"title":"Introducción a Google Maps y Google Earth\n","layout":"lesson","date":"2013-12-13T00:00:00.000Z","translation_date":"2018-03-15T00:00:00.000Z","authors":["Jim Clifford","Josh MacFadyen","Daniel Macfarlane"],"reviewers":["Finn Arne Jørgensen","Sarah Simpkin"],"editors":["Adam Crymble"],"translator":["Andrés Gattinoni"],"translation-editor":["Maria José Afanador-Llach"],"translation-reviewer":["Antonio Rojas Castro","Jennifer Isasi"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/130","avatar_alt":"Un anciano consultando un globo terráqueo","original":"googlemaps-googleearth","difficulty":1,"activity":"presenting","topics":["mapping"],"abstract":"Google My Maps y Google Earth son una buena manera de comenzar a crear mapas digitales. Con una cuenta de Google puedes crear y editar mapas personales haciendo clic en Mis Sitios","next":"/lessons/qgis-layers","doi":"10.46430/phes0036"},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"google-maps\">Google Maps</h2>\n<p>Google My Maps y Google Earth son una buena manera de comenzar\na crear mapas digitales. Con una cuenta de Google puedes crear y editar\nmapas personales haciendo clic en Mis Sitios.</p>\n<p>My Maps te permite elegir entre diferentes mapas de base (incluyendo los\nhabituales satelital, físico y estándar) y agregar puntos, líneas y polígonos.\nTambién es posible importar datos de una hoja de cálculos si tienes columnas\ncon información geográfica (esto es, longitudes y latitudes o nombres de\nlugares). Esto automatiza una tarea que solía ser tediosa conocida como\ngeocodificación. Esta no es sólo una de las formas más sencillas de comenzar a\ntrazar tu información histórica en un mapa, sino que también ofrece el poder\ndel motor de búsqueda de Google. A medida que vayas leyendo acerca de lugares\ndesconocidos en documentos históricos, artículos de revistas o libros, puedes\nbuscarlos con Google Maps, marcando múltiples ubicaciones y de este modo\nexplorar cómo se relacionan geográficamente entre sí. Tus mapas personales son\nalmacenados por Google (en su nube), lo cual quiere decir que podrás acceder a\nellos desde cualquier computadora con una conexión a internet. Puedes mantenerlos\nprivados o incluirlos en tu sitio web o blog. Por último, tienes la opción de\nexportar tus puntos, líneas y polígonos como archivos KML y abrirlos en Google\nEarth o Quantum GIS.</p>\n<h3 id=\"comenzar\">Comenzar</h3>\n<ul>\n<li>Abre tu navegador favorito.</li>\n<li>Ingresa a <a href=\"https://www.google.com/maps/d/\">Google My Maps</a>.</li>\n<li>Identifícate con tu cuenta de Google si no estás conectado ya (si es\nnecesario, sigue las sencillas instrucciones para crear una cuenta).</li>\n</ul>\n<p>{% include figure.html caption=&quot;Figura 1&quot; filename=&quot;geo-es1.png&quot; %}</p>\n<ul>\n<li>Haz clic en el signo de interrogación en la esquina inferior derecha y luego\nen &quot;Visita guiada&quot; para una introducción de cómo funciona My Maps.</li>\n</ul>\n<p>{% include figure.html caption=&quot;Figura 2&quot; filename=&quot;geo-es2.png&quot; %}</p>\n<ul>\n<li><p>En la esquina superior izquierda aparece un menú con el título &quot;Mapa sin\nnombre&quot;. Haciendo clic en el título puedes renombrarlo como &quot;Mi mapa de\npruebas&quot; o lo que prefieras.</p>\n</li>\n<li><p>Luego está la barra de búsqueda.\nIntenta buscar una ubicación de tu proyecto de investigación actual. Luego,\nhaz clic en la ubicación y agrégala a tu mapa eligiendo &quot;Agregar al\nmapa&quot;. Éste es el método más sencillo para agregar puntos a tu nuevo mapa.\nPrueba a buscar algunos nombres de lugares históricos que ya no existen\n(como Berlin o Constantinople en Ontario). Obtendrás resultados mezclados,\nen los cuales Google a menudo identifica correctamente la ubicación pero\ntambién ofrece alternativas incorrectas. Esto es algo importante a tener\nen cuenta al crear una hoja de cálculos. Normalmente es preferible utilizar\nlos nombres modernos de los lugares para evitar el riesgo de que Google elija\nla Constantinopla equivocada.</p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es3.png&quot; caption=&quot;Figura 3&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo-es4.png&quot; caption=&quot;Figura 4&quot; %}</p>\n<ul>\n<li>Luego, puedes importar un set de datos. Haz clic en &quot;Importar&quot; debajo de\n&quot;Capa sin título&quot;.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es5.png&quot; caption=&quot;Figura 5&quot; %}</p>\n<ul>\n<li>Se abrirá una nueva ventana que te dará la opción de importar un archivo\nCSV (valores separados por coma), un XLSX (Microsoft Excel), un KML\n(formato de archivo para datos geográficos de Google) o GPX (un formato de\narchivo común para GPS). Los primeros dos son formatos comunes de hojas de\ncálculo. CSV es simple y universal y XLSX es el formato de MS Excel.\nTambién puedes utilizar una hoja de cálculo de Google a través de tu cuenta\nde Drive.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es6.png&quot; caption=&quot;Figura 6&quot; %}</p>\n<ul>\n<li>A continuación, descarga el\n<a href=\"/assets/Suministro_global_de_grasa_de_Reino_Unido_1894_1896.zip\">Archivo CSV del Suministro global de grasa de Reino Unido</a>\ny guárdalo en tu computadora. Si abres el archivo en Excel u otro programa\nde hojas de cálculo, encontrarás un set de datos sencillo de dos columnas\ncon una lista de diferentes tipos de grasas con los lugares asociados. Estos\ndatos fueron construidos utilizando tablas de importaciones británicas\nde 1896.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es7.png&quot; caption=&quot;Figura 7&quot; %}</p>\n<ul>\n<li>Arrastra el archivo al recuadro provisto por Google Maps.</li>\n<li>Te pedirá que indiques qué columna debe utilizar Google para colocar\nlas marcas de posición. Elige &quot;Lugar&quot;.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es8.png&quot; caption=&quot;Figura 8&quot; %}</p>\n<ul>\n<li>Luego, te solicitará que que elijas qué columna utilizar para\nlos marcadores. Elige &quot;Producto&quot;.</li>\n<li>Ahora deberías tener un mapa global de los mayores exportadores de grasa a\nGran Bretaña a mediados de la década de 1890.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es9.png&quot; caption=&quot;Figura 9: Clic para ver imagen en tamaño completo&quot; %}</p>\n<ul>\n<li>A continuación puedes explorar los datos en mayor detalle y modificar el\nEstilo para distinguir entre tipos diferentes de grasas.</li>\n<li>Haz clic en &quot;Estilo uniforme&quot;, debajo de la etiqueta &quot;Suministro global de\ngrasas de Reino Unido&quot; y elige la opción &quot;Estilo por columna de datos:\nProducto&quot;. A la izquierda, la leyenda mostrará la cantidad de ocurrencias de\ncada estilo entre paréntesis, por ejemplo: &quot;Semillas de lino (4)&quot;.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es10.png&quot; caption=&quot;Figura 10&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo-es11.png&quot; caption=&quot;Figura 11&quot; %}</p>\n<ul>\n<li>Sigue jugando con las opciones.</li>\n<li>Esta funcionalidad es una herramienta poderosa para mostrar sets de datos\nhistóricos. Sin embargo, tiene limitaciones, porque Google Maps sólo importa\nlas primeras 100 líneas de una hoja de cálculo. Por el momento sólo permite\nincluir hasta tres sets de datos en un mapa, es decir, un máximo de 300\nitems.</li>\n</ul>\n<p>[//]: # PENDIENTE\n{% include figure.html filename=&quot;geo12.png&quot; caption=&quot;Figura 12&quot; %}</p>\n<h3 id=\"crear-capas-de-vectores\">Crear capas de vectores</h3>\n<p>También puedes crear nuevas capas del mapa (conocidas formalmente como capas\nde vectores). Las capas de vectores son uno de los componentes principales del\nmapeo digital (incluido SIG). Sencillamente, son puntos, líneas o polígonos\nutilizados para representar características geográficas. Los puntos permiten\nidentificar y etiquetar ubicaciones clave, las líneas se usan\na menudo para calles o vías ferroviaras, y los polígonos te permiten representar\náreas (campos, edificios, distritos, etc.). En Google Maps funcionan del mismo\nmodo en que lo hacen en SIG. La mayor restricción es que sólo se puede agregar\nuna cantidad limitada de información a las tablas de la base de datos asociadas\ncon puntos, líneas o polígonos. Esto se convierte en una dificultad a medida que\ncrece tu investigación con mapas digitales, pero no es un problema cuando estás\ncomenzando. En Google Maps puedes agregar un marcador, un texto de descripción\ny enlaces a un sitio web o una foto. Encontrarás más información acerca\nde cómo crear vectores históricos en un SIG completo en\n<a href=\"/lessons/vector-layers-qgis\">Creating New Vector Layers in QGIS 2.0</a>.</p>\n<ul>\n<li>Para agregar una capa puedes utilizar la que ya ha sido creada con el\nnombre &quot;Capa sin título&quot;, haciendo clic en ella y renombrándola a &quot;Capa 1&quot;.\nO bien, puedes crear otra nueva: haz clic en el botón de &quot;Agregar capa&quot; y\nse creará una nueva &quot;Capa sin título&quot; que podrás renombrar como &quot;Capa 2&quot;.\nDebería verse así:</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es13.png&quot; caption=&quot;Figura 13&quot; %}</p>\n<ul>\n<li><p>Fíjete que a la izquierda de la capa hay una casilla de verificación:\nal desmarcarla se desactiva una capa (es decir, deja de verse en el mapa) y\nsu información. Desmarca la capa de &quot;Suministro global del grasa de Reino\nUnido&quot; y haz clic en Capa 1.</p>\n</li>\n<li><p>Antes de agregar capas de vectores debemos considerar qué mapa base\nutilizar. Al final de la ventana del menú hay una línea que dice &quot;Mapa\nbase&quot;. Un mapa base es uno que muestra información de fondo como rutas,\nfronteras, accidentes geográficos, etc., sobre el cual se pueden ubicar\ncapas con distintos tipos de información espacial. Google Maps te permite\nelegir entre una variedad de mapas base, dependiendo del tipo de mapa que\ndesées crear. Las imágenes de satélite se están convirtiendo en un formato\nestándar para el mapa base, pero tienen mucha información y pueden restarle\nvalor a otros aspectos del mapa que uno quiera destacar. Hay algunas\nalternativas sencillas como &quot;Físico claro&quot; o incluso &quot;Político claro&quot;, si\nnecesitas las divisiones políticas.</p>\n</li>\n<li><p>Haz clic en la flecha a la izquierda de &quot;Mapa base&quot; en el menu. Se abrirá\nun submenú para elegir entre diferentes tipos de mapas base. Elige\n&quot;Satélite&quot;.</p>\n</li>\n<li><p>Comienza agregando algunos marcadores (el equivalente de Google de un punto).\nHaz clic en el botón de agregar marcadores debajo de la barra de búsqueda en\nla parte superior de la ventana y, a continuación, haz clic en el lugar del\nmapa donde quieres que aparezca el marcador.</p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es14.png&quot; caption=&quot;Figura 14&quot; %}</p>\n<ul>\n<li>Aparecerá un recuadro para etiquetar el marcador y agregar una descripción\nen un campo de texto. Agregamos Charlottetown y anotamos en la descripción\nque fue fundada en 1765.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es15.png&quot; caption=&quot;Figura 15&quot; %}</p>\n<ul>\n<li>Agrega algunos puntos más, incluyendo etiquetas y descripciones.</li>\n</ul>\n<p>[//]: # Aquí las opciones que ofrece Google Maps variaron respecto de la versión\n[//]: # con la que se hizo el original en inglés.</p>\n<ul>\n<li>Verás que tu marcador ahora aparece bajo &quot;Capa 1&quot; a la izquierda de tu\npantalla en la ventana del menú. Allí hay una opción para modificar la forma\ny el color del ícono haciendo clic en el símbolo ubicado a la derecha del\nnombre del marcador. Además, abajo del título &quot;Capa 1&quot; hay un link con el\ntexto &quot;Estilos individuales&quot; que abre un menú para controlar distintos\naspectos de la apariencia de la capa.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es16.png&quot; caption=&quot;Figura 16&quot; %}</p>\n<ul>\n<li><p>Ahora agregaremos algunas líneas y formas (llamadas polígonos en el programa\nde SIG). Agregar líneas y polígonos es un proceso bastante similar.\nDibujaremos algunas líneas en una nueva capa (los diferentes tipos de puntos,\nlíneas y formas deberían estar en capas separadas).</p>\n</li>\n<li><p>Selecciona la &quot;Capa 2&quot; en el menú (sabrás qué capa has seleccionado por el\nborde azul a la izquierda del item).</p>\n</li>\n<li><p>Haz clic en el ícono de &quot;Trazar una línea&quot; a la derecha del símbolo de\nmarcador y luego en &quot;Agregar línea o forma&quot;:</p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es17.png&quot; caption=&quot;Figura 17&quot; %}</p>\n<ul>\n<li><p>Elige una calle y haz clic con el mouse a lo largo de ella, calcando un\npoco la ruta. Aprieta &quot;Enter&quot; cuando quieras terminar la línea.</p>\n</li>\n<li><p>Nuevamente, aquí puedes agregar una etiqueta (por ejemplo, ponerle nombre a\nuna calle) e información descriptiva.</p>\n</li>\n<li><p>También puedes cambiar el color y el grosor de la línea. Para hacer esto,\nbusca la calle que acabas de dibujar en la Capa 2 en el menú y haz clic\na la derecha de su nombre.</p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es18.png&quot; caption=&quot;Figura 18&quot; %}</p>\n<ul>\n<li>Para crear un polígono (una forma) puedes conectar los puntos de la línea\nhasta alcanzar una forma cerrada. Para hacer esto, comienza a dibujar y\nfinaliza haciendo clic en el primer punto de tu línea. Puedes crear formas\nsimples, como el campo de un granjero, u otras mucho más complejas, como\nlos límites de una ciudad (ver ejemplos abajo). Te recomendamos\nexperimentar por tu cuenta creando líneas y polígonos.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es19.png&quot; caption=&quot;Figura 19&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo-es20.png&quot; caption=&quot;Figura 20&quot; %}</p>\n<ul>\n<li><p>Al igual que con los marcadores y líneas, puedes cambiar el nombre y la\ndescripción de un polígono. También puedes cambiar el color y el ancho de la\nlínea haciendo clic en el ícono a la derecha del nombre de tu polígono en el\nmenú, así como también cambiar la transparencia, que será abordada a\ncontinuación.</p>\n</li>\n<li><p>Verás que el área comprendida por un polígono está sombreada con el mismo\ncolor que el borde. Puedes cambiar la opacidad de esta sombra modificando la\n&quot;transparencia&quot;, lo cual altera el punto hasta el cual se puede ver\nclaramente la imagen de fondo (su mapa base).</p>\n</li>\n</ul>\n<h3 id=\"compartir-tu-mapa-personalizado\">Compartir tu mapa personalizado</h3>\n<ul>\n<li><p>La mejor manera de compartir el mapa en línea es utilizando el botón de\n&quot;Compartir&quot; en el menú. Al hacer click, obtendrás un enlace para enviar por\ncorreo electrónico o mediante redes sociales como G+, Facebook o Twitter.</p>\n</li>\n<li><p>Otra forma de compartir una versión dinámica de tu mapa es insertarlo en\nun blog o sitio web utilizando la opción &quot;Insertar en mi sitio&quot; del menú\ndesplegable que se encuentra a la derecha del nombre del mapa.\nAl seleccionar esta opción se obtiene una etiqueta de marco incorporado o\n&lt;iframe&gt; para incluir en un sitio HTML. Puedes modificar la altura y\nel ancho del marco cambiando los números entre comillas.</p>\n</li>\n</ul>\n<blockquote>\n<p>  Nota: actualmente no hay forma de configurar la escala por defecto o las\n  opciones de las leyendas de un mapa insertado, pero si necesitas eliminar la\n  leyenda del mapa que aparece en su sitio HTML puedes hacerlo reduciendo el\n  ancho del &lt;iframe&gt; a 580 o menos.</p>\n</blockquote>\n<ul>\n<li><p>Otra alternativa es exportar los datos a un archivo KML utilizando el mismo\nmenú desplegable, luego del cual te dará la opción de exportar el mapa\ncompleto  o seleccionar una capa en particular. Prueba exportando la capa\n&quot;Suministro  global de grasa de Reino Unido&quot;. Estos datos podrás importarlos\nluego en otros programas como Google Earth y Quantum GIS. Es una\nfuncionalidad importante, pues significa que si empiezas a trabajar con\nmapas digitales en Google Maps, luego podrás exportar lo que hayas hecho a\nuna base de datos SIG.</p>\n</li>\n<li><p>Si crees que el servicio gratuito de Google Maps te ofrece todas las\nherramientas que necesitas para tu tema de investigación, puedes finalizar\nla lección aquí. Si no, a continuación, aprenderás acerca de Google Earth y,\nen la lección 2, sobre Quantum GIS.</p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es21.png&quot; caption=&quot;Figura 21&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo-es22.png&quot; caption=&quot;Figura 22&quot; %}</p>\n<h2 id=\"google-earth\">Google Earth</h2>\n<p>Google Earth funciona en buena medida del mismo modo que Google Maps Engine Lite,\npero tiene funcionalidades adicionales. Por ejemplo, ofrece mapas 3D y acceso a\ndatos de numerosas fuentes de terceros, incluyendo colecciones de mapas\nhistóricos. Google Maps no te solicita que instale ningún programa y sus mapas son\nguardados en la nube. Google Earth, en cambio, debe ser instalado y no funciona\nen la nube, aunque los mapas que crees pueden ser exportados.</p>\n<ul>\n<li><p>Instala Google Earth: <a href=\"http://www.google.com/earth/index.html\">http://www.google.com/earth/index.html</a></p>\n</li>\n<li><p>Abre el programa y familiarízate con el globo terráqueo digital.\nUtiliza el menú para agregar y quitar capas de información. Esto es muy\nsimilar al modo en que funcionan programas más avanzados de SIG. Puedes\nagregar y quitar distintos tipos de informaciones geográficas incluyendo\nfronteras políticas (polígonos), rutas (líneas) y lugares (puntos). Mira las\nflechas rojas en la siguiente imagen para ver la ubicación de estas capas.</p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es23.png&quot; caption=&quot;Figura 23: Clic para ver la imagen en tamaño completo&quot; %}</p>\n<ul>\n<li>Fíjate que bajo el título &quot;Capas&quot; en el costado inferior izquierdo del margen\nde la ventana, Google ofrece una serie de capas listas para usar que se\nactivan seleccionando la casilla correspondiente.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es24.png&quot; caption=&quot;Figura 24&quot; %}</p>\n<ul>\n<li>Google Earth también incluye algunos mapas históricos escaneados y\nfotografías aéreas (en SIG este tipo de mapas, que están hechos de píxeles,\nse conocen como datos ráster). Dentro de &quot;Galería&quot; puedes encontrar y\nseleccionar los mapas históricos de la colección Rumsey. Esto agregará\níconos alrededor de todo el globo (con una mayor concentración en los\nEstados Unidos) de mapas escaneados que han sido georeferenciados (estirados\ny fijados para coincidir con una ubicación) sobre el globo terráqueo digital.\nEsto anticipa una metodología clave en los SIG históricos. (También\nencontrarás capas de mapas históricos y otras capas SIG en la Galería de\nGoogle Earth). Tómate un tiempo para explorar algunos mapas históricos.\nVerifica si hay algún mapa incluido en la colección Rumsey que pueda ser útil\npara tu investigación o tus clases. (Para obtener más mapas digitalizados\npero no georeferenciados, visita <a href=\"http://www.davidrumsey.com/\">www.davidrumsey.com</a>.)</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es25.png&quot; caption=&quot;Figura 25&quot; %}</p>\n<ul>\n<li>Posiblemente necesites hacer zoom para ver todos los íconos de mapas.\n¿Puedes encontrar el globo terráqueo de 1812?</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es26.png&quot; caption=&quot;Figura 26&quot; %}</p>\n<ul>\n<li>Al hacer clic en un ícono se abre un panel de información. Haz clic en\nla miniatura del mapa para verlo adherido al globo terráqueo digital.\nAprenderás a georeferenciar mapas correctamente en <a href=\"/lessons/georeferencing-qgis\">Georeferencing in QGIS 2.0</a>.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es27.png&quot; caption=&quot;Figura 27&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo-es28.png&quot; caption=&quot;Figura 28: Clic para ver imagen en tamaño completo&quot; %}</p>\n<h2 id=\"kml-archivos-de-keyhole-markup-language\">KML: archivos de Keyhole Markup Language</h2>\n<ul>\n<li><p>Google desarrolló un formato de archivo para guardar y compartir datos de\nmapas: KML. Este acrónimo deriva de Keyhole Markup Language y es un tipo de\narchivo fácilmente portable (es decir que un KML puede ser utilizado en\ndistintos tipos de programas SIG) que puede almacenar muchos tipos diferentes\nde datos SIG, incluyendo vectores.</p>\n</li>\n<li><p>Los mapas e imágenes que crees en Google Maps y Google Earth pueden ser\nguardados como archivos KML. Esto quiere decir que puedes guardar el trabajo\nhecho en ambos programas y que los archivos KML sirven para transferir datos\nentre las dos plataformas y llevar sus datos de mapa a Quantum GIS o ArcGIS.</p>\n</li>\n<li><p>Por ejemplo, puedes importar los datos de Google Maps Engine Lite.\nSi creaste un mapa en el ejercicio anterior, lo encontrarás haciendo clic\nen &quot;Mi mapa de prueba&quot; en la página de inicio de <a href=\"https://mapsengine.google.com/map/\">Maps Engine Lite</a>. Haz\nclic en el ícono con tres puntos a la derecha del título del mapa y luego\nselecciona &quot;Exportar a KML&quot;. (También puedes descargar y explorar el\n<a href=\"https://github.com/programminghistorian/jekyll/files/148993/seaway.zip\">mapa de la vía marítima</a> de Dan Macfarlane para esta parte del ejercicio).</p>\n</li>\n</ul>\n<p><strong>Importar tu archivo KML en Google Earth</strong></p>\n<ul>\n<li>Descarga el archivo KML de Google Maps Engine Lite (como fue descripto\narriba).</li>\n<li>Haz doble clic en el archivo KML en tu carpeta de Descargas.</li>\n<li>Busca los datos en la carpeta de &quot;Lugares Temporales&quot; de Google Earth.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es29.png&quot; caption=&quot;Figura 29: Clic para ver imagen en tamaño completo&quot; %}</p>\n<ul>\n<li>Ahora puedes explorar estos recursos cartográficos en 3D o agregar\nnuevas líneas, puntos y polígonos utilizando los distintos íconos ubicados\nen la parte superior izquierda de la ventana de Google Earth (ver imagen más\nabajo). Esto funciona esencialmente de la misma manera que en Google Maps,\naunque hay mayores funcionalidades y opciones. En el mapa de la vía marítima\nde Dan, los viejos canales y la actual vía marítima fueron trazados con\ndistintos colores y anchos de línea utilizando la herramienta de línea\n(superponiendo mapas históricos, lo cual se explica más abajo),\nmientras que varios recursos fueron señalados con los marcadores\ncorrespondientes. Para quienes les interese, también está la opción de\ngrabar un viaje que podría ser útil para presentaciones o con fines didácticos\n(cuando se selecciona el ícono de &quot;Guarda un viaje&quot; las opciones de grabación\naparecen en la sección inferior izquierda de la ventana).</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es30.png&quot; caption=&quot;Figura 30&quot; %}</p>\n<ul>\n<li>Prueba agregar un nuevo recurso a los datos de la vía marítima de Dan. Hemos\ncreado un polígono (en la terminología de SIG, un polígono es una forma\ncerrada de cualquier tipo: un círculo, un hexágono o un cuadrado son todos\nejemplos de polígonos) del lago St. Clair, que puede verse en la siguiente\nimagen. Busca el lago St. Clair (al este de Detroit) e intenta agregar un\npolígono.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es31.png&quot; caption=&quot;Figura 31: Clic para ver la imagen en tamaño completo&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo-es32.png&quot; caption=&quot;Figura 32&quot; %}</p>\n<ul>\n<li>Etiqueta el nuevo recurso como Lago St Claire. Luego, arrástralo\nencima de los datos de la vía marítima de Dan y agregalo a la colección.\nPuedes guardar esta versión extendida del mapa de la vía marítima como un KML\npara compartir por correo electrónico, subirlo a Google Maps, o exportar\nestos datos a QGIS. Utiliza la opción de buscar haciendo clic derecho en la\ncolección de la vía marítima y elige &quot;Guardar lugar como&quot;.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es33.png&quot; caption=&quot;Figura 33&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo-es34.png&quot; caption=&quot;Figura 34&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo-es35.png&quot; caption=&quot;Figura 35&quot; %}</p>\n<h2 id=\"agregar-mapas-históricos-escaneados\">Agregar mapas históricos escaneados</h2>\n<p>Google Earth permite utilizar una copia digital de un mapa histórico.\nÉste puede ser un mapa que ha sido escaneado o una imagen que ya está en formato\ndigital (para consejos sobre cómo encontrar mapas históricos en línea vea:\n<a href=\"http://niche-canada.org/2011/12/14/mobile-mapping-and-historical-gis-in-the-field/\">Mobile Mapping and Historical GIS in the Field</a>). El principal objetivo de\nutilizar un mapa digital, desde un punto de vista histórico, es ubicarlo encima\nde una imagen de Google Earth en el navegador, lo cual se conoce como superposición\n(<em>overlay</em>). Realizar superposiciones nos permite realizar comparaciones útiles\nde cambios a través del tiempo.</p>\n<ul>\n<li><p>Comienza identificando las imágenes que quieres utilizar: la imagen en Google\nEarth y el mapa que quieres superponer. Para esto último, el\narchivo puede ser en formato JPEG o TIFF, pero no PDF.</p>\n</li>\n<li><p>En Google Earth, identifica el área del mapa donde quieres aplicar la\nsuperposición. Ten en cuenta que puedes ir atrás en el tiempo (es decir, ver\nfotos satelitales más antiguas) haciendo clic en el ícono de &quot;Mostrar\nimágenes históricas&quot; en la barra superior y luego ajustando el control\ndeslizable de la escala temporal que aparecerá.</p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es36.png&quot; caption=&quot;Figura 36&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo-es37.png&quot; caption=&quot;Figura 37&quot; %}</p>\n<ul>\n<li>Una vez que hayas identificado las imágenes que quieres utilizar, haz clic\nen el ícono de &quot;Añadir superposición de imagen&quot; en la barra superior.</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es38.png&quot; caption=&quot;Figura 38&quot; %}</p>\n<ul>\n<li>Aparecerá una nueva ventana. Comienza poniéndole un título diferente si lo\ndeseas (por defecto es &quot;Superposición de imágenes sin título&quot;).</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es39.png&quot; caption=&quot;Figura 39: Clic en la imagen para ver en tamaño completo&quot; %}</p>\n<ul>\n<li><p>Haz clic en el botón &quot;Examinar&quot;, a la derecha del campo &quot;Vínculo&quot;, para\nseleccionar de tus archivos el mapa que desees que sea la imagen a superponer.</p>\n</li>\n<li><p>Corre la ventana de &quot;Nueva Superposición de Imágenes&quot; (no la cierres ni\nhagas clic en &quot;Cancelar&quot; o &quot;Aceptar&quot;) para poder ver el navegador de Google\nEarth. El mapa que cargaste aparecerá sobre la imagen satelital de Google Earth\nen el navegador.</p>\n</li>\n<li><p>Hay marcadores en verde fosforescente en el medio y en los bordes del mapa\nsubido, que pueden ser utilizados para estirar, achicar y mover el mapa\npara que se alinee correctamente con la imagen del satélite. Éste es un modo\nsencillo de georeferenciar (mira <a href=\"/lessons/georeferencing-qgis\">Georeferencing in QGIS 2.0</a>). La imagen\nde abajo muestra los pasos anteriores utilizando un viejo mapa de la ciudad\nde Aultsville superpuesto a imágenes satelitales de Google de 2008 en el\ncual se ven los restos de las calles y los cimientos de los edificios\nen el río St. Lawrence (Aultsville fue uno de los &quot;pueblos perdidos&quot; que\nfueron inundados por el proyecto de Vía Marítima y Energía de St. Lawrence).</p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo-es40.png&quot; caption=&quot;Figura 40: Clic en la imagen para ver en tamaño completo&quot; %}</p>\n<ul>\n<li><p>Volviendo a la ventana de &quot;Nueva Superposición de Imágenes&quot;, fíjate que hay\nuna serie de opciones para seleccionar (&quot;Descripción&quot;, &quot;Ver&quot;, &quot;Altitud&quot;,\n&quot;Actualizar&quot;, &quot;Ubicación&quot;). En esta instancia probablemente no necesites\npreocuparte por ellas, pero quizás quieras agregar información bajo la\npestaña de Descripción.</p>\n</li>\n<li><p>Cuando estés satisfecho con tu superposición, haz clic en &quot;Aceptar&quot; en\nla esquina inferior derecha de la ventana de &quot;Nueva Superposición de\nImágenes&quot;.</p>\n</li>\n<li><p>Es importante que guardes tu trabajo. En &quot;Archivo&quot;, en la barra del menú hay\ndos opciones. Puedes guardar una copia de la imagen (Archivo -&gt; Guardar -&gt;\nGuardar imagen...) que creaste en tu computadora en formato JPG o  guardar\nla superposición de Google Earth para poder acceder a ella en\nel futuro (Archivo -&gt; Guardar -&gt; Guardar en Mis Sitios). Esta segunda opción\ngenera un archivo KML.</p>\n</li>\n<li><p>Para compartir archivos KML simplemente ubica el archivo que guardaste en tu\ncomputadora y súbelo a tu sitio web, tu perfil de redes sociales o envíalo\ncomo adjunto en un correo electrónico.</p>\n</li>\n</ul>\n<p><strong>Ya aprendiste a utilizar Google Maps y Google Earth. ¡Asegúrate de guardar tu\ntrabajo!</strong></p>\n<p><em>Esta lección es parte de <a href=\"https://geospatialhistorian.wordpress.com/\">Geospatial Historian</a></em></p>\n"}