{"metadata":{"title":"Análisis de corpus con AntConc","authors":["Heather Froehlich"],"date":"2015-11-24T00:00:00.000Z","translation_date":"2018-05-04T00:00:00.000Z","editors":["Fred Gibbs"],"reviewers":["Nabeel Siddiqui","Rob Sieczkiewicz"],"translator":["Carlos Manuel Varón Castañeda"],"translation-editor":["Antonio Rojas Castro"],"translation-reviewer":["Jennifer Isasi","Antonio Rojas Castro"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/170","layout":"lesson","original":"corpus-analysis-with-antconc","difficulty":1,"activity":"analyzing","topics":["distant-reading"],"abstract":"El análisis de corpus permite hacer comparaciones a gran escala entre objetos presentes en los textos; es decir, lo que se conoce como lectura distante.","avatar_alt":"Grabado de una estantería con libros","doi":"10.46430/phes0032"},"html_body":"<h2 id=\"introducción\">Introducción</h2>\n<p>El análisis de corpus es un tipo de análisis de textos que permite hacer comparaciones a gran escala entre objetos presentes en los mismos —esto es, aquello que se conoce como lectura distante—. Lo anterior hace posible apreciar fenómenos que no necesariamente se hacen visibles cuando leemos. Si, por ejemplo, dispones de una colección de documentos, es posible que desearas encontrar patrones de uso gramatical o frases de aparición recurrente en la misma. También puede ser que quisieras hallar frases cuya probabilidad de aparición fuese más alta o más baja en la obra de un autor, o bien en un tipo determinado de textos; clases particulares de estructuras gramaticales; o muchos ejemplos de un concepto particular en una gran cantidad de documentos que se encuentran enmarcados en cierto contexto. En este sentido, el análisis de corpus resulta muy útil para demostrar hipótesis sobre textos, o para triangular resultados obtenidos a través de otras metodologías de análisis textual basadas en herramientas digitales.</p>\n<p>Al finalizar este tutorial, tendrás la capacidad de:</p>\n<ul>\n<li>Crear o descargar un corpus de textos.</li>\n<li>Realizar una búsqueda de palabras clave en contexto.</li>\n<li>Identificar patrones respecto de una palabra determinada.</li>\n<li>Utilizar criterios de búsqueda más específicos.</li>\n<li>Revisar diferencias estadísticamente significativas entre corpus.</li>\n<li>Efectuar comparaciones multimodales a través de metodologías de análisis propias de la lingüística de corpus.</li>\n</ul>\n<p>Es posible que te hayas acercado a la ejecución de análisis como el que se describe aquí si has realizado alguna de las siguientes tareas:</p>\n<ul>\n<li>Búsqueda de todas las apariciones de un término específico en un archivo PDF o un documento de Microsoft Word®.</li>\n<li>Uso de <a href=\"http://voyant-tools.org/\">Voyant Tools</a> para revisar patrones en un texto.</li>\n<li>Lectura y desarrollo de los tutoriales de introducción a Python disponibles en <em><a href=\"/es/lecciones/\">The Programming Historian</a></em>.</li>\n</ul>\n<p>En muchos sentidos, <a href=\"http://voyant-tools.org/\">Voyant</a> es una puerta de entrada a la realización de análisis más sofisticados y replicables, ya que la naturaleza de tipo “házlo tú mismo” de los <em>scripts</em> en Python o R puede no ser atractiva para todos. <a href=\"http://www.laurenceanthony.net/software/antconc/\">AntConc</a> llena este vacío en tanto se propone como una aplicación informática independiente para el análisis lingüístico de textos, la cual se encuentra disponible de forma gratuita para los sistemas operativos Windows, Mac OS X y Linux (funciona, por tanto, en múltiples plataformas), y es objeto de actualizaciones permanentes por parte de su creador, <a href=\"http://www.laurenceanthony.net/\">Laurence Anthony</a>[^1]; si bien existen otras aplicaciones para efectuar análisis de concordancias lingüísticas, se resaltan de AntConc las dos cualidades señaladas (para acceder a recursos adicionales sobre esta temática, véase <em><a href=\"https://hfroehli.ch/2014/05/11/intro-bibliography-corpus-linguistics/\">An Introductory Bibliography to Corpus Linguistics</a></em>).</p>\n<p>En este tutorial se presentan varias maneras diferentes de acercarse a un corpus de textos. Es importante tener en cuenta que las metodologías de lingüística de corpus no funcionan en todas las situaciones. Con esto, conforme sigas los pasos propuestos, es conveniente que reflexiones sobre la tarea que estés realizando y cómo puede ser de utilidad para responder una pregunta específica en relación con los datos de los que dispongas. En este sentido, si bien la presente lección está construida bajo la metodología &quot;haz esto y luego esto para lograr <em>X</em>&quot;, no siempre es necesario seguir en orden estricto los pasos que se muestran aquí: se brinda en este espacio una síntesis general de algunos de los métodos disponibles para realizar análisis de esta naturaleza, en lugar de una receta única para el éxito.</p>\n<h3 id=\"descargas-necesarias-para-el-desarrollo-de-este-tutorial\">Descargas necesarias para el desarrollo de este tutorial</h3>\n<ol>\n<li><p>Programa: <a href=\"http://www.laurenceanthony.net/software/antconc/\">AntConc</a>[^2].</p>\n<p>Descomprime el archivo del programa (si fuere necesario) e inícialo. Las capturas de pantalla presentadas aquí pueden diferir ligeramente de la versión de AntConc que utilices (y del sistema operativo, desde luego), pero los procedimientos son más o menos los mismos en todas las plataformas y versiones recientes de la aplicación. Este tutorial fue escrito teniendo como referente una versión específica (bastante antigua) de AntConc, en tanto consideramos que resulta más fácil de usar para fines introductorios. Puedes emplear la versión más reciente para desarrollar el tutorial si lo tienes a bien; pero, si deseas seguir los pasos con la misma información que presentamos en las capturas de pantalla de esta lección, es necesario que descargues la versión específica que empleamos aquí (<a href=\"http://www.laurenceanthony.net/software/antconc/releases/AntConc324/\">3.2.4</a>).</p>\n</li>\n<li><p>Corpus de prueba: descarga este <a href=\"/assets/corpus-analysis-with-antconc/antconc_corpus_files.zip\">archivo zip de reseñas cinematográficas</a> (escritas en inglés).</p>\n</li>\n</ol>\n<h3 id=\"presentación-sintética-de-las-temáticas-abordadas-en-la-lección\">Presentación sintética de las temáticas abordadas en la lección</h3>\n<ul>\n<li>Trabajar con archivos de texto plano</li>\n<li>Interfaz de usuario y carga de corpus en AntConc</li>\n<li>Búsqueda de palabras clave en contexto</li>\n<li>Búsqueda avanzada de palabras clave en contexto</li>\n<li>Colocaciones y listas de palabras</li>\n<li>Comparación de corpus</li>\n<li>Discusión: hacer comparaciones significativas</li>\n<li>Recursos adicionales</li>\n</ul>\n<h3 id=\"trabajar-con-archivos-de-texto-plano\">Trabajar con archivos de texto plano</h3>\n<ul>\n<li>AntConc solo funciona con archivos de texto plano de extensión .txt (por ejemplo, &quot;Hamlet.txt&quot;); <strong>no puede leer</strong> archivos de extensiones .doc, .docx o .pdf. Por lo tanto, si dispones de documentos de este tipo, deberás convertirlos en archivos .txt.</li>\n<li>La aplicación tiene la capacidad de trabajar con archivos XML (no te preocupes si los desconoces) guardados con la extensión .txt.</li>\n</ul>\n<p>Visita tu portal de noticias favorito y accede a un artículo (su naturaleza no importa, siempre que se componga mayoritariamente de texto). Luego, selecciona todo el texto (encabezado, pie de página, cuerpo, etc.), haz clic derecho y selecciona “copiar”. Después, abre un editor de texto como Bloc de notas (Windows) o TextEdit (Mac OS X) y pega allí el texto que copiaste.</p>\n<p>Existen otros editores de texto de uso gratuito, tales como <a href=\"http://notepad-plus-plus.org/\">Notepad++</a> (Windows) o <a href=\"http://www.barebones.com/products/textwrangler/\">TextWrangler</a> (Mac OS X), que ostentan funciones más avanzadas y son particularmente útiles para hacer una gran cantidad de tareas de limpieza de texto. Con esto último hacemos referencia a eliminar datos paratextuales tales como el texto <em>boilerplate</em> (información que incluye elementos como el título de la página, los datos del editor, etc.), el cual aparece de forma reiterada en muchos artículos. Si, por el contrario, conservas esta información, los datos se verán comprometidos, por cuanto el programa de análisis de texto tomará en cuenta estos términos en recuentos de palabras, análisis estadísticos y relaciones léxicas. A este respecto podrías considerar, por ejemplo, la posibilidad de eliminar los encabezados y pies de página estándar que aparecen en cada página (véase el tutorial <a href=\"/es/lecciones/limpieza-de-datos-con-OpenRefine\">Limpieza de datos con OpenRefine</a> para más información sobre cómo automatizar esta tarea). Ahora bien, en corpus de menor tamaño podría ser más conveniente que tú mismo hicieras dicha labor; de esa manera, adquirirás una mejor percepción de tu corpus.</p>\n<ul>\n<li>Guarda el artículo como un archivo .txt en el escritorio. Cabría la posibilidad de que hicieras labores adicionales de limpieza del texto, tales como la remoción de los datos del autor (elimínalos y guarda el archivo nuevamente). Recuerda en este sentido que toda la información que permanezca en el archivo puede y será tomada en cuenta por el programa de análisis de texto.</li>\n<li>Ve al escritorio y verifica que puedas encontrar el archivo de texto que guardaste.</li>\n</ul>\n<p>Mediante la ejecución repetida de las tareas anteriores se construye un corpus de archivos de texto plano; esta labor suele implicar el abordaje de asuntos relacionados con muestreo, representatividad y organización. Recuerda: es <strong>necesario</strong> que cada archivo de tu corpus sea de texto plano para que AntConc pueda interpretarlo. A este respecto, se acostumbra nombrar los archivos con la extensión .txt para reconocer fácilmente su naturaleza.</p>\n<p>Como lo supondrás, crear un corpus significativo puede resultar bastante tedioso si este se compone archivo por archivo, en especial si pretendes analizar un conjunto extenso de documentos. Por lo tanto, es muy común hacer <em>web scraping</em> (esto es, usar un programa sencillo para tomar archivos de la web de forma automatizada) para construir el corpus; si deseas obtener más información acerca de los conceptos y técnicas asociados a dicha labor, consulta las lecciones <a href=\"/lessons/intro-to-beautiful-soup\">Scraping with Beautiful Soup</a> y <a href=\"/lessons/automated-downloading-with-wget\">Automatic Downloading with wget</a>, disponibles en <em>The Programming Historian</em>. Para efectos de este tutorial, en lugar de componer el corpus documento por documento, vamos a utilizar uno ya existente, compuesto por reseñas cinematográficas y tomado del <a href=\"http://www.nltk.org/\">Natural Language Processing Toolkit</a> (NLTK). Este corpus se compone de 2000 reseñas, organizadas por su carácter —positivo o negativo—; abordaremos aquí un pequeño subconjunto de ellas (200 de cada categoría).</p>\n<p>La construcción de corpus es un campo de estudio en sí mismo. Para más información sobre este tópico, sugerimos consultar &quot;<a href=\"https://academic.oup.com/dsh/article-abstract/8/4/243/928942\">Representativeness in Corpus Design</a>&quot;, Literary and Linguistic Computing, 8 (4): 243-257; y <em><a href=\"http://www.amazon.com/Developing-Linguistic-Corpora-Practice-Guides/dp/1842172050/ref=sr_1_1\">Developing Linguistic Corpora: a Guide to Good Practice</a></em>[^3].</p>\n<h3 id=\"primeros-pasos-con-antconc-interfaz-de-usuario-y-carga-de-corpus-en-la-aplicación\">Primeros pasos con AntConc: interfaz de usuario y carga de corpus en la aplicación</h3>\n<p>Al iniciarse, AntConc se verá como en la siguiente imagen:</p>\n<p>{% include figure.html filename=&quot;antconc1.png&quot; caption=&quot;Ventana principal de AntConc&quot; %}</p>\n<p>En el costado izquierdo de la pantalla principal hay un cuadro que enlista todos los archivos cargados del corpus, el cual usaremos más adelante.</p>\n<p>La parte superior de la aplicación consta de 7 pestañas:</p>\n<ul>\n<li><strong><em>Concordance</em> (concordancia):</strong> muestra lo que se conoce como <em>keyword in context view</em> (vista de palabras clave en contexto [KWIC, por sus iniciales en inglés]), cuyos resultados se obtienen mediante la barra de búsqueda.</li>\n<li><strong><em>Concordance Plot</em> (mapa de concordancia):</strong> presenta una visualización muy sencilla de los resultados de la búsqueda de palabras clave en contexto. Las apariciones del término buscado se representarán como pequeñas líneas negras dentro de un rectángulo que representa la extensión total de cada archivo analizado.</li>\n<li><strong><em>File View</em> (vista de archivo):</strong> brinda una vista del archivo completo en la que se resaltan las apariciones del término buscado, con lo cual se obtiene una visión más amplia del contexto en el que este aparece.</li>\n<li><strong><em>Clusters</em> (clústeres):</strong> muestra palabras que aparecen juntas muy frecuentemente.</li>\n<li><strong><em>Collocates</em> (colocaciones)</strong>: mientras que la pestaña anterior muestra palabras que <em>definitivamente</em> aparecen juntas en el corpus, esta presenta aquellas que tienen una alta probabilidad de estarlo.</li>\n<li><strong><em>Word List</em> (lista de palabras):</strong> muestra todas las palabras del corpus.</li>\n<li><strong><em>Keyword List</em> (lista de palabras clave):</strong> presenta los resultados de comparaciones entre dos corpus.</li>\n</ul>\n<p>Dado su carácter introductorio, este tutorial solo brinda una mirada superficial a lo que se puede hacer con AntConc. En consecuencia, solo nos concentraremos aquí en las funciones de las pestañas <em>Concordance</em>, <em>Collocates</em>, <em>Keywords</em> y <em>Word List</em>.</p>\n<h4 id=\"carga-de-corpus\">Carga de corpus</h4>\n<p>Tal como sucede con cualquier otro programa informático, comenzaremos por ir a  “File” – “Open” (“Archivo” – Abrir); pero en lugar de abrir solo <strong>un</strong> archivo, haremos lo propio con la carpeta que contiene todos los documentos que constituyen el corpus. AntConc permite abrir directorios completos; en consecuencia, si ya tienes conocimiento y te sientes cómodo trabajando de esta manera, puedes abrir la carpeta “All reviews” (&quot;Todas las reseñas&quot;) y pasar directamente a la sección de análisis de este tutorial [^4].</p>\n<p>{% include figure.html filename=&quot;open-file-21.png&quot; caption=&quot;Apertura de una carpeta.&quot; %}</p>\n<ul>\n<li>Recuerda que guardamos los archivos en el escritorio; dirígete entonces a esa ubicación en el menú desplegable.</li>\n</ul>\n<p>{% include figure.html filename=&quot;files-on-desktop-open.png&quot; caption=&quot;Apertura de una carpeta localizada en el escritorio.&quot; %}</p>\n<ul>\n<li>Una vez en el escritorio, elige la carpeta “movie reviews from ntlk” (&quot;reseñas cienmatográficas del ntlk&quot;):</li>\n</ul>\n<p>{% include figure.html filename=&quot;browse-for-directory-inside-folder.png&quot; caption=&quot;Localización de la carpeta <em>movie reviews from nltk</em>&quot; %}</p>\n<ul>\n<li>Ahora, selecciona la carpeta “Negative reviews” (&quot;Reseñas negativas&quot;) y haz clic en “OK”. Hecho esto, deberían cargarse 200 archivos de texto en la columna izquierda del programa —confírmalo mediante la casilla “Total No.”—.</li>\n</ul>\n<p>{% include figure.html filename=&quot;open-negative-reviews.png&quot; caption=&quot;Carga de la carpeta <em>Negative Reviews</em>.&quot; %}</p>\n<ul>\n<li>Repite el mismo proceso para cargar la carpeta &quot;Positive Reviews&quot; (&quot;Reseñas positivas&quot;). Con esto, deberías tener 400 textos en la columna &quot;Corpus Files&quot;.</li>\n</ul>\n<p>{% include figure.html filename=&quot;positive-reviews.png&quot; caption=&quot;Carga de la carpeta <em>Positive Reviews</em>.&quot; %}</p>\n<p>{% include figure.html filename=&quot;all-reviews-loaded.png&quot; caption=&quot;Conjunto completo de reseñas cargadas en el programa.&quot; %}</p>\n<h2 id=\"búsqueda-de-palabras-clave-en-contexto\">Búsqueda de palabras clave en contexto</h2>\n<h3 id=\"comenzar-con-una-búsqueda-básica\">Comenzar con una búsqueda básica</h3>\n<p>Una de las labores en las cuales se destacan las herramientas de análisis de corpus como AntConc radica en encontrar patrones en el uso de la lengua que nos resulta difícil identificar como lectores. Nos es complicado rastrear palabras pequeñas y en apariencia poco importantes, tales como &#39;yo&#39;, &#39;él&#39;, &#39;ella&#39;, &#39;un&#39; y &#39;es&#39; porque son muy comunes, pero los computadores son muy buenos para realizar esta labor. Estos términos, que en lingüística reciben el nombre de palabras funcionales —se conocen como palabras vacías (<em>stopwords</em>) en el ámbito de las humanidades digitales—, suelen constituir indicadores estilísticos muy claros en materias de autoría y género en los textos. En consecuencia, tales palabras pueden ser términos de búsqueda bastante potentes por sí solos, o bien combinados con términos que se relacionen en mayor medida con el contenido (<em>content-driven terms</em>), lo cual ayuda al investigador a identificar patrones que tal vez no haya detectado previamente.</p>\n<p>En la pestaña <em>Concordance</em>, escribe la palabra &#39;the&#39; en el cuadro de búsqueda ubicado en la parte inferior y haz clic en “Start”. Acto seguido, el programa mostrará cada una de las apariciones de dicho término en el corpus de reseñas cinematográficas, así como el contexto en el que estas se presentan. Esto recibe el nombre de &quot;visor de palabras clave en contexto&quot; (<em>keywords in context viewer</em>).</p>\n<p>{% include figure.html filename=&quot;the-thinking.png&quot; caption=&quot;<em>The</em> es una palabra común en la lengua inglesa.&quot; %}</p>\n<p>La palabra buscada aparece 14.618 veces en el corpus según la casilla <em>Concordance Hits</em>, que se encuentra en la parte inferior de la pestaña.</p>\n<p>Como se indicó anteriormente, la lista KWIC resulta una buena forma de comenzar a buscar patrones. Aunque la cantidad de información suministrada con la búsqueda es aún muy grande, ¿qué tipo de palabras aparecen cerca de &#39;the&#39;?</p>\n<p>Ahora, prueba a hacer una búsqueda del término &#39;a&#39;; tanto este último como &#39;the&#39; son artículos en la lengua inglesa, pero el primero es definido y el segundo indefinido; y los resultados arrojados por la búsqueda ilustrarán esa diferencia.</p>\n<p>Llegados a este punto, ya debes estar familiarizado con las líneas de texto que componen la vista KWIC. Ahora, realiza una nueva búsqueda, esta vez de la palabra &#39;shot&#39;: los resultados mostrarán las apariciones del término tanto en la función sintáctica de sustantivo (por ejemplo, “line up the shot”) como en la de verbo conjugado (por ejemplo, &quot;this scene was shot carefully&quot;).</p>\n<p>¿Qué ves? Entendemos que esta puede ser una forma de identificar patrones difícil de intepretar. Intenta presionar el botón amarillo “Sort” (clasificar): ¿qué sucede al hacerlo?</p>\n<p>{% include figure.html filename=&quot;sorting-shot-1l1r.png&quot; caption=&quot;Palabras que aparecen junto a <em>shot</em>.&quot; %}</p>\n<p>Puedes ajustar la forma en que AntConc ordena la información encontrada si cambias los parámetros que en la imagen anterior aparecen encerrados en el círculo de color rojo: L corresponde a izquierda (<em>left</em>) y R a derecha (<em>right</em>); lo anterior puede extenderse hasta 5 posiciones en cualquier dirección. Los valores por defecto de la aplicación son 1 izquierda (1L), 2 derecha (2R), 3 derecha (3R); pero puedes alterarlos, por ejemplo, a 3 izquierda (3L), 2 izquierda (2L), 1 derecha (1R) (en aras de obtener frases o trigramas que finalicen con el término buscado) si haces clic en las flechas hacia arriba y abajo que se encuentran junto a los parámetros. Si no deseas realizar este tipo de clasificación, puedes omitirla (dejar los valores predeterminados 1L, 2R y 3R) o dejar todos los parámetros con el valor 0. Cabe la posibilidad de generar clasificaciones menos lineales, como 4L, 3R, 5R, que arrojarían como resultado mucha más información del contexto. El programa puede tardar un poco en mostrar este tipo de clasificaciones, por lo que sugerimos tener paciencia al efectuarlas. Si no estás seguro de cuáles serán los resultados arrojados por la búsqueda, haz clic en &quot;Sort&quot; para ver qué ocurre y efectúa los ajustes a los que haya lugar según tus necesidades.</p>\n<h3 id=\"operadores-de-búsqueda\">Operadores de búsqueda</h3>\n<h4 id=\"operador--comodín\">Operador * (comodín)</h4>\n<p>El operador * (que sirve para buscar 0 o más caracteres) puede ayudar a encontrar las formas de sustantivos en singular y plural, por ejemplo.</p>\n<p><strong>Tarea:</strong> busca <em>qualit*</em> y ordena los resultados. ¿Qué tiende a preceder y seguir a las palabras &#39;quality&#39; y &#39;qualities&#39;? Una pista: son vocablos diferentes con contextos de uso distintos; identifica patrones de uso mediante la búsqueda KWIC.</p>\n<p>Para obtener una lista completa de los operadores comodín disponibles y su función, revisa &quot;Global Settings&quot; – &quot;Wildcard Settings&quot;.</p>\n<p>{% include figure.html filename=&quot;wildcard-settings.png&quot; caption=&quot;Configuración de operadores de búsqueda.&quot; %}</p>\n<p>Para conocer la diferencia entre los operadores * y ?, busca <em>th*n</em> y luego <em>th?n</em>. Estas dos búsquedas, que a simple vista parecieran muy similares, arrojan resultados distintos.</p>\n<p>El operador <em>?</em> es más específico que *, así:</p>\n<p><em>wom?n</em> – &#39;women&#39; y &#39;woman&#39;.</p>\n<p><em>m?n</em> – &#39;man&#39;, &#39;men&#39; y &#39;min&#39;.</p>\n<p>Una búsqueda de <em>m*n</em>, en cambio, no es útil porque se obtendrán resultados que incluirán &#39;mean&#39;, &#39;melon&#39;, etc.</p>\n<p><strong>Tarea:</strong> compara los resultados de las búsquedas de <em>wom?n</em> y <em>m?n</em>.</p>\n<ul>\n<li><p>Ordena los resultados de cada búsqueda de manera que arrojen datos significativos (por ejemplo, configurar los parámetros de la búsqueda en 0, 1L y 2L)</p>\n</li>\n<li><p>Haz clic en &quot;File&quot; – &quot;Save Output to Text File&quot; y guarda el archivo (no olvides agregar la extensión .txt al nombre del mismo).</p>\n</li>\n</ul>\n<blockquote>\n<p>Sugerencia: durante la exploración en tu investigación, generarás muchos documentos como este para efectos de consulta. Es conveniente, por tanto, nombrar los archivos de tal manera que se describa lo que estos contienen (por ejemplo, “wom?n-results.txt” en lugar de “antconc-results.txt”).</p>\n</blockquote>\n<p>{% include figure.html filename=&quot;save-output-as-text-file.png&quot; caption=&quot;Opción <em>Save output as text file</em>.&quot; %}</p>\n<p>{% include figure.html filename=&quot;save-as.png&quot; caption=&quot;Cuadro de diálogo <em>Save As</em>.&quot; %}</p>\n<p>Con lo anterior, puedes abrir el archivo de texto plano generado por el programa en un editor de texto; es posible que debas ampliar la ventana de la aplicación para que este sea legible.</p>\n<p>{% include figure.html filename=&quot;results.png&quot; caption=&quot;Archivo de resultados de búsqueda KWIC exportado por Antconc, tal como se muestra en un editor de texto.&quot; %}</p>\n<p>Realiza el proceso anterior con los resultados de las dos búsquedas y compara los archivos de texto generados. ¿Qué fenómenos puedes ver?</p>\n<h4 id=\"operador--o\">Operador | (&quot;o&quot;)</h4>\n<p><strong>Tarea:</strong> busca <em>she|he</em>.</p>\n<p>Ahora, busca las dos palabras anteriores por separado: ¿cuántas veces aparece &#39;she&#39; en comparación con &#39;he&#39;?</p>\n<p>La palabra &#39;she&#39; (ella) aparece en mucha menor cantidad que &#39;he&#39; (él). ¿Por qué? ¡Esa es una pregunta de investigación! Una buena manera de ampliar este cuestionamiento podría radicar en ordenar la búsqueda anterior para identificar patrones de uso de las palabras en cuestión, y revisar si las mismas están seguidas de algún verbo en particular.</p>\n<p><strong>Tarea:</strong> a modo de práctica, busca una palabra que te interese, ordena los resultados de formas diferentes, usa los operadores comodín y exporta los datos obtenidos como archivos de texto plano. He aquí un interrogante orientador: ¿qué tipo de patrones puedes observar? ¿Puedes explicarlos?</p>\n<h3 id=\"colocaciones-y-listas-de-palabras\">Colocaciones y listas de palabras</h3>\n<p>Después de haber analizado las líneas de resultados de la vista KWIC en busca de patrones, ¿no te gustaría que hubiera una forma de que el computador te brindara una lista de palabras que aparecen más frecuentemente con la palabra clave buscada?</p>\n<p>Buenas noticias: existe una manera de obtener esta información en AntConc; está disponible en la pestaña <em>Collocates</em> (colocaciones). Al hacer clic en la misma, aparecerá un mensaje por medio del cual la aplicación dirá que necesita crear una lista de palabras. Haz clic en &quot;OK&quot; y el programa lo hará automáticamente.</p>\n<blockquote>\n<p>Nota: solo recibirás este aviso cuando no hayas creado una lista de palabras.</p>\n</blockquote>\n<p>{% include figure.html filename=&quot;wordlistwarning.png&quot; caption=&quot;Mensaje de advertencia para indicar la necesidad de generar una lista de palabras.&quot; %}</p>\n<p>Ahora, intenta generar la lista de colocaciones para el término &#39;she&#39;.</p>\n<p>Los resultados sin clasificar parecerán comenzar con palabras funcionales (palabras con las que se construyen frases) y luego pasarán a palabras de contenido (términos que dan sentido al texto): las primeras son <a href=\"http://www.wordfrequency.info/free.asp\">las más frecuentes en inglés</a>, en tanto funcionan mayormente como elementos para construir frases. Versiones más recientes de AntConc suelen incluir el término buscado como primer resultado, posiblemente porque está presente en el texto y se quiere hallar palabras que puedan aparecer junto a él.</p>\n<p>Algunas personas podrían tener la intención de prescindir de esta clase de palabras mediante el uso de una lista de palabras funcionales (esta es una labor común cuando se hace modelado de tópicos). Desde nuestra óptica, no promovemos esta práctica porque los computadores se destacan, justamente, en la identificación de palabras con alta frecuencia de aparición; tal como se expresó anteriormente, tendemos a pasarlas por alto. Los computadores —y en especial las aplicaciones como AntConc—, pueden mostrar dónde aparecen o no estas palabras, y esa información puede ser de interés, especialmente en colecciones de texto de gran envergadura (como se vio con las búsquedas de &#39;a&#39;, &#39;she&#39; y &#39;he&#39;).</p>\n<p>No obstante, en el caso de la lengua inglesa, la frecuencia de aparición de la letra &#39;s&#39; en el corpus también puede ser bastante alta, en tanto representa el posesivo <em>ʼs</em> (la aplicación no toma en cuenta el apóstrofo), pero AntConc la toma como otra palabra. Asimismo, la forma <em>ʼt</em> puede aparecer junto al verbo &#39;do&#39; por cuanto conforman la contracción <em>donʼt</em>; la alta frecuencia de su aparición conjunta los convierte en colocaciones altamente probables.</p>\n<p><strong>Tarea:</strong> genera la lista de colocaciones para las búsquedas de <em>m?n</em> y <em>wom?n</em>. Ahora, ordénalas de acuerdo con su frecuencia de aparición respecto del parámetro 1L.\nLos resultados muestran lo que, en teoría, hace que un hombre (<em>man</em>) o una mujer (<em>woman</em>) sea “digno de mostrarse en el cine”:</p>\n<ul>\n<li>las mujeres deben ser &quot;bellas&quot; (beautiful), &quot;sofisticadas&quot; (<em>sophisticated</em>) o estar &quot;embarazadas&quot; (<em>pregnant</em>).</li>\n<li>Los hombres tienen que estar, en cierto modo, fuera de lo común: deben ser &quot;santos&quot; (<em>holy</em>), &quot;negros&quot; (<em>black</em>) o &quot;viejos&quot; (<em>old</em>).</li>\n</ul>\n<p>Lo anterior no alude directamente a las películas, sino a la forma como se escribe sobre ellas en las reseñas, y puede llevar a cuestionamientos más sutiles, tales como &quot;¿de qué manera se describen los roles de las mujeres en las comedias románticas en las reseñas escritas por hombres frente a las escritas por mujeres?&quot;</p>\n<h3 id=\"comparación-de-corpus\">Comparación de corpus</h3>\n<p>Uno de los tipos de análisis más potentes radica en comparar el corpus propio con uno de referencia más extenso.</p>\n<p>Para este ejercicio, hemos tomado reseñas de filmes en los que Steven Spielberg ha estado involucrado (como director o productor). Podemos compararlos con un corpus de referencia de películas de toda una gama de directores.</p>\n<p>Asegúrate de pensar cuidadosamente sobre las características que podría tener un corpus de referencia para tu propia investigación (por ejemplo, un estudio del lenguaje de Agatha Christie en sus últimos años funcionaría muy bien como un corpus de análisis para compararlo con un corpus de referencia de todas sus novelas). Recuerda que, como lo expresamos anteriormente, la construcción del corpus es un subcampo en sí mismo.</p>\n<ul>\n<li>Dirígete a &quot;Settings&quot; – &quot;Tool preferences&quot; – &quot;Keyword List&quot;.</li>\n<li>Asegúrate de que la casilla de verificación &quot;Use raw files&quot; esté seleccionada en el menú &quot;Reference Corpus&quot;.</li>\n<li>Haz clic en el botón &quot;Add Directory&quot; y selecciona la carpeta que contiene los archivos del corpus de referencia.</li>\n<li>Verifica que dispongas de la lista completa de archivos en el listado que se mostrará.</li>\n</ul>\n<p>{% include figure.html filename=&quot;adding-a-reference-corpus.png&quot; caption=&quot;Carga de un corpus de referencia.&quot; %}</p>\n<ul>\n<li>Haz clic en el botón &quot;Load&quot; y espera que el programa cargue los archivos; una vez la casilla de verificación &quot;Loaded&quot; esté marcada, haz clic en &quot;Apply&quot;.</li>\n</ul>\n<p>Existe la posibilidad de intercambiar los roles del corpus de referencia y los archivos principales (es decir, dar al primero la función de los segundos y viceversa) por medio del botón &quot;Swap Ref/Main Files&quot;; en este punto vale la pena experimentar con esta opción y comparar los resultados obtenidos.</p>\n<blockquote>\n<p>Si estás utilizando una versión más reciente del programa, el botón anterior puede llamarse &quot;Swap with Target Files&quot;. Adicionalmente, cualesquiera sean los datos que vayas a utilizar como corpus de referencia, asegúrate de que estos se carguen correctamente en AntConc (esto es, haz clic en el botón &quot;Load&quot; cada vez que cargues o intercambies un corpus).</p>\n</blockquote>\n<ul>\n<li>Dirígete a la pestaña &quot;Keyword list&quot; y una vez allí, presiona el botón &quot;Start&quot; (sin escribir nada en la casilla de búsqueda). Si intercambiaste el corpus de referencia con los archivos objeto del análisis, el programa anunciará la necesidad de crear una nueva lista de palabras antes de generar la lista de palabras clave. Esta se compondrá de aquellos términos que resulten mucho más &quot;inusuales&quot; —de aparición menos probable en terminos estadísticos— en el corpus que se está viendo <em>vs.</em> el de referencia.</li>\n</ul>\n<blockquote>\n<p><em>Keyness</em> (calidad de la palabra clave): corresponde a la frecuencia de aparición de una palabra en el texto cuando se la compara con su frecuencia en un corpus de referencia, &quot;de tal suerte que la probabilidad estadística, calculada mediante un procedimiento determinado, es menor o igual que el valor <em>p</em> especificado por el usuario&quot; (información tomada de <a href=\"http://www.lexically.net/downloads/version6/HTML/index.html?keyness_definition.htm\">este sitio</a>). Para profundizar sobre los detalles estadísticos de este tópico, sugerimos revisar la sección sobre el mismo en la página 7 del <a href=\"http://www.laurenceanthony.net/software/antconc/releases/AntConc335/help.pdf\">archivo <em>Readme</em> de AntConc</a>.</p>\n</blockquote>\n<p>¿Cuáles son nuestras palabras clave?</p>\n<p>{% include figure.html filename=&quot;spielberg-vs-movie-reviews.png&quot; caption=&quot;Spielberg <em>vs.</em> reseñas cinematográficas.&quot; %}</p>\n<h2 id=\"discusión-hacer-comparaciones-significativas\">Discusión: hacer comparaciones significativas</h2>\n<p>Es importante tener en cuenta que la forma en que se organicen los archivos de texto para la investigación tendrá efectos en el tipo de interrogantes que puedan surgir de los mismos, así como en los resultados que se obtengan del análisis. A este respecto, recuerda que la comparación realizada aquí entre reseñas negativas y positivas es extremadamente simple; si se quisiere, podrían efectuarse comparaciones adicionales con otros subconjuntos de reseñas, lo cual daría pie a la formulación de interrogantes muy distintos.</p>\n<p>Así entonces, los archivos que se dispongan en el corpus determinarán los resultados obtenidos. Reiteramos que los temas de representatividad y muestreo son muy relevantes en este sentido: no siempre es necesario o ideal utilizar todo un conjunto de datos, incluso si se dispone de él. En este punto, realmente cabe preguntarse por la manera como estos métodos de análisis textual ayudan a generar preguntas de investigación.</p>\n<p>Si se piensa, por ejemplo, en el funcionamiento de las reseñas cinematográficas en tanto género discursivo, puede dirigirse la atención hacia oposiciones como las siguientes:</p>\n<ul>\n<li>Reseñas cinematográficas <em>vs.</em> reseñas musicales</li>\n<li>Reseñas cinematográficas <em>vs.</em> reseñas de libros</li>\n<li>Reseñas cinematográficas <em>vs.</em> noticias deportivas</li>\n<li>Reseñas cinematográficas <em>vs.</em> noticias en general</li>\n</ul>\n<p>Cada una de estas comparaciones aportará información distinta y puede derivar en preguntas de investigación diferentes, tales como:</p>\n<ul>\n<li><p>¿En qué difieren las reseñas cinematográficas de otros tipos de reseñas de productos mediáticos?</p>\n</li>\n<li><p>¿En qué se diferencian las reseñas cinematográficas de otros tipos de escritos susceptibles de publicarse?</p>\n</li>\n<li><p>¿Cómo se comparan las reseñas de películas con otros géneros de escritura, tales como la crónica deportiva?</p>\n</li>\n<li><p>¿Qué tienen en común las reseñas cinematográficas y las musicales?</p>\n</li>\n</ul>\n<p>Desde luego, puede darse la vuelta a estos cuestionamientos para generar nuevas preguntas:</p>\n<ul>\n<li><p>¿En qué se diferencian las reseñas bibliográficas de las cinematográficas?</p>\n</li>\n<li><p>¿En qué difieren las reseñas musicales de las cinematográficas?</p>\n</li>\n<li><p>¿Qué tienen en común los artículos que se publican en la prensa escrita?</p>\n</li>\n<li><p>¿En qué se asemejan las reseñas cinematográficas a otros tipos de escritos susceptibles de publicarse?</p>\n</li>\n</ul>\n<p>En síntesis, vale la pena pensar en:</p>\n<ul>\n<li>Por qué se quiere comparar dos corpus.</li>\n<li>Qué tipo de consultas da lugar a preguntas de investigación significativas.</li>\n<li>Principios de construcción de corpus: muestreo y capacidad de asegurar que se obtengan datos representativos.</li>\n</ul>\n<h3 id=\"recursos-adicionales\">Recursos adicionales</h3>\n<p><em><a href=\"http://hfroehlich.wordpress.com/2014/05/11/intro-bibliography-corpus-linguistics/\">A Short Bibliography on Corpus Linguistics</a></em></p>\n<p><a href=\"http://hfroehli.ch/workshops/getting-started-with-antconc/\">Una versión más sencilla de este tutorial, concebida para usuarios con pocos conocimientos de computación</a> (en inglés).</p>\n<p><em><a href=\"http://www.dlsi.ua.es/~borja/riilua/grac.pdf\">Guía rápida de análisis de corpus con AntConc</a></em>, publicada por la Universidad de Alicante (2015).</p>\n<h2 id=\"notas-de-traducción\">Notas de traducción</h2>\n<p>[^1]: Investigador y docente de la Universidad de Waseda (Japón).\n[^2]: La interfaz del programa solo está disponible en inglés.\n[^3]: Dos materiales en español pueden ser de utilidad si se desea profundizar en esta témática: de un lado, la conferencia <em><a href=\"https://www.youtube.com/watch?v=bvTigjPhZco\">Aproximación al concepto de representatividad de corpus</a></em>; y de otro, la obra <em><a href=\"http://elies.rediris.es/elies18/\">Explotación de los córpora textuales informatizados para la creación de bases de datos terminológicas basadas en el conocimiento</a></em>.\n[^4]: Si se requiere trabajar con corpus en cuyos textos se emplean caracteres especiales (como es el caso de los documentos escritos en lengua española), es imperativo prestar atención a la codificación con la cual se guardaron los archivos que los componen. Por defecto, AntConc está configurado para operar con documentos de texto plano con codificación Unicode (UTF-8). Así entonces, es preciso verificar en el editor de texto que estos se hayan guardado atendiendo a lo anterior, o bien cambiar los parámetros de importación de archivos en el programa según las necesidades (por ejemplo, trabajar con archivos codificados en ANSI).</p>\n"}