{"metadata":{"title":"Georeferencing in QGIS 2.0","layout":"lesson","date":"2013-12-13T00:00:00.000Z","authors":["Jim Clifford","Josh MacFadyen","Daniel Macfarlane"],"reviewers":["Finn Arne Jørgensen","Peter Webster","Abby Schreiber"],"editors":["Adam Crymble"],"difficulty":2,"activity":"transforming","topics":["mapping"],"exclude_from_check":["review-ticket"],"abstract":"In this lesson, you will learn how to georeference historical maps so that they may be added to a GIS as a raster layer.","previous":"vector-layers-qgis","series_total":"4 lessons","sequence":4,"redirect_from":"/lessons/georeferencing-qgis","avatar_alt":"Map of a moutnaintop city","doi":"10.46430/phen0027"},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"lesson-goals\">Lesson Goals</h2>\n<p>In this lesson, you will learn how to georeference historical maps so\nthat they may be added to a GIS as a raster layer. Georeferencing is\nrequired for anyone who wants to accurately digitize data found on a\npaper map, and since historians work mostly in the realm of paper,\ngeoreferencing is one of our most commonly used tools. The technique\nuses a series of control points to give a two-dimensional object like a\npaper map the real world coordinates it needs to align with the\nthree-dimensional features of the earth in GIS software (in <a href=\"/lessons/googlemaps-googleearth\">Intro to\nGoogle Maps and Google Earth</a> we saw an &#39;overlay&#39; which is a Google\nEarth shortcut version of georeferencing).</p>\n<p>Georeferencing a historical map requires a knowledge of both the\ngeography and the history of the place you are studying to ensure\naccuracy. The built and natural landscapes change over time, and it is\nimportant to confirm that the location of your control points — whether\nthey be houses, intersections, or even towns — have remained constant.\nEntering control points in a GIS is easy, but behind the scenes,\ngeoreferencing uses complex transformation and compression processes.\nThese are used to correct the distortions and inaccuracies found in many\nhistorical maps and stretch the maps so that they fit geographic\ncoordinates. In cartography this is known as <a href=\"http://en.wikipedia.org/wiki/Rubbersheeting\">rubber-sheeting</a> because\nit treats the map as if it were made of rubber and the control points as\nif they were tacks &#39;pinning&#39; the historical document to a three\ndimensional surface like the globe.</p>\n<h2 id=\"getting-started\">Getting Started</h2>\n<p>Before proceeding with georeferencing in Quantum GIS, we need to\nactivate the appropriate Plugins. On the toolbar go to Plugins -&gt;\nManage and Install Plugins</p>\n<p>{% include figure.html filename=&quot;geo110.png&quot; caption=&quot;Figure 1&quot; %}</p>\n<p>A window titled Plugin Manager will open. Scroll down to Georeference\nGDAL and check the box beside it, and click OK.</p>\n<p>{% include figure.html filename=&quot;geo210.png&quot; caption=&quot;Figure 2&quot; %}</p>\n<ul>\n<li>At this point, you need to shut down and relaunch QGIS. For the\npurposes of this example, and to keep things as simple as possible,\ndon&#39;t reload your existing project but instead start a new project.</li>\n<li>Set up the <a href=\"http://en.wikipedia.org/wiki/Spatial_reference_system\">Coordinate Reference System</a> (CRS) correctly (see\n<a href=\"/lessons/qgis-layers\">Installing QGIS 2.0 and adding Layers</a> for a reminder)</li>\n<li>Save this new project (under File menu, select Save Project) and\ncall it &#39;georeferencing.&#39;</li>\n<li>Add the &#39;coastline_polygon&#39; layer (see <a href=\"/lessons/qgis-layers\">Installing QGIS 2.0 and\nadding Layers</a> for a reminder)</li>\n</ul>\n<h2 id=\"open-the-necessary-gis-layers\">Open the Necessary GIS Layers</h2>\n<p>For the Prince Edward Island case study, we are going to use the\ntownship boundaries as control points because they were established in\n1764 by Samuel Holland, they are identified on most maps of PEI, and\nthey have changed very minimally since then.</p>\n<p><em>Download lot_township_polygon:</em></p>\n<p>This is the shapefile containing the modern vector layer we are going to\nuse to georeference the historical map. Note that townships were not\ngiven names but rather a lot number in 1764, so they are usually\nreferred to as &#39;Lots&#39; in PEI. Hence the file name\n&#39;lot_township_polygon&#39;.</p>\n<ul>\n<li>Navigate to the link below in your web browser and download the file.</li>\n</ul>\n<p><a href=\"http://www.gov.pe.ca/gis/license_agreement.php3?name=lot_town&amp;file_format=SHP\">http://www.gov.pe.ca/gis/license_agreement.php3?name=lot_town&amp;file_format=SHP</a></p>\n<ul>\n<li>After downloading the file called &#39;lot_township_polygon&#39;, move it\ninto a folder that you can find later and unzip the file. (Remember\nto keep the files together as they are all required to open this\nlayer in your GIS)</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo310.png&quot; caption=&quot;Figure 3&quot; %}</p>\n<p><em>Add lot_township_polygon to QGIS:</em></p>\n<ul>\n<li>under Layer on the toolbar, choose Add Vector Layer (alternatively\nthe same icon you see next to &#39;Add Vector Layer&#39; can also be\nselected from the tool bar)</li>\n<li>Click Browse. Navigate to your unzipped file and select the file\ntitled &#39;lot_township_polygon.shp&#39;</li>\n<li>Click Open</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo41.png&quot; caption=&quot;Figure 4&quot; %}</p>\n<p>For more information on adding and visualizing layers see <a href=\"/lessons/qgis-layers\">Installing\nQGIS 2.0 and adding Layers</a>.</p>\n<p>{% include figure.html filename=&quot;geo51.png&quot; caption=&quot;Figure 5&quot; %}</p>\n<h2 id=\"open-the-georeferencer-tool\">Open the Georeferencer Tool</h2>\n<p>Georeferencer is now available under the Raster menu on the toolbar –\nselect it.</p>\n<p>{% include figure.html filename=&quot;geo61.png&quot; caption=&quot;Figure 6&quot; %}</p>\n<p><em>Add your historical map:</em></p>\n<ul>\n<li>In the resulting window, click on the Open Raster button on the top\nleft (which looks identical to the Add Raster layer).</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo71.png&quot; caption=&quot;Figure 7&quot; %}</p>\n<ul>\n<li>Find the file titled &#39;PEI_LakeMap1863.jpg&#39; on your computer and\nselect Open (the file <a href=\"https://geospatialhistorian.files.wordpress.com/2013/02/pei_lakemap1863.jpg\">can be downloaded here</a> or in its original\nlocation at the <a href=\"https://islandimagined.ca/islandora/object/imagined:208687\">Island Imagined</a> online map repository)</li>\n<li>You will be prompted to define this layer&#39;s coordinate system. In\nthe Filter box search for &#39;2291′, then in the box below select\n&#39;NAD83(CSRS98) / Prince Edward …&#39;</li>\n</ul>\n<p>The result will look like this:</p>\n<p>{% include figure.html filename=&quot;geo81.png&quot; caption=&quot;Figure 8&quot; %}</p>\n<p><em>Adding control points:</em></p>\n<p>Plan the locations you are going to use as control points in advance of\nthe steps that follow. It is much easier to navigate around the\nhistorical map first, so get a good idea of the best points to use and\nkeep them in mind.</p>\n<p>Some tips for choosing control points:</p>\n<ul>\n<li><strong>How many</strong> points do you need? Usually the more points you assign\nthe more accurate your georeferenced map will be. Two control points\nwill tell the GIS to scale and rotate the map to those two points,\nbut in order to truly rubber-sheet the historical document you need\nto add more points.</li>\n<li><strong>Where</strong> should you put control points? Select areas as close as\npossible to the four corners of your map so that these outer areas\ndo not get omitted in the rubber-sheeting.</li>\n<li>Select additional control points close to your area of interest.\nEverything in between the four corner control points should\ngeoreference evenly, but if you are concerned about the accuracy of\none place in particular, make sure to select additional control\npoints in that area.</li>\n<li>Select the middle of intersections and roads, because the edges of\nroads changed a certain amount over time as road improvements were\nmade.</li>\n<li>Check that your control points did not change location over time.\nRoads were often re-routed, and even houses and other buildings were\nmoved, especially <a href=\"http://books.google.ca/books?id=TqCNZYXWXAUC&amp;dq=tilting&amp;source=gbs_navlinks_s\">in Atlantic Canada</a>!</li>\n</ul>\n<p><em>Add your first control point:</em></p>\n<p><strong>First</strong>, navigate to the location of your first control point on the\n<strong>historical map</strong>.</p>\n<ul>\n<li>click on Zoom In Magnifying Glass on the window tool bar or use the\nmouse roller wheel to zoom in</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo91.png&quot; caption=&quot;Figure 9&quot; %}</p>\n<ul>\n<li><p>zoom in to a point which you can recognize on both your printed map\nand your GIS</p>\n</li>\n<li><p>Click on Add Point on toolbar</p>\n</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo101.png&quot; caption=&quot;Figure 10&quot; %}</p>\n<ul>\n<li>Click on the place in the printed map that you can locate in your\nGIS (i.e. the control point). The Georeferencer window will now\nminimize automatically. If it does not (some versions have a bug in\nthis plugin) manually minimize the window</li>\n<li>Click on the place in the GIS which matches the control point</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo111.png&quot; caption=&quot;Figure 11&quot; %}</p>\n<ul>\n<li>At this stage we identified a problem in lot boundaries. We planned\nto use the location where the southern border of Lot 1 at the West\nend of the Province contains a &quot;dog leg&quot; near the middle of the land\nmass. However, it was clear that not all the dog legs on these lots\nmatched the historical map. It is possible that lot boundaries have\nchanged somewhat in the 250 years since they were established, so it\nis best to choose the point you are most sure of. In this case the\ndog leg between Lot 2 and Lot 3 was fine (see arrow). It was the\nborder of Lots 3 and 4 that has changed. The discrepancy at the\nborder of 1 and 2 shows that more control points are needed to\nproperly rubber-sheet this somewhat distorted 1863 map to the\nProvincial GIS layer</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo121.png&quot; caption=&quot;Figure 12&quot; %}</p>\n<p><em>Add at least one more control point:</em></p>\n<ul>\n<li>return to the Georeferencer window and repeat the steps under &#39;<em>Add\nyour first control point</em>&#39; above, to add additional control points.</li>\n<li>Add a point close to the opposite side of your printed map (the\nfurther apart your control points are placed the more accurate the\ngeoreferencing process) and another one near Charlottetown</li>\n<li>return to the Georeferencer window. You should see three red dots on\nthe printed map, and three records in the GCP table at the bottom of\nyour window (outlined in red on the following image)</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo131.png&quot; caption=&quot;Figure 13&quot; %}</p>\n<p><em>Determine the transformation settings:</em></p>\n<p>Before you click Play and start the automated georeferencing process you\nneed to tell QGIS where to save the new file (this will be a raster\nfile), how it should interpret your control points, and how it should\ncompress the image.</p>\n<ul>\n<li>Click on the Transformation Settings button</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo141.png&quot; caption=&quot;Figure 14&quot; %}</p>\n<p>Most of these settings can be left as default: linear transformation\ntype, nearest neighbour resampling method, and LZW compression. (The\n<a href=\"http://en.wikipedia.org/wiki/World_file\">world file</a> is not necessary, unless you want to georeference the\nsame image again in another GIS or if someone else needs to georeference\nthe image and does not have access to your GIS data, coordinate\nreference system, etc.) The target SRS is not important, but you could\nuse this feature to give the new raster a different reference system.</p>\n<ul>\n<li>Assign a folder for your new georeferenced raster file. <a href=\"http://en.wikipedia.org/wiki/Tagged_Image_File_Format\">Tif</a> is\nthe default format for rasters georeferenced in QGIS.</li>\n<li>Be aware that a Tif file is going to be much larger than your original map,\neven with LZW compression, so make sure you have adequate space if you are\nusing a jump drive. (<em>warning:</em> the Tif file produced from this 6.8 Mb .jpg\nwill be <strong>over 1GB</strong> once georeferenced. One way to manage the size of the\ngeoreferenced raster file while maintaining a high enough resolution for\nlegibility is to crop out only the area needed for the map project. In this\ncase, a lower resolution option is also available from the <a href=\"https://islandimagined.ca/islandora/object/imagined:208687\">Island\nImagined</a> online map repository.)</li>\n<li>Leave the target resolution at the default</li>\n<li>You can select &#39;Use 0 transparency when needed&#39; to eliminate black\nspaces around the edges of the map, but this is not necessary and\nyou can experiment as needed</li>\n<li>Make sure &#39;Load in QGIS&#39; is selected to save a step. This will\nautomatically add the new file to your GIS&#39;s Table of Contents so\nthat you don&#39;t have to go looking for the Tif file later</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo151.png&quot; caption=&quot;Figure 15&quot; %}</p>\n<h2 id=\"georeference\">Georeference!</h2>\n<ul>\n<li>Click on the Play button on the toolbar (beside Add Raster) – this\nbegins the georeferencing process</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo161.png&quot; caption=&quot;Figure 16&quot; %}</p>\n<p>{% include figure.html filename=&quot;geo171.png&quot; caption=&quot;Figure 17&quot; %}</p>\n<ul>\n<li>A window will appear titled Define CRS: select 2291, click OK</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo181.png&quot; caption=&quot;Figure 18&quot; %}</p>\n<p><em>Explore your map:</em></p>\n<ul>\n<li>Drag the new layer &#39;PEI_LakeMap1863_modified&#39; down to the bottom\nof your Table of Contents (i.e. below the &#39;lot_township_polygon&#39;\nlayer</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo191.png&quot; caption=&quot;Figure 19&quot; %}</p>\n<ul>\n<li>Change the fill of the lot_township_polygon layer to &#39;no brush&#39; by\nSelecting the layer, clicking on Layer -&gt; Properties, and clicking\non Symbol Properties. Click OK</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo201.png&quot; caption=&quot;Figure 20&quot; %}</p>\n<ul>\n<li>Now you should see the modern GIS layer with the historical map in\nbehind</li>\n</ul>\n<p>{% include figure.html filename=&quot;geo211.png&quot; caption=&quot;Figure 21&quot; %}</p>\n<p>Now that you have a newly georeferenced map in your GIS you can explore\nthe layer, adjust the transparency, contrast and brightness, and go back\nthrough <a href=\"/lessons/vector-layers-qgis\">Creating New Vector Layers in QGIS</a> to digitize some of the\nhistorical information that you have created. For instance, this\ngeoreferenced map of PEI shows the locations of all homes in 1863,\nincluding the name of the head of household. By assigning points on the\nmap you can enter home locations and owner names and then analyze or\nshare that new geospatial layer as a shapefile.</p>\n<p>By digitizing line vectors such as roads or coastlines you can compare\nthe location of these features with other historical data, or simply\ncompare them visually with the lot_township_polygon layer in this GIS.</p>\n<p>In more advanced processes you can even drape this georeferenced image\nover a DEM (digital elevation model) to give it a hillshade terrain or\n3D effect and perform a &#39;fly-over&#39; of PEI homes in the nineteenth\ncentury.</p>\n<p><em>This lesson is part of the <a href=\"http://geospatialhistorian.wordpress.com/\">Geospatial Historian</a>.</em></p>\n"}