{"metadata":{"title":"Fetching and Parsing Data from the Web with OpenRefine","layout":"lesson","date":"2017-08-12T00:00:00.000Z","authors":["Evan Peter Williamson"],"reviewers":["Peggy Griesinger","Lisa Lowry"],"editors":["Jeri Wieringa"],"difficulty":2,"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/69","activity":"acquiring","topics":["data-manipulation","web-scraping","api"],"abstract":"OpenRefine is a powerful tool for exploring, cleaning, and transforming data. In this lesson you will learn how to use Refine to fetch URLs and parse web content.","redirect_from":"/lessons/fetch-and-parse-data-with-openrefine","avatar_alt":"Machine for water filtration","doi":"10.46430/phen0065"},"html_body":"<p>{% include toc.html %}</p>\n<h1 id=\"lesson-goals\">Lesson Goals</h1>\n<p>OpenRefine is a powerful tool for exploring, cleaning, and transforming data.\nAn earlier Programming Historian lesson, <a href=\"/lessons/cleaning-data-with-openrefine\">&quot;Cleaning Data with OpenRefine&quot;</a>, introduced the basic functionality of Refine to efficiently discover and correct inconsistency in a data set.\nBuilding on those essential data wrangling skills, this lesson focuses on Refine&#39;s ability to fetch URLs and parse web content.\nExamples introduce some of the advanced features to transform and enhance a data set including:</p>\n<ul>\n<li>fetch URLs using Refine</li>\n<li>construct URL queries to retrieve information from a simple web API</li>\n<li>parse HTML and JSON responses to extract relevant data</li>\n<li>use array functions to manipulate string values</li>\n<li>use Jython to extend Refine&#39;s functionality</li>\n</ul>\n<p>It will be helpful to have basic familiarity with <a href=\"/lessons/cleaning-data-with-openrefine\">OpenRefine</a>, <a href=\"/lessons/viewing-html-files\">HTML</a>, and programming concepts such as variables and loops to complete this lesson.</p>\n<h2 id=\"why-use-openrefine\">Why Use OpenRefine?</h2>\n<p>The ability to create data sets from unstructured documents available on the web opens possibilities for research using digitized primary materials, web archives, texts, and contemporary media streams.\nProgramming Historian lessons introduce a number of methods to gather and interact with this content, from <a href=\"/lessons/applied-archival-downloading-with-wget\">wget</a> to <a href=\"/lessons/intro-to-beautiful-soup\">Python</a>.\nWhen working with text documents, Refine is particularly suited for this task, allowing users to fetch urls and directly process the results in an iterative, exploratory manner.</p>\n<p>David Huynh, the creator of Freebase Gridworks (2009) which became GoogleRefine (2010) and then OpenRefine (2012+), describes Refine as:</p>\n<ul>\n<li>more powerful than a spreadsheet</li>\n<li>more interactive and visual than scripting</li>\n<li>more provisional / exploratory / experimental / playful than a database [^huynh]</li>\n</ul>\n<p>Refine is a unique tool that combines the power of databases and scripting languages into an interactive and user friendly visual interface.\nBecause of this flexibility it has been embraced by <a href=\"https://www.propublica.org/nerds/item/using-google-refine-for-data-cleaning\">journalists</a>, <a href=\"http://web.archive.org/web/20180129051941/http://data-lessons.github.io/library-openrefine/\">librarians</a>, <a href=\"http://www.datacarpentry.org/OpenRefine-ecology-lesson/\">scientists</a>, and others needing to wrangle data from diverse sources and formats into structured information.</p>\n<p>{% include figure.html filename=&quot;openrefine.png&quot; caption=&quot;OpenRefine terminal and GUI&quot; %}</p>\n<blockquote>\n<p>OpenRefine is a <a href=\"https://www.gnu.org/philosophy/free-sw.en.html\">free</a> and <a href=\"https://github.com/OpenRefine/OpenRefine\">open source</a> Java application.\nThe user interface is rendered by your web browser, but Refine is not a web application. No information is sent online and no internet connection is necessary.\nFull documentation is available on the <a href=\"https://github.com/OpenRefine/OpenRefine/wiki/\">official wiki</a>.\nFor installation and staring Refine check this <a href=\"https://uidaholib.github.io/clean-your-data/3-start.html\">workshop page</a>.</p>\n<p>Note: this lesson was written using openrefine-2.7. Although almost all functionality is interchangeable between versions, I suggest using the newest version.</p>\n</blockquote>\n<h2 id=\"lesson-outline\">Lesson Outline</h2>\n<p>This lesson presents three examples demonstrating workflows to harvest and process data from the web:</p>\n<ol>\n<li><em><a href=\"#example-1-fetching-and-parsing-html\">Example 1: Fetching and Parsing HTML</a></em> transforms an ebook into a structured data set by parsing the HTML and using string array functions.</li>\n<li><em><a href=\"#example-2-url-queries-and-parsing-json\">Example 2: URL Queries and Parsing JSON</a></em> interacts with a simple web API to construct a full text data set of historic newspaper front pages.</li>\n<li><em><a href=\"#example-3-advanced-apis\">Example 3: Advanced APIs</a></em> demonstrates using Jython to implement a POST request to a natural language processing web service.</li>\n</ol>\n<h1 id=\"example-1-fetching-and-parsing-html\">Example 1: Fetching and Parsing HTML</h1>\n<p>This example downloads a single web page and parses it into a structured table using Refine&#39;s built in functions.\nA similar workflow can be applied to a list of URLs, often generated by parsing another web page, creating a flexible web harvesting tool.</p>\n<p>The raw data for this example is an HTML copy of Shakespeare&#39;s <a href=\"http://www.gutenberg.org/ebooks/1105\">Sonnets</a> from <a href=\"http://www.gutenberg.org/\">Project Gutenberg</a>.\nProcessing a book of poems into structured data enables new ways of reading text, allowing us to sort, manipulate, and connect with other information.</p>\n<div class=\"alert alert-warning\">\nPlease note that Project Gutenberg provides <a href=\"http://www.gutenberg.org/wiki/Gutenberg:Feeds\">feeds</a> to bulk download catalog data.\nTheir public website should not be used for web scraping purposes.\nA copy of the HTML ebook is hosted on GitHub for this example to avoid redirects built in to the Gutenberg site.\n</div>\n\n<h2 id=\"start-sonnets-project\">Start &quot;Sonnets&quot; Project</h2>\n<p>Start OpenRefine and select <em>Create Project</em>.\nRefine can import data from a wide variety of formats and sources, from a local Excel file to web accessible RDF.\nOne often over looked method is the <em>Clipboard</em>, which allows entering data via copy &amp; paste.\nUnder &quot;Get Data From&quot;, click <em>Clipboard</em>, and paste this URL into the text box:</p>\n<pre><code>https://programminghistorian.org/assets/fetch-and-parse-data-with-openrefine/pg1105.html\n</code></pre>\n<p>{% include figure.html filename=&quot;refine-clipboard1.png&quot; caption=&quot;Start project with clipboard&quot; %}</p>\n<p>After clicking <em>Next</em>, Refine should automatically identify the content as a line-based text file and the default parsing options should be correct.\nAdd the project name &quot;Sonnets&quot; at the top right and click <em>Create project</em>.\nThis will result in a project with one column and one row.</p>\n<h2 id=\"fetch-html\">Fetch HTML</h2>\n<p>Refine&#39;s built-in function to retrieve a list of URLs is done by creating a new column.\nClick on the menu arrow of <em>Column 1</em> &gt; <em>Edit column</em> &gt; <em>Add column by fetching urls</em>.</p>\n<p>{% include figure.html caption=&quot;Edit column &gt; Add column by fetching URL&quot; filename=&quot;refine-fetch1.png&quot; %}</p>\n<p>Name the new column &quot;fetch&quot;.\nThe <em>Throttle delay</em> option sets a pause time between requests to avoid being blocked by a server.\nThe default is conservative.</p>\n<p>{% include figure.html caption=&quot;Add column by fetch dialog box&quot; filename=&quot;refine-fetch1.2.png&quot; %}</p>\n<p>After clicking &quot;OK&quot;, Refine will start requesting the URLs from the base column as if you were opening the pages in your browser, and will store each response in the cells of the new column.\nIn this case, there is one URL in <em>Column 1</em> resulting in one cell in the <em>fetch</em> column containing the full HTML source for the Sonnets web page.</p>\n<p>{% include figure.html caption=&quot;Fetch results&quot; filename=&quot;refine-fetch1.3.png&quot; %}</p>\n<h2 id=\"parse-html\">Parse HTML</h2>\n<p>Much of the web page is not sonnet text and must be removed to create a clean data set.\nFirst, it is necessary to identify a pattern that can isolate the desired content.\nItems will often be nested in a unique container or given a meaningful class or id.</p>\n<p>To make examining the HTML easier, click on the URL in <em>Column 1</em> to open the link in a new tab, then right click on the page to &quot;View Page Source&quot;.\nIn this case the sonnets page does not have distinctive semantic markup, but each poem is contained inside a single <code>&lt;p&gt;</code> element.\nThus, if all the paragraphs are selected, the sonnets can be extracted from the group.</p>\n<p>{% include figure.html caption=&quot;Each sonnet is a &lt;p&gt; with lines separated by &lt;br /&gt;&quot; filename=&quot;refine-sonnet-markup.png&quot; %}</p>\n<p>On the <em>fetch</em> column, click on the menu arrow &gt; <em>edit column</em> &gt; <em>Add column based on this column</em>.\nGive the new column the name &quot;parse&quot;, then click in the <em>Expression</em> text box.</p>\n<p>{% include figure.html caption=&quot;Edit column &gt; Add column based on this column&quot; filename=&quot;refine-expression-box.png&quot; %}</p>\n<p>Data in Refine can be transformed using the <a href=\"https://github.com/OpenRefine/OpenRefine/wiki/General-Refine-Expression-Language\">General Refine Expression Language</a> (GREL).\nThe <em>Expression</em> box accepts GREL functions that will be applied to each cell in the existing column to create values for the new one.\nThe <em>Preview</em> window below the <em>Expression</em> box displays the current value on the left and the value for the new column on the right.</p>\n<p>The default expression is <code>value</code>, the <a href=\"https://github.com/OpenRefine/OpenRefine/wiki/Variables\">GREL variable</a> representing the current contents of a cell.\nThis means that each cell is simply copied to the new column, which is reflected in the <em>Preview</em>.\nGREL variables and functions are strung together in sequence using a period, called dot notation.\nThis allows complex operations to be constructed by passing the results of each function to the next.</p>\n<p>GREL&#39;s <code>parseHtml()</code> function can read HTML content, allowing elements to be accessed using the <code>select()</code> function and the <a href=\"https://jsoup.org/cookbook/extracting-data/selector-syntax\">jsoup selector syntax</a>.\nStarting with <code>value</code>, add the functions <code>parseHtml()</code> and <code>select(&quot;p&quot;)</code> in the <em>Expression</em> box using dot notation, resulting in:</p>\n<pre><code>value.parseHtml().select(&quot;p&quot;)\n</code></pre>\n<p>Do not click <em>OK</em> at this point, simply look at the <em>Preview</em> to see the result of the expression.</p>\n<p>{% include figure.html caption=&quot;Edit the GREL expression, parseHtml function&quot; filename=&quot;refine-parse-html.png&quot; %}</p>\n<p>Notice that the output on the right no longer starts with the HTML root elements (<code>&lt;!DOCTYPE html</code> etc.) seen on the left.\nInstead, it starts with a square bracket <code>[</code>, displaying an <a href=\"https://en.wikipedia.org/wiki/Array_data_type\">array</a> of all the <code>p</code> elements found in the page.\nRefine represents an array as a comma separated list enclosed in square brackets, for example <code>[ &quot;one&quot;, &quot;two&quot;, &quot;three&quot; ]</code>.</p>\n<p>Refine is visual and iterative; it is common to gradually build up an expression while checking the preview to see the result.\nIn addition to helping debug your GREL, this provides an opportunity learn more about the data set before adding more functions.\nTry the following GREL statements in the <em>Expression</em> box without clicking <em>OK</em>.\nWatch the preview window to understand how they function:</p>\n<ul>\n<li>Adding an index number to the expression selects one element from the array, for example <code>value.parseHtml().select(&quot;p&quot;)[0]</code>. The beginning of the sonnets file contains many paragraphs of license information that are unnecessary for the data set. Skipping ahead through the index numbers, the first sonnet is found at <code>value.parseHtml().select(&quot;p&quot;)[37]</code>.</li>\n<li>GREL also supports using negative index numbers, thus <code>value.parseHtml().select(&quot;p&quot;)[-1]</code> will return the last item in the array. Working backwards, the last sonnet is at index <code>[-3]</code>.</li>\n<li>Using these index numbers, it is possible to slice the array, extracting only the range of <code>p</code> that contain sonnets. Add the <code>slice()</code> function to the expression to preview the sub-set: <code>value.parseHtml().select(&quot;p&quot;).slice(37,-2)</code>.</li>\n</ul>\n<p>Clicking <em>OK</em> with the expression above will result in a blank column, a common cause of confusion when working with arrays.\nRefine will not store an array object as a cell value.\nIt is necessary to use <code>toString()</code> or <code>join()</code> to convert the array into a string variable.\nThe <code>join()</code> function concatenates an array with the specified separator.\nFor example, the expression <code>[ &quot;one&quot;, &quot;two&quot;, &quot;three&quot; ].join(&quot;;&quot;)</code> will result in the string &quot;one;two;three&quot;.\nThus, the final expression to create the <em>parse</em> column is:</p>\n<pre><code>value.parseHtml().select(&quot;p&quot;).slice(37,-2).join(&quot;|&quot;)\n</code></pre>\n<p>Click <em>OK</em> to create the new column using the expression.</p>\n<div class=\"alert alert-warning\">\nTest out a transformation to see what happens--it is very easy to undo!\nThe full history of operations is recorded in the \"Undo / Redo\" tab.\n</div>\n\n<h2 id=\"split-cells\">Split Cells</h2>\n<p>The <em>parse</em> column now contains all the sonnets separated by &quot;|&quot;, but the project still contains only one row.\nIndividual rows for each sonnet can be created by splitting the cell.\nClick the menu arrow on the <em>parse</em> column &gt; <em>Edit cells</em> &gt; <em>Split multi-valued cells</em>.\nEnter the separator <code>|</code> that was used to <code>join</code> in the last step.</p>\n<p>{% include figure.html caption=&quot;Edit cells &gt; Split multivalued cells&quot; filename=&quot;refine-split-multivalued.png&quot; %}</p>\n<p>After this operation, the top of the project table should now read 154 rows.\nBelow the number is an option toggle &quot;Show as: <em>rows</em> <em>records</em>&quot;.\nClicking on <em>records</em> will group the rows based on the original table, in this case it will read 1.\nKeeping track of these numbers is an important &quot;sanity check&quot; when transforming data in Refine.\nThe 154 rows make sense because the ebook contained 154 sonnets, while 1 record represents the original table with only one row.\nAn unexpected number would indicate a problem with the transformation.</p>\n<p>{% include figure.html caption=&quot;Project rows&quot; filename=&quot;refine-rows.png&quot; %}</p>\n<p>Each cell in the <em>parse</em> column now contains one sonnet surround by a <code>&lt;p&gt;</code> tag.\nThe tags can be cleaned up by parsing the HTML again.\nClick on the <em>parse</em> column and select <em>Edit cells</em> &gt; <em>Transform</em>.\nThis will bring up a dialog box similar to creating a new column.\nTransform will overwrite the cells of the current column rather than creating a new one.</p>\n<p>In the expression box, type <code>value.parseHtml()</code>.\nThe preview will show a complete HTML tree starting with the <code>&lt;html&gt;</code> element.\nIt is important to note that <code>parseHtml()</code> will automatically fill in missing tags, allowing it to parse these cell values despite not being valid HTML documents.\nSelect the <code>p</code> tag, add an index number, and use the function <code>innerHtml()</code> to extract the sonnet text:</p>\n<pre><code>value.parseHtml().select(&quot;p&quot;)[0].innerHtml()\n</code></pre>\n<p>Click <em>OK</em> to transform all 154 cells in the column.</p>\n<p>{% include figure.html caption=&quot;Edit cells &gt; Transform&quot; filename=&quot;refine-innerhtml.png&quot; %}</p>\n<div class=\"alert alert-warning\">\nIn the expression above <code>select</code> returns an array of <code>p</code> elements even though there is only one in each cell.\nAttempting to pass an array to <code>innerHtml()</code> will raise an error.\nThus, an index number is necessary to select the first (and only) item in the array to pass the correct object type to <code>innerHtml()</code>.\n<br>Keep data object types in mind when debugging GREL expressions!\n</div>\n\n<h2 id=\"unescape\">Unescape</h2>\n<p>Notice that each cell has dozens of <code>&amp;nbsp;</code>, an HTML entity used to represent &quot;no-break space&quot; since browsers ignore extra white space in the source.\nThese entities are common when harvesting web pages and can be quickly replaced with the corresponding plain text characters using the <code>unescape()</code> function.\nOn the <em>parse</em> column, select <em>Edit cells</em> &gt; <em>Transform</em> and type the following in the expression box:</p>\n<pre><code>value.unescape(&#39;html&#39;)\n</code></pre>\n<p>The entities will be replaced with normal whitespace.</p>\n<h2 id=\"extract-information-with-array-functions\">Extract Information with Array Functions</h2>\n<p><a href=\"https://github.com/OpenRefine/OpenRefine/wiki/GREL-Array-Functions\">GREL array functions</a> provide a powerful way to manipulate text data and can be used to finish processing the sonnets.\nAny string value can be turned into an array using the <code>split()</code> function by providing the character or expression that separates the items (basically the opposite of <code>join()</code>).</p>\n<p>In the sonnets each line ends with <code>&lt;br /&gt;</code>, providing a convenient separator for splitting.\nThe expression <code>value.split(&quot;&lt;br /&gt;&quot;)</code> will create an array of the lines of each sonnet.\nIndex numbers and slices can then be used to populate new columns.\nKeep in mind that Refine will not output an array directly to a cell.\nBe sure to select one element from the array using an index number or convert it back to a string with <code>join()</code>.</p>\n<p>Furthermore, the sonnet text contains a huge amount of unnecessary white space that was used to layout the poems in the ebook.\nThis can be cut from each line using the <code>trim()</code> function.\nTrim automatically removes all leading and trailing white space in a cell, an essential for data cleaning.</p>\n<p>Using these concepts, a single line can be extracted and trimmed to create clean columns representing the sonnet number and first line.\nCreate two new columns from the <em>parse</em> column using these names and expressions:</p>\n<ul>\n<li>&quot;number&quot;, <code>value.split(&quot;&lt;br /&gt;&quot;)[0].trim()</code></li>\n<li>&quot;first&quot;, <code>value.split(&quot;&lt;br /&gt;&quot;)[1].trim()</code></li>\n</ul>\n<p>{% include figure.html caption=&quot;GREL split and trim&quot; filename=&quot;refine-add-num-column.png&quot; %}</p>\n<p>The next column to create is the full sonnet text which contains multiple lines.\nHowever, <code>trim()</code> will only clean the beginning and end of the cell, leaving unnecessary whitespace in the body of the sonnet.\nTo trim each line individually use the <a href=\"https://github.com/OpenRefine/OpenRefine/wiki/GREL-Controls\">GREL control</a> <code>forEach()</code>, a handy loop that iterates over an array.</p>\n<p>From the <em>parse</em> column, create a new column named &quot;text&quot;, and click in the <em>Expression</em> box.\nA <code>forEach()</code> statement asks for an array, a variable name, and an expression applied to the variable.\nFollowing the form <code>forEach(array, variable, expression)</code>, construct the loop using these parameters:</p>\n<ul>\n<li>array: <code>value.split(&quot;&lt;br /&gt;&quot;)</code>, creates an array from the lines of the sonnet in each cell.</li>\n<li>variable: <code>line</code>, each item in the array is then represented as the variable (it could be anything, <code>v</code> is often used).</li>\n<li>expression: <code>line.trim()</code>, each item is then evaluated separately with the specified expression. In this case, <code>trim()</code> cleans the white space from each sonnet line in the array.</li>\n</ul>\n<p>At this point, the statement should look like <code>forEach(value.split(&quot;&lt;br /&gt;&quot;), line, line.trim())</code> in the <em>Expression</em> box.\nNotice that the <em>Preview</em> now shows an array where the first element is the sonnet number.\nSince the results of the <code>forEach()</code> are returned as a new array, additional array functions can be applied, such as slice and join.\nAdd <code>slice(1)</code> to remove the sonnet number, and <code>join(&quot;\\n&quot;)</code> to concatenate the lines in to a string value (<code>\\n</code> is the symbol for new line in plain text).\nThus, the final expression to extract and clean the full sonnet text is:</p>\n<pre><code>forEach(value.split(&quot;&lt;br /&gt;&quot;), line, line.trim()).slice(1).join(&quot;\\n&quot;)\n</code></pre>\n<p>{% include figure.html caption=&quot;GREL forEach expression&quot; filename=&quot;refine-foreach.png&quot; %}</p>\n<p>Click &quot;OK&quot; to create the column.\nFollowing the same technique, add another new column from <em>parse</em> named &quot;last&quot; to represent the final couplet lines using:</p>\n<pre><code>forEach(value.split(&quot;&lt;br /&gt;&quot;), line, line.trim()).slice(-3).join(&quot;\\n&quot;)\n</code></pre>\n<p>Finally, numeric columns can be added using the <code>length()</code> function.\nCreate new columns from <em>text</em> with the names and expressions below:</p>\n<ul>\n<li>&quot;characters&quot;, <code>value.length()</code></li>\n<li>&quot;lines&quot;, <code>value.split(/\\n/).length()</code></li>\n</ul>\n<h2 id=\"cleanup-and-export\">Cleanup and Export</h2>\n<p>In this example, we used a number of operations to create new columns with clean data.\nThis is a typical Refine workflow, allowing each transformation to be easily checked against the existing data.\nAt this point the unnecessary columns can be removed.\nClick on the <em>All</em> column &gt; <em>Edit columns</em> &gt; <em>Re-order / remove columns</em>.</p>\n<p>{% include figure.html caption=&quot;All &gt; Edit columns&quot; filename=&quot;refine-reorder.png&quot; %}</p>\n<p>Drag unwanted column names to the right side of the dialog box, in this case <em>Column 1</em>, <em>fetch</em>, and <em>parse</em>.\nDrag the remaining columns into the desired order on the left side.\nClick <em>Ok</em> to remove and reorder the data set.</p>\n<p>{% include figure.html caption=&quot;Re-order / Remove columns&quot; filename=&quot;refine-reorder2.png&quot; %}</p>\n<p>Use filters and facets to explore and subset the collection of sonnets.\nThen click the export button to generate a version of the new sonnet table for use outside of Refine.\nOnly the currently selected subset will be exported.</p>\n<p>{% include figure.html caption=&quot;Export CSV&quot; filename=&quot;refine-export.png&quot; %}</p>\n<h1 id=\"example-2-url-queries-and-parsing-json\">Example 2: URL Queries and Parsing JSON</h1>\n<p>Many cultural institutions provide web APIs allowing users to access information about their collections via simple <a href=\"https://en.wikipedia.org/wiki/Hypertext_Transfer_Protocol\">HTTP</a> requests.\nThese sources enable new queries and aggregations of text that were previously impossible, cutting across boundaries of repositories and collections to support large scale analysis of both content and metadata.\nThis example will harvest data from the <a href=\"https://chroniclingamerica.loc.gov/\">Chronicling America</a> project to assemble a small set of newspaper front pages with full text.\nFollowing a common web scraping workflow, Refine is used to construct the query URL, fetch the information, and parse the JSON response.</p>\n<div class=\"alert alert-warning\">\nChronicling America is fully open, thus no key or account is needed to access the API and there are no limits on the use.\nOther aggregators are often proprietary and restricted.\nPlease review the specific terms of use before web scraping or using the information in research.\n</div>\n\n<h2 id=\"start-chronicling-america-project\">Start &quot;Chronicling America&quot; Project</h2>\n<p>To get started after completing <em>Example 1</em>, click the <em>Open</em> button in the upper right.\nA new tab will open with the Refine start project view.\nThe tab with the Sonnets project can be left open without impacting performance.\nCreate a project from <em>Clipboard</em> by pasting this CSV into the text box:</p>\n<pre><code>state,year\nIdaho,1865\nMontana,1865\nOregon,1865\nWashington,1865\n</code></pre>\n<p>After clicking <em>Next</em>, Refine should automatically identify the content as a CSV with the correct parsing options.\nAdd the <em>Project name</em> &quot;ChronAm&quot; at the top right and click <em>Create project</em>.</p>\n<p>{% include figure.html caption=&quot;Create project&quot; filename=&quot;refine-start-project.png&quot; %}</p>\n<h2 id=\"construct-a-query\">Construct a Query</h2>\n<p>Chronicling America provides <a href=\"https://chroniclingamerica.loc.gov/about/api/\">documentation</a> for their API and URL patterns.\nIn addition to formal documentation, information about alternative formats and search API are sometimes given in the <code>&lt;head&gt;</code> element of a web page.\nCheck for <code>&lt;link rel=&quot;alternate&quot;</code>, <code>&lt;link rel=&quot;search&quot;</code>, or <code>&lt;!--</code> comments which provide hints on how to interact with the site.\nThese clues provide a recipe book for interacting with the server using public links.</p>\n<p>The basic components of the ChromAm API are:</p>\n<ul>\n<li>the base URL, <code>https://chroniclingamerica.loc.gov/</code></li>\n<li>the search service location for individual newspaper pages, <code>search/pages/results</code></li>\n<li>a query string, starting with <code>?</code> and made up of value pairs (<code>fieldname=value</code>) separated by <code>&amp;</code>. Much like using the <a href=\"https://chroniclingamerica.loc.gov/#tab=tab_advanced_search\">advanced search form</a>, the value pairs of the query string set the <a href=\"https://chroniclingamerica.loc.gov/search/pages/opensearch.xml\">search options</a>.</li>\n</ul>\n<p>Using a GREL expression, these components can be combined with the values in the &quot;ChronAm&quot; project to construct a search query URL.\nThe contents of the data table can be accessed using <a href=\"https://github.com/OpenRefine/OpenRefine/wiki/Variables\">GREL variables</a>.\nAs introduced in <em>Example 1</em>, the value of each cell in the current column is represented by <code>value</code>.\nValues in the same row can be retrieved using the <code>cells</code> variable plus the column name.\nThere are two ways to write a <code>cells</code> statement: bracket notation <code>cells[&#39;column name&#39;].value</code> which allows column names that include a space, or dot notation <code>cells.column_name.value</code> which allows only single word column names.</p>\n<p>In GREL, strings are concatenated using the plus sign.\nFor example, the expression <code>&quot;one&quot; + &quot;two&quot;</code> would result in &quot;onetwo&quot;.</p>\n<p>To create the set of search queries, from the <em>state</em> column, add a column named &quot;url&quot; with this expression:</p>\n<pre><code>&quot;https://chroniclingamerica.loc.gov/search/pages/results/?state=&quot; + value.escape(&#39;url&#39;) + &quot;&amp;date1=&quot; + cells[&#39;year&#39;].value.escape(&#39;url&#39;) + &quot;&amp;date2=&quot; + cells[&#39;year&#39;].value.escape(&#39;url&#39;) + &quot;&amp;dateFilterType=yearRange&amp;sequence=1&amp;sort=date&amp;rows=5&amp;format=json&quot;\n</code></pre>\n<p>{% include figure.html caption=&quot;Create query URL&quot; filename=&quot;refine-chronam-url.png&quot; %}</p>\n<p>The expression concatenates the constants (base URL, search service, and query field names) together with the values in each row.\nThe <code>escape()</code> function is added to the cell variables to ensure the string will be safe in a URL (the opposite of the <code>unescape()</code> function introduced in <em>Example 1</em>).</p>\n<p>Look at the value pairs after the <code>?</code> to understand the parameters of the search.\nExplicitly, the first query URL will ask for newspapers:</p>\n<ul>\n<li>from Idaho (<code>state=Idaho</code>)</li>\n<li>from the year 1865, (<code>date1=1865&amp;date2=1865&amp;dateFilterType=yearRange</code>)</li>\n<li>only the front pages (<code>sequence=1</code>)</li>\n<li>sorting by date (<code>sort=date</code>)</li>\n<li>returning a maximum of five (<code>rows=5</code>)</li>\n<li>in JSON (<code>format=json</code>)</li>\n</ul>\n<h2 id=\"fetch-urls\">Fetch URLs</h2>\n<p>The <em>url</em> column is a list of web queries that could be accessed with a browser.\nTo test, click one of the links.\nThe url will open in a new tab, returning a JSON response.</p>\n<p>Fetch the URLs using <em>url</em> column by selecting <em>Edit column</em> &gt; <em>Add column by fetching urls</em>.\nName the new column &quot;fetch&quot; and click <em>OK</em>.\nIn a few seconds, the operation should complete and the <em>fetch</em> column will be filled with <a href=\"http://www.json.org/\">JSON</a> data.</p>\n<h2 id=\"parse-json-to-get-items\">Parse JSON to Get Items</h2>\n<p>The first name/value pairs of the query response look like <code>&quot;totalItems&quot;: 52, &quot;endIndex&quot;: 5</code>.\nThis indicates that the search resulted in 52 total items, but the response contains only five (since it was limited by the <code>rows=5</code> option).\nThe JSON key <code>items</code> contains an array of the individual newspapers returned by the search.\nTo construct a orderly data set, it is necessary to parse the JSON and split each newspaper into its own row.</p>\n<p>GREL&#39;s <code>parseJson()</code> function allows us to select a key name to retrieve the corresponding values.\nAdd a new column based on <em>fetch</em> with the name &quot;items&quot; and enter this expression:</p>\n<pre><code>value.parseJson()[&#39;items&#39;].join(&quot;|||&quot;)\n</code></pre>\n<p>{% include figure.html caption=&quot;parse json items&quot; filename=&quot;refine-parse-items.png&quot; %}</p>\n<p>Selecting <code>[&#39;items&#39;]</code> exposes the array of newspaper records nested inside the JSON response.\nThe <code>join()</code> function concatenates the array with the given separator resulting in a string value.\nSince the newspaper records contain an OCR text field, the strange separator &quot;|||&quot; is necessary to ensure that it is unique and can be used to split the values.</p>\n<h2 id=\"split-multivalued-cells\">Split Multivalued Cells</h2>\n<p>With the individual newspapers isolated, separate rows can be created by splitting the cells.\nOn the <em>items</em> column, select <em>Edit cells</em> &gt;  <em>Split multivalued cells</em>, and enter the join used in the last step, <code>|||</code>.\nAfter the operation, the top of the project table should read 20 rows.\nClicking on Show as <em>records</em> should read 4, representing the original CSV rows.</p>\n<p>Notice that the new rows are empty in all columns except <em>items</em>.\nTo ensure the state is available with each newspaper issue, the empty values can be filled using the <code>Fill down</code> function.\nClick on the <em>state</em> column &gt; <em>Edit cells</em> &gt; <em>Fill down</em>.</p>\n<p>{% include figure.html caption=&quot;fill down&quot; filename=&quot;refine-fill-down.png&quot; %}</p>\n<p>This is a good point to clean up the unnecessary columns.\nClick on the <em>All</em> column &gt; <em>Edit columns</em> &gt; <em>Re-order / remove columns</em>.\nDrag all columns except <em>state</em> and <em>items</em> to the right side, then click <em>OK</em> to remove them.</p>\n<p>{% include figure.html caption=&quot;Re-order / remove columns&quot; filename=&quot;refine-chronam-reorder.png&quot; %}</p>\n<p>Sanity check: with the original columns removed, both <em>records</em> and <em>rows</em> will read 20.\nThis makes sense, as the project started with four states and fetched five records for each.</p>\n<h2 id=\"parse-json-values\">Parse JSON Values</h2>\n<p>To complete the data set, it is necessary to parse each newspaper&#39;s JSON record into individual columns.\nThis is a common task, as many web APIs return information in JSON format.\nAgain, GREL&#39;s <code>parseJson()</code> function makes this easy.\nCreate a new column from <em>items</em> for each newspaper metadata element by parsing the JSON and selecting the key:</p>\n<ul>\n<li>&quot;date&quot;, <code>value.parseJson()[&#39;date&#39;]</code></li>\n<li>&quot;title&quot;, <code>value.parseJson()[&#39;title&#39;]</code></li>\n<li>&quot;city&quot;, <code>value.parseJson()[&#39;city&#39;].join(&quot;, &quot;)</code></li>\n<li>&quot;lccn&quot;, <code>value.parseJson()[&#39;lccn&#39;]</code></li>\n<li>&quot;text&quot;, <code>value.parseJson()[&#39;ocr_eng&#39;]</code></li>\n</ul>\n<p>After the desired information is extracted, the <em>items</em> column can be removed by selecting <em>Edit column</em> &gt; <em>Remove this column</em>.</p>\n<p>{% include figure.html caption=&quot;Final ChronAm project columns&quot; filename=&quot;refine-chronam-final.png&quot; %}</p>\n<p>Each column could be further refined using other GREL transformations.\nFor example, to convert <em>date</em> to a more readable format, use <a href=\"https://github.com/OpenRefine/OpenRefine/wiki/GREL-Date-Functions\">GREL date functions</a>.\nTransform the <em>date</em> column with the expression <code>value.toDate(&quot;yyyymmdd&quot;).toString(&quot;yyyy-MM-dd&quot;)</code>.</p>\n<p>Another common workflow is to extend the data with further URL queries.\nFor example, a link to full information about each issue can be formed based on the <em>lccn</em>.\nCreate a new column based on <em>lccn</em> using the expression <code>&quot;https://chroniclingamerica.loc.gov/lccn/&quot; + value + &quot;/&quot; + cells[&#39;date&#39;].value + &quot;/ed-1.json&quot;</code>.\nFetching this URL returns a complete list of the issue&#39;s pages, which could in turn be harvested.</p>\n<p>For now, the headlines of 1865 from the Northwest are ready to enjoy!</p>\n<h1 id=\"example-3-advanced-apis\">Example 3: Advanced APIs</h1>\n<p><em><a href=\"#example-2-url-queries-and-parsing-json\">Example 2</a></em> demonstrated Refine&#39;s fetch function with a simple web API, essentially utilizing URL patterns to request information from a server.\nThis workflow uses the HTTP GET protocol, meaning the query is encoded in the URL string, thus limited in length (2048 ASCII characters), complexity, and security.\nInstead, many API services used to enhance text data, such as <a href=\"https://en.wikipedia.org/wiki/Geocoding\">geocoding</a> or <a href=\"https://en.wikipedia.org/wiki/Named-entity_recognition\">named entity recognition</a>, use HTTP POST to transfer information to the server for processing.</p>\n<p>GREL does not have a built in function to use this type of API.\nHowever, the expression window language can be changed to <a href=\"http://www.jython.org/\">Jython</a>, providing a more complete scripting environment where it is possible to implement a POST request.</p>\n<blockquote>\n<p><a href=\"http://www.jython.org/\">Jython</a> is Python implemented for the Java VM and comes bundled with Refine.\nThis means <a href=\"https://docs.python.org/2.7/\">Python 2</a> scripts using the Standard Library can be written or loaded into the expression window, and Refine will apply them to each cell in the transformation.\nThe <a href=\"https://github.com/OpenRefine/OpenRefine/wiki/Jython\">official documentation</a> is sparse, but the built-in Jython can be extended with non-standard libraries using a <a href=\"https://github.com/OpenRefine/OpenRefine/wiki/Extending-Jython-with-pypi-modules\">work around</a>.</p>\n<p>Keep in mind that spending time writing complex scripts moves away from the strengths of Refine.\nIf it is necessary to develop a lengthy Jython routine, it will likely be more efficient to process the data directly in Python.\nOn the other hand, if you know a handy method to process data in Python 2, Jython is a easy way to apply it in a Refine project.</p>\n</blockquote>\n<h2 id=\"jython-in-the-expression-window\">Jython in the Expression Window</h2>\n<p>Return to the &quot;Sonnets&quot; project completed in <em><a href=\"#example-1-fetching-and-parsing-html\">Example 1</a></em>.\nIf the tab was closed, click <em>Open</em> &gt; <em>Open Project</em> and find the Sonnets example (Refine saves everything for you!).</p>\n<p>Add a new column based on the <em>first</em> column named &quot;sentiment&quot;.\nWe will use this window to test out a series of expressions, so leave it open until we get to the final iteration of the request.</p>\n<p>On the right side of the <em>Expression</em> box is a drop down to change the expression language.\nSelect <em>Python / Jython</em> from the list.</p>\n<p>{% include figure.html caption=&quot;Jython expression&quot; filename=&quot;refine-jython.png&quot; %}</p>\n<p>Notice that the preview now shows <code>null</code> for the output.\nA Jython expression in Refine must have a <code>return</code> statement to add the output to the new cells in the transformation.\nType <code>return value</code> into the <em>Expression</em> box.\nThe preview will update showing the current cells copied to the output.\nThe basic <a href=\"https://github.com/OpenRefine/OpenRefine/wiki/Variables\">GREL variables</a> can be used in Jython by substituting brackets instead of periods.\nFor example, the GREL <code>cells.column-name.value</code> would be Jython <code>cells[&#39;column-name&#39;][&#39;value&#39;]</code>.</p>\n<h2 id=\"jython-get-request\">Jython GET Request</h2>\n<p>To create a HTTP request in Jython, use the standard library <a href=\"https://docs.python.org/2/library/urllib2.html\">urllib2</a>.\nRefine&#39;s fetch function can be recreated with Jython to demonstrate the basics of the library.\nIn the expression box, type:</p>\n<pre><code>import urllib2\nget = urllib2.urlopen(&quot;http://www.jython.org/&quot;)\nreturn get.read()\n</code></pre>\n<p>{% include figure.html caption=&quot;Jython GET request&quot; filename=&quot;refine-jython-expression.png&quot; %}</p>\n<p>The preview should display the HTML source of the Jython home page, this is an HTTP GET request as in previous fetch examples.\nNotice that similar to opening and reading a text file with Python, <code>urlopen()</code> returns a file-like object that must be <code>read()</code> into a string.\nThe URL could be replaced with cell variables to construct a query similar to the fetch used in <em>Example 2</em>.</p>\n<h2 id=\"post-request\">POST Request</h2>\n<p>Urllib2 will automatically send a POST if data is added to the request object.\nFor example, <a href=\"http://text-processing.com/\">Text Processing</a> provides natural language processing APIs based on <a href=\"http://www.nltk.org/\">Python NLTK</a>.\nThe documentation for the <a href=\"http://text-processing.com/docs/sentiment.html\">Sentiment Analysis service</a> provides a base URL and the name of the key used for the data to be analyzed.\nNo authentication is required and 1,000 calls per day are free for non-commercial use.[^use]</p>\n<p>This type of API is often demonstrated using <a href=\"https://curl.haxx.se/\">curl</a> on the commandline.\nText Processing gives the example <code>curl -d &quot;text=great&quot; http://text-processing.com/api/sentiment/</code> which can be recreated in Jython to test the service.\nBuilding on the GET expression above, the POST data is added as the second parameter of <em>urlopen</em>, thus the request will be in the form <code>urllib2.urlopen(url, data)</code>.\nType this script into the expression window:</p>\n<pre><code>import urllib2\nurl = &quot;http://text-processing.com/api/sentiment/&quot;\ndata = &quot;text=what is the sentiment of this sentence&quot;\npost = urllib2.urlopen(url, data)\nreturn post.read()\n</code></pre>\n<p>The preview should show a JSON response with sentiment probability values.\nTo retrieve sentiment analysis data for the first lines of the sonnets (remember we are still adding a column based on <em>first</em>!), put the basic Jython pattern together with the values of the cells:</p>\n<pre><code>import urllib2\nurl = &quot;http://text-processing.com/api/sentiment/&quot;\ndata = &quot;text=&quot; + value\npost = urllib2.urlopen(url, data)\nreturn post.read()\n</code></pre>\n<p>{% include figure.html caption=&quot;jython request&quot; filename=&quot;refine-jython-request.png&quot; %}</p>\n<p>Click <em>OK</em> and the Jython script will run for every row in the column.\nThe JSON response can then be parsed with GREL using the methods demonstrated in <em>Example 2</em> (for example, <code>value.parseJson()[&#39;label&#39;]</code>).</p>\n<p>Given the small expression window and uniform data, the script above is pragmatically simplified and compressed.\nWhen Refine is encountering problems, it is better to implement a more complete script with error handling.\nIf necessary, a throttle delay can be implemented by importing <code>time</code> and adding <code>time.sleep()</code> to the script.\nFor example, the POST request could be rewritten:</p>\n<pre><code>import urllib2, urllib, time\ntime.sleep(15)\nurl = &quot;http://text-processing.com/api/sentiment/&quot;\ndata = urllib.urlencode({&quot;text&quot;: value.encode(&quot;utf-8&quot;)})\nreq = urllib2.Request(url,data)\ntry:\n    post = urllib2.urlopen(req)\nexcept urllib2.URLError as e:\n    if hasattr(e, &quot;reason&quot;):\n        return &quot;Failed: &quot;, e.reason\n    elif hasattr(e, &quot;code&quot;):\n        return &quot;Error code: &quot;, e.code\nelse:\n    response = post.read()\n    return response\n</code></pre>\n<blockquote>\n<p>Some APIs require authentication tokens to be passed with the POST request as data or headers.\nHeaders can be added as the third parameter of <code>urllib2.Request()</code> similar to how data was added in the example above.\nCheck the Python <a href=\"https://docs.python.org/2/library/urllib2.html\">urllib2 documentation</a> and <a href=\"https://docs.python.org/2/howto/urllib2.html\">how-to</a> for advanced options.</p>\n<p>When harvesting web content, character encoding issues commonly produce errors in Python.\nTrimming whitespace, using GREL <code>escape()</code> / <code>unescape()</code>, or Jython <code>encode(&quot;utf-8&quot;)</code> will often fix the problem.</p>\n</blockquote>\n<h2 id=\"compare-sentiment\">Compare Sentiment</h2>\n<p>To practice constructing a POST request, read the documentation for <a href=\"http://sentiment.vivekn.com/docs/api/\">Sentiment Tool</a>, another free API.\nFind the service URL and data key necessary to modify the Jython pattern above.\nCreate a new column from <em>first</em> named <code>sentiment2</code> and test the script.</p>\n<p>There are many possible ways to create the request, for example:</p>\n<pre><code>import urllib2\nurl = &quot;http://sentiment.vivekn.com/api/text/&quot;\ndata = &quot;txt=&quot; + value\npost = urllib2.urlopen(url, data)\nreturn post.read()\n</code></pre>\n<p>The JSON response contains different metrics, but it will be obvious that the APIs disagree on many of the sentiment &quot;labels&quot; (for example, use <code>value.parseJson()[&#39;result&#39;][&#39;sentiment&#39;]</code> to extract a label comparable to the first API).\nThese are simple free APIs for demonstration purposes, but it is important to critically investigate services to more fully understand the potential of the metrics.</p>\n<p>Both APIs use a <a href=\"https://en.wikipedia.org/wiki/Naive_Bayes_classifier\">naive bayes classifier</a> to categorize text input.\nThese models must be trained on pre-labeled data and will be most accurate on similar content.\nText Processing is trained on twitter and movie reviews[^1], and Sentiment Tool on IMDb movie reviews[^2].\nThus both are optimized for small chunks of modern English language similar to a review, with a limited bag of words used to determine the sentiment probabilities.</p>\n<p>Archaic words and phrases contribute significantly to the sonnets&#39; sentiment, yet are unlikely to be given any weight in these models since they are not present in the training data.\nWhile comparing the metrics is fascinating, neither is likely to produce quality results for this data set.\nRather than an accurate sentiment, we might be surprised to find a quantifiable dissonance between the sonnet&#39;s English and our modern web usage.\nHowever, a model optimized to Shakespeare&#39;s words could be developed using more appropriate training data.\nTo learn more about classifiers and how to implement one, see Vilja Hulden&#39;s PH lesson <a href=\"/lessons/naive-bayesian\">&quot;Supervised Classification: The Naive Bayesian Returns to the Old Bailey&quot;</a> or Steven Bird, Ewan Klein, and Edward Loper&#39;s <a href=\"http://www.nltk.org/book/ch06.html\">&quot;Learning to Classify Text&quot;</a> in the <a href=\"http://www.nltk.org/book/\">NTLK Book</a>.</p>\n<p>Accessing data and services on the web opens new possibilities and efficiencies for humanities research.\nWhile powerful, these APIs are often not aimed at humanities scholarship and may not be appropriate or optimized for our inquiries.\nThe training data may be incomplete, biased, or secret.\nWe should always be asking questions about these aggregations and algorithms, thinking critically about the metrics they are capable of producing.\nThis is not a new technical skill, but an application of the historian&#39;s traditional expertise, not unlike interrogating physical primary materials to unravel bias and read between the lines.\nHumanities scholars routinely synthesize and evaluate convoluted sources to tell important narratives, and must carry that skill into digital realm.\nWe can critically evaluate data sources, algorithms, and API services, as well as create new ones more suited to our questions and methods.</p>\n<p>With its unique ability to interactively wrangle data from raw aggregation to analysis, Refine supports exploratory research and offers a wonderfully fluid and playful approach to tabular data.\nOpenRefine is a flexible, pragmatic tool that simplifies routine tasks and, when combined with domain knowledge, extends research capabilities.</p>\n<p>[^huynh]: David Huynh, &quot;Google Refine&quot;, Computer-Assisted Reporting Conference 2011, <a href=\"http://web.archive.org/web/20150528125345/http://davidhuynh.net/spaces/nicar2011/tutorial.pdf\">http://web.archive.org/web/20150528125345/http://davidhuynh.net/spaces/nicar2011/tutorial.pdf</a>.\n[^use]: As of July 2017, see <a href=\"http://text-processing.com/docs/index.html\">API Documentation</a>.\n[^1]: Jacob Perkins, &quot;Sentiment Analysis with Python NLTK Text Classification&quot;, <a href=\"http://text-processing.com/demo/sentiment/\">http://text-processing.com/demo/sentiment/</a>.\n[^2]: Vivek Narayanan, Ishan Arora, and Arjun Bhatia, &quot;Fast and accurate sentiment classification using an enhanced Naive Bayes model&quot;, 2013, <a href=\"https://arxiv.org/abs/1305.6143\">arXiv:1305.6143</a>.</p>\n"}