{"metadata":{"title":"Visualización y animación de tablas históricas con R\n","collection":"lessons","layout":"lesson","slug":"visualizacion-y-animacion-de-tablas-historicas-con-R","date":"2021-06-28T00:00:00.000Z","authors":["Marcelo Raimundo"],"reviewers":["Jennifer Isasi","Basthian Medina"],"editors":["Riva Quiroga"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/330","difficulty":2,"activity":"analyzing","topics":["distant-reading"],"abstract":"En esta lección aprenderás a visualizar y animar temporalmente datos históricos almacenados en forma de tabla.","avatar_alt":"Una mano llevando una botella.","doi":"10.46430/phes0052"},"html_body":"<h2 id=\"contenidos\">Contenidos</h2>\n<p>{:.no_toc}</p>\n<ul>\n<li>TOC\n{:toc}</li>\n</ul>\n<h1 id=\"resumen\">Resumen</h1>\n<p>Esta lección te mostrará cómo cruzar, graficar y animar un conjunto de datos históricos. Aprenderás a importar en <em>RStudio</em> una tabla disponible en una hoja de cálculo y a utilizar funciones que te permitan transformar esos datos para representarlos como una tabla de contingencia. También sabrás cómo utilizar funciones de nuevas librerías que te permitirán visualizar tus datos cruzados en forma gráfica e inclusive llegar a animarlos en perspectiva temporal.  </p>\n<h1 id=\"objetivos\">Objetivos</h1>\n<p>En esta lección aprenderás a:</p>\n<ol>\n<li>Ordenar y transformar tablas históricas para realizar análisis exploratorios</li>\n<li>Generar gráficos estáticos y animados para visualizar datos históricos</li>\n</ol>\n<h1 id=\"introducción\">Introducción</h1>\n<p>Es indudable que en una disciplina como la historia predomina el tratamiento cualitativo de los documentos y fuentes que el pasado nos ha legado. Pero, como ha señalado Roderick Floud, “aunque estemos básicamente más interesados en las cuestiones ‘cualitativas’ que en las ‘cuantitativas’, ambas están inextricablemente unidas”[^1]. Es decir, no compiten, no se reemplazan, sino que se complementan. Una forma de combinar ambas metodologías, es a través de la búsqueda de regularidades o patrones ocultos o, a la inversa, de anomalías. Esto permite acercar a quienes hacen investigación histórica a un mejor conocimiento de las coordenadas en las que situar sus interpretaciones. Si esa comprensión global de los datos puede visualizarse gráficamente, posibilita “que el investigador descubra fácilmente relaciones, similitudes y diferencias entre sus casos”. Desde que escribió Floud -a mediados de los años setenta- la tecnología informática y la programación han avanzado de tal manera que hacen muy fácil el cruce entre perspectivas metodológicas. De esta manera, si un trabajo histórico cualitativo apunta a profundizar aspectos de fenómenos que sucedieron en el pasado, uno cuantitativo te permitirá saber con qué frecuencia sucedieron, observar patrones y anomalías, y a establecer relaciones temporales entre las diferentes categorías de análisis existentes.</p>\n<p>Quien se propone hacer un análisis histórico cuantitativo debe partir de un ejercicio de codificación de las fuentes documentales que el pasado nos ha legado y plasmarlas en una matriz de datos. Es decir, esto demanda un proceso de conversión de nuestras fuentes de información, para transformar los datos textuales (palabras) en datos simbólicos operables digitalmente (números). Lo anterior consta de varios pasos: 1) <em>clasificar</em> los documentos a los que se ha accedido de forma que permitan su puesta en común según criterios determinados, 2) <em>categorizar</em> descriptiva, interpretativa o analíticamente, con ideas, categorías o conceptos el contenido de las fuentes, 3) <em>codificar</em>, poniendo a las distintas expresiones particulares de cada caso un símbolo (números, palabras), 4) <em>tabular</em>, es decir, representar los casos organizados en forma de una matriz en un soporte informático, habitualmente una hoja de cálculo.</p>\n<p>En esta lección te mostraremos una de las tantas formas en que se pueden analizar cuantitativamente archivos que reúnen información sistemática y seriada (como son casos de productores de documentación permanente como el Estado, empresas o la prensa) utilizando el lenguaje de programación R. El objetivo es que adquieras conocimientos que te permitan efectuar un análisis exploratorio de datos, trabajando principalmente la distribución de frecuencias de distintas variables a través de tablas de contingencia, para luego visualizarlas, generar gráficos y, finalmente, crear una animación de los mismos en perspectiva temporal.</p>\n<h1 id=\"requisitos\">Requisitos</h1>\n<p>Esta lección requiere que cuentes con nociones básicas de R, que tratan las lecciones <a href=\"/es/lecciones/datos-tabulares-en-r\">Datos tabulares en R</a> de Trayn Dewar y <a href=\"/es/lecciones/administracion-de-datos-en-r\">Administración de datos en R</a> de Nabeel Siddiqui.</p>\n<p>Además de R, deberás tener instalado el entorno de desarrollo [RStudio]\n(<a href=\"https://www.rstudio.com/products/rstudio/download/#download\">https://www.rstudio.com/products/rstudio/download/#download</a>). Si no lo tienes aún, <a href=\"https://www.youtube.com/watch?v=Nmu4WPdJBRo\">en este video</a> encontrarás una guía sobre cómo descargarlo e instalarlo.</p>\n<h1 id=\"los-datos-explorados\">Los datos explorados</h1>\n<p>El conjunto de datos que aquí se presenta servirá para que veas cómo R te puede ayudar a analizar dinámicas de la violencia política en Argentina a finales de la década de los años cincuenta, a partir de documentos policiales de espionaje. Habitualmente estos archivos de inteligencia se han utilizado para el estudio histórico de casos particulares, pero rara vez se ha apuntado a lograr grados de agregación que permitan hacer comparaciones entre distintos casos. Contar con algunos elementos básicos de programación facilita dar pasos en esa dirección.</p>\n<p>La fuente que te proponemos codificar es un legajo muy especial del archivo de la ex Dirección de Inteligencia de la Policía de Buenos Aires (Argentina). Contiene varios informes de inteligencia que contabilizan &quot;actos terroristas&quot; durante los años del período de conflictividad política y social que se conoce en la historia argentina como &quot;Resistencia peronista&quot;[^2]. En la Figura 1 se presenta una imagen escaneada de uno de los legajos. Lo interesante es que la información cruda se presenta de una manera que facilita su tabulación.</p>\n<p>{% include figure.html filename=&quot;visualizacion-y-animacion-de-tablas-historicas-con-R1.jpg&quot; caption=&quot;Figura 1. Imagen de un legajo con datos sobre atentados&quot; %}</p>\n<p>Este documento fue transformado en un conjunto de datos procesables cuantitativamente. Se construyó una tabla a partir información sobre algunas localidades de la provincia de Buenos Aires en 1959, año en el que el número de &quot;actos terroristas&quot; o atentados fue muy alto. Los datos representan los valores de ciertas variables de análisis comunes a todos los registros, como son la <em>ciudad</em> (dónde) y la <em>fecha</em> del atentado (cuándo). Desde la información descriptiva de la policía (atributos del atentado), fue posible generar variables como: <em>objeto</em> utilizado en el atentado (con qué elemento se realizó), <em>sitio</em> (lugar/espacio) y <em>objetivo</em> (contra quién). Con esta categorización, buscamos ahorrar un paso, ya que la tabla sigue los preceptos de &quot;datos ordenados&quot; (<em>tidy data</em>): cada variable forma una columna, cada observación forma una fila, cada valor tiene su propia celda, cada tipo de unidad observacional forma una tabla[^3].</p>\n<table>\n<thead>\n<tr>\n<th align=\"center\">fecha</th>\n<th align=\"center\">ciudad</th>\n<th align=\"center\">objeto</th>\n<th align=\"center\">sitio</th>\n<th align=\"center\">objetivo</th>\n</tr>\n</thead>\n<tbody><tr>\n<td align=\"center\">18/01/1959</td>\n<td align=\"center\">La Plata</td>\n<td align=\"center\">bomba</td>\n<td align=\"center\">sede</td>\n<td align=\"center\">institucion extranjera</td>\n</tr>\n<tr>\n<td align=\"center\">19/01/1959</td>\n<td align=\"center\">La Plata</td>\n<td align=\"center\">petardo</td>\n<td align=\"center\">vias ffcc</td>\n<td align=\"center\">ferrocarril</td>\n</tr>\n<tr>\n<td align=\"center\">19/01/1959</td>\n<td align=\"center\">Matanza</td>\n<td align=\"center\">bomba</td>\n<td align=\"center\">vias ffcc</td>\n<td align=\"center\">ferrocarril</td>\n</tr>\n<tr>\n<td align=\"center\">20/01/1959</td>\n<td align=\"center\">Avellaneda</td>\n<td align=\"center\">molotov</td>\n<td align=\"center\">comercio</td>\n<td align=\"center\">comercio</td>\n</tr>\n<tr>\n<td align=\"center\">20/01/1959</td>\n<td align=\"center\">Avellaneda</td>\n<td align=\"center\">bomba</td>\n<td align=\"center\">vias ffcc</td>\n<td align=\"center\">ferrocarril</td>\n</tr>\n<tr>\n<td align=\"center\">20/01/1959</td>\n<td align=\"center\">Lomas</td>\n<td align=\"center\">bomba</td>\n<td align=\"center\">vias ffcc</td>\n<td align=\"center\">ferrocarril</td>\n</tr>\n<tr>\n<td align=\"center\">20/01/1959</td>\n<td align=\"center\">Matanza</td>\n<td align=\"center\">bomba</td>\n<td align=\"center\">vias ffcc</td>\n<td align=\"center\">ferrocarril</td>\n</tr>\n</tbody></table>\n<p>Para esta lección utilizaremos la tabla correspondiente a los atentados en cinco ciudades de Argentina durante 1959, la que se encuentra disponible en el archivo <a href=\"/assets/visualizacion-y-animacion-de-tablas-historicas-con-R/atentados1959.xlsx\">atentados1959.xlsx</a></p>\n<h1 id=\"tratamiento-y-limpieza-de-los-datos-con-r\">Tratamiento y limpieza de los datos con R</h1>\n<p>En esta sección te mostraremos cómo cargar los datos en RStudio para comenzar a procesarlos. No esperes que esté todo listo para trabajar una vez importada la hoja de cálculo; siempre será necesaria una adecuación de tus datos para que R pueda interpretarlos. En lo que atañe a este caso, por ejemplo, luego de importarlos deberás asignarle un tipo a las variables, convertirlas, hacer algunas modificaciones en los datos y luego ordenarlos temporalmente.</p>\n<p>El primer paso será importarlos desde su formato de hoja de cálculo al entorno de RStudio. Para poder hacerlo, primero deberás instalar el paquete que te dará los recursos necesarios: <a href=\"https://readxl.tidyverse.org/\">readxl</a>[^4]. Este paquete es parte de la colección de paquetes conocida como <a href=\"https://www.tidyverse.org/\">Tidyverse</a>[^5], una de las más utilizados para el tipo de análisis que te proponemos, ya que permite realizar fácilmente tareas tales como leer, transformar, tratar, manipular, organizar y visualizar distinto tipo de datos. Además de <em>readxl</em>, contiene varios de los paquetes que necesitarás más adelante.</p>\n<pre><code class=\"language-R\">install.packages(&quot;tidyverse&quot;)\n</code></pre>\n<p>A continuación, debes cargar tanto el paquete <em>readxl</em> como el paquete <em>tidyverse</em>. Si bien el paquete <em>readxl</em> está contenido dentro de este último, es necesario cargarlo de forma independiente.</p>\n<pre><code class=\"language-R\">library(readxl)\nlibrary(tidyverse)\n</code></pre>\n<p>Ahora estás en condiciones de importar el dataset, usando la función <code>read_excel()</code>. Esta función toma como argumento el nombre del archivo donde almacenaste la hoja de cálculo, suponiendo que está en tu directorio actual de trabajo. Si no estuviese en tu directorio de trabajo, deberás indicar toda la ruta del archivo.\nEl contenido del archivo lo asignaremos a un nuevo objeto que llamaremos <code>at59</code>:</p>\n<pre><code class=\"language-R\">at59 &lt;- read_excel(&quot;atentados1959.xlsx&quot;)\n</code></pre>\n<p>Es fundamental entender en qué forma fue almacenada la información. En R todo es un objeto y, dependiendo de las características de los datos importados, corresponderá a una determinada estructura de datos. R maneja varias estructuras que se diferencian por tener distinta cantidad de dimensiones y por si pueden guardar o no datos de diverso tipo. La más conocida es el <em>vector</em>, que es una colección de una dimensión de datos de igual tipo. Otra estructura es la <em>matriz</em>, que es similar al vector, pero permite trabajar en dos dimensiones.</p>\n<p>Además, R cuenta con una forma particular de estructura de datos, la cual tiene dos dimensiones y nos da la posibilidad de contener datos de distinto tipo (enteros junto a fechas, caracteres, etcétera). Esta estructura es denominada <em>data frame</em>, y se compone por filas y columnas; cada fila corresponde a una observación o registro, mientras que cada columna es un vector que representa una variable de análisis. El <em>data frame</em> es una de las estructuras más utilizadas en <em>R</em> y los datos que importamos de hojas de cálculo se almacenarán de esta manera. Es importante tener en cuenta que muchas de las funciones del Tidyverse (como <code>read_excel()</code>) devuelven un tipo particular de <em>data frame</em> llamado <em>tibble</em>. La principal diferencia entre ambos tipos es la forma en que los datos se muestran en la consola. Los <em>tibble</em>, por ejemplo, muestran debajo del nombre de cada variable a qué tipo corresponde. Esto lo podrás apreciar al usar la función <code>head()</code>, que muestra los primeros seis registros de <code>at59</code>. Ahí se puede observar que la fecha está en formato <em>datetime</em> (fecha y hora) y el resto de las columnas son de tipo <em>character</em> (caracter).</p>\n<pre><code class=\"language-R\">&gt; head(at59)\n# A tibble: 6 x 5\n  fecha               ciudad          objeto  sitio       objetivo\n  &lt;dttm&gt;              &lt;chr&gt;           &lt;chr&gt;   &lt;chr&gt;       &lt;chr&gt;    \n1 1959-06-23 00:00:00 Almirante Brown bomba   via publica ns       \n2 1959-06-30 00:00:00 Almirante Brown bomba   domicilio   ns       \n3 1959-07-30 00:00:00 Almirante Brown bomba   domicilio   ns       \n4 1959-08-02 00:00:00 Almirante Brown bomba   domicilio   ns       \n5 1959-09-15 00:00:00 Almirante Brown bomba   taller      industria\n6 1959-01-20 00:00:00 Avellaneda      molotov comercio    comercio\n</code></pre>\n<p>Con la tabla ya cargada en <em>RStudio</em> puedes empezar el tratamimiento de los datos para poder trabajar con ellos. Así, por ejemplo, podemos partir reemplazando determinados valores de la estructura de datos para corregir o cambiar contenidos masivamente. Para tal efecto, utilizaremos la función <code>ifelse()</code>, la que te permite seleccionar elementos de una estructura de datos según se cumpla o no alguna condición. Esta función aprovecha la vectorialización del lenguaje R y permite que, al aplicar una función a un objeto, esta lo haga sobre todos sus elementos. Así, se evita la necesidad de utilizar bucles (<code>for</code> o <code>while</code>, por ejemplo) para recorrer las filas. Lo recomendable es que hagas estas operaciones sobre los datos antes de realizar alguna conversión sobre su tipo.</p>\n<p>Supón que deseas reemplazar todos los casos donde el <em>objeto</em> figura como ‘bomba’, por el término ‘explosivo’. Para tal efecto puedes utilizar la función <code>ifelse()</code> pasándole solo tres argumentos. Primero se indica la condición a cumplir, en este caso, los valores ‘bomba’ de la columna <em>objeto</em> de <em>at59</em>, que es seleccionada con el símbolo <code>$</code>. El segundo argumento corresponde a lo que la función asignará en el caso de que la condición se cumpla: lo reemplazará por ‘explosivo’. El tercer argumento es el valor asignado en el caso negativo. En este caso mantendrás el valor original:</p>\n<pre><code class=\"language-R\">at59$objeto &lt;- ifelse(at59$objeto == &quot;bomba&quot;, &quot;explosivo&quot;, at59$objeto)\n</code></pre>\n<p>Si te llegases a arrepentir de los cambios, puedes hacer la misma operación pero a la inversa:</p>\n<pre><code class=\"language-R\">at59$objeto &lt;- ifelse(at59$objeto == &quot;explosivo&quot;, &quot;bomba&quot;, at59$objeto)\n</code></pre>\n<p>A continuación, sería conveniente transformar los <em>tipos</em> de variables. En este caso, los cambios te permitirán aprovechar mejor las funciones de visualización. Primero, como no interesa que las fechas tengan además la hora, puedes adecuar esa variable utilizando la función <code>as.Date()</code> sobre la columna <em>fecha</em>. Segundo, puedes transformar el resto de las variables de análisis a <em>factores</em>, que es el tipo de dato que brinda <em>R</em> para trabajar con <em>variables categóricas</em>, es decir, aquellas que representan un conjunto fijo y conocido de valores posibles. A continuación deberías hacer algo idéntico con cada una las cuatro columnas restantes (<em>ciudad</em>, <em>objeto</em>, <em>sitio</em> y <em>objetivo</em>) y aplicarles la función <code>factor()</code>. En principio, esto implicaría escribir cinco sentencias (una por cada variable): <code>variable &lt;- factor(variable)</code>. Si te interesa practicar escritura de código prolijo, uno de sus preceptos apunta a evitar la repetición de sentencias si no son necesarias y aprovechar el potencial que brinda el lenguaje que estemos utilizando para resolverlo. En el caso de R puedes hacerlo utilizando funciones que permiten aplicar de manera generalizada otras funciones a una estructura de datos.</p>\n<p>Entre diversas opciones, te invitamos a usar a <code>map_df()</code> del paquete <em>purrr</em>[^6], que es también parte del Tidyverse. <code>map_df()</code> te permite asignar una función -que en este caso será para cambiar el tipo de datos- a diversos elementos de un <em>data frame</em> y almacenar el resultado en un objeto de esta misma clase. Como argumentos de la función, se indica en primer término el nombre de las columnas -en un formato vectorizado con <code>c()</code>- y luego la función que quieres aplicar a dichas columnas.\nPara unir el código de ambas transformaciones en una solo una sentencia, puedes utlizar la función <code>tibble()</code>. Esto te dará como resultado un <em>tibble</em> con las columnas convertidas y organizadas tal como estaban originalmente:</p>\n<pre><code class=\"language-R\">at59 &lt;- tibble(map_df(at59[,c(&quot;fecha&quot;)], as.Date), map_df(at59[,c(&quot;ciudad&quot;, &quot;objeto&quot;, &quot;sitio&quot;,&quot;objetivo&quot;)], factor))\n</code></pre>\n<p>Para finalizar esta etapa de limpieza y transformación de los datos, es necesario ordenarlos cronológicamente. Para ello dispones de la función <code>arrange()</code>, del paquete <em>dplyr</em>[^7], tambien parte del Tidyverse, que te permitirá reordenar las filas del <em>data frame</em>. Por defecto lo hace de forma ascendente, aunque, al igual que la mayoría de las funciones en R, es parametrizable y nos permite variaciones. En este caso, el orden ascendente es pertinente, así que no podrás utilizar la función directamente. El primer argumento es tu objeto de datos y el segundo la variable que se utilizará como criterio ordenador. Si lo haces por fecha deberás ingresar:</p>\n<pre><code class=\"language-R\">at59 &lt;- arrange(at59, fecha)\n</code></pre>\n<p>Con <code>head()</code> podrás apreciar cómo quedó reorganizado y listo tu conjunto de datos para que comiences, ahora, sí a analizarlo.</p>\n<pre><code class=\"language-R\"># A tibble: 6 x 5\n  fecha      ciudad     objeto  sitio     objetivo              \n  &lt;date&gt;     &lt;fct&gt;      &lt;fct&gt;   &lt;fct&gt;     &lt;fct&gt;                 \n1 1959-01-18 La Plata   bomba   sede      institucion extranjera\n2 1959-01-19 La Plata   petardo vias ffcc ferrocarril           \n3 1959-01-19 Matanza    bomba   vias ffcc ferrocarril           \n4 1959-01-20 Avellaneda molotov comercio  comercio              \n5 1959-01-20 Avellaneda bomba   vias ffcc ferrocarril           \n6 1959-01-20 Lomas      bomba   vias ffcc ferrocarril\n</code></pre>\n<h1 id=\"explorando-los-datos\">Explorando los datos</h1>\n<p>A continuación realizaremos un análisis exploratorio básico de nuestros datos históricos, con el fin de encontrar relaciones entre los casos de atentados incluidos en el dataset. La idea de este tipo de metodología es identificar las principales características de un conjunto de datos (patrones, diferencias, tendencias, anomalías, discontinuidades y distribuciones) con el objetivo de conocer su variabilidad. Al representar dicha variabilidad de manera numérica, y sobre todo en forma de gráficos y visualizaciones, el análisis exploratorio de datos se transforma en un medio para desarrollar nuevas perspectivas analíticas, preguntas o hipótesis: con una breve mirada podemos estar al tanto de concentraciones de datos, valores atípicos, saltos, etcétera.</p>\n<p>Con nuestra base de datos vamos a trabajar con una de las formas primarias en que se manifiesta la variabilidad en la información: la distribución de frecuencias. Lo haremos en modo bivariado, es decir, veremos cómo se pueden construir tablas de contingencia que contabilicen los casos resultantes del cruce de dos variables dentro del conjunto de los atentados efectuados durante 1959.</p>\n<p>Para tal efecto, cuentas con una sencilla función denominada <code>table()</code>, que toma variables tipo factor como parámetros y regresa la frecuencia de aparición de las categorías de la variable. Un aspecto interesante de esta función es que también te permite pasarle una sola columna como argumento. Por ejemplo, si quieres saber cuántos atentados hay por ciudad puedes conocer la cifra con la sentencia:</p>\n<pre><code class=\"language-R\">table(at59$ciudad)\n\nAlmirante Brown      Avellaneda        La Plata           Lomas         Matanza\n              5              54              52               9              14\n</code></pre>\n<p>Si quieres empezar a probar las capacidades gráficas que te da R base, puedes transformar esa tabla de una dimensión en un gráfico de barras, con una función llamada <code>barplot()</code>:</p>\n<pre><code class=\"language-R\">barplot(table(at59$ciudad))\n</code></pre>\n<p>El gráfico resultante (Figura 2) aparecerá en la pestaña <em>Plots</em> de la ventana de utilidades.</p>\n<p>{% include figure.html filename=&quot;visualizacion-y-animacion-de-tablas-historicas-con-R2.png&quot; caption=&quot;Figura 2. Gráfico de barras que muestra la frecuencia de atentados por ciudad. En este caso, Avellaneda y La Plata concentran la mayor cantidad de atentados.&quot; %}</p>\n<p>Para analizar posibles relaciones entre variables y categorías, puedes confeccionar una tabla de contingencia. Para ello, a la función <code>table()</code> debes aplicas como argumento las dos columnas que te interesa cruzar. Por ejemplo, si quieres saber con qué tipo de elementos u objetos se efectuaron los atentados, según la ciudad de ocurrencia del hecho, deberías ingresar a la consola:</p>\n<pre><code class=\"language-R\">table(at59$ciudad, at59$objeto)\n</code></pre>\n<p>Obtendrás como resultado la siguiente tabla:</p>\n<pre><code class=\"language-R\">\n\n\n                  alquitran bomba armas de fuego bomba liquido inflamable molotov petardo proyectil\n  Almirante Brown               0              0     5                  0       0       0         0\n  Avellaneda                    1              0    40                  1       5       7         0\n  La Plata                      2              1    37                  0       4       7         1\n  Lomas                         0              1     5                  2       1       0         0\n  Matanza                       0              0    12                  0       2       0         0\n</code></pre>\n<p>Existen muchas formas de hacer más amigable la visualización de tablas de contingencia utilizando paquetes disponibles en CRAN. Una que, sin ser complicada, te dará unos cuadros mejorados estéticamente es <a href=\"https://cran.r-project.org/web/packages/kableExtra/vignettes/awesome_table_in_html.html\">kableExtra</a>[^8]. El procedimiento tiene dos partes. Primero, debes darle formato html a la tabla con la función <code>kable()</code> y almacenarla en una variable (por ejemplo <code>at59k</code>). Luego,  debes usar ese objeto como argumento de la función <code>kable_styling()</code>, lo que te permitirá visualizar la tabla y manejar varios atributos de estilo, tales como el tamaño y color de la fuente tipográfica. Dicho esto, prueba instalar, cargar y probar ese paquete, y aprovechar de agregar un título a tu tabla con el argumento <code>caption</code>:</p>\n<pre><code class=\"language-R\">install.packages(&quot;kableExtra&quot;)\nlibrary(kableExtra)\n\nat59k &lt;- kable(table(at59$ciudad, at59$objeto), caption = &quot;Objeto vinculado al atentado por ciudad&quot;)\n\nkable_styling(at59k, font_size = 10)\n</code></pre>\n<p>El resultado aparecerá en <em>Viewer</em> y tendrás la posibilidad de guardarlo como imagen o como código html, por medio de la pestaña <em>Export</em>.</p>\n<p>{% include figure.html filename=&quot;visualizacion-y-animacion-de-tablas-historicas-con-R3.png&quot; caption=&quot;Figura 3. La misma tabla de contingencia creada anteriormente, pero con el formato dado por el paquete kableExtra.&quot; %}</p>\n<h1 id=\"visualizando-tablas-con-ggplot2\">Visualizando tablas con ggplot2</h1>\n<p>Como te hemos mostrado con las tablas generadas en esta lección, R se destaca por su capacidad para ilustrar conjuntos de datos. El paquete <a href=\"https://ggplot2.tidyverse.org/\">ggplot2</a>[^9] es uno de los más usados para hacer gráficas por quienes utilizan este lenguaje de programación. Tiene una lógica inspirada en la denominada gramática de los gráficos (<em>grammar of graphics</em>)[^10], la que consiste en el uso de capas o <em>layers</em>, que se ajustan según determinados parámetros. Un gráfico es la combinación de las capas, donde cada una cumple una función determinada sobre los datos, sus aspectos estéticos (tamaño, forma, color, etc.), los objetos geométricos que van a representar los datos (puntos, líneas, polígonos, áreas, etc.). Estas tres capas (datos, parámetros estéticos y representación geométrica) son esenciales, es decir, no pueden faltar. Opcionalmente, es posible modificar los valores por defecto de otras capas, que te permitirán facetar los datos en subgrupos, modificar el tipo de coordenadas, usar funciones estadísticas y modificar la apariencia general del gráfico. El paquete <em>ggplot2</em> está incluido en el Tidyverse y se carga cuando ejecutas <code>library(tidyverse)</code>, por lo tanto, no necesitas realizar ninguna instalación adicional.</p>\n<p>En términos abstractos, una sentencia básica de esta gramática de gráficos tiene la siguiente estructura: <code>ggplot(datos, variables) + función geométrica</code>. Los datos corresponden al objeto de datos que contiene las variables que queremos visualizar y que para <em>ggplot2</em> debe estar en formato <em>data frame</em>. Las variables se interpretan aquí como los parámetros estéticos (<code>aes</code>) en que serán representadas las columnas elegidas (por ejemplo, posición en los ejes x e y, tamaño, color). La función geométrica (<code>geom</code>) nos permite elegir el objeto visual con el que se representarán los datos. Como es una lógica de capas, el signo <code>+</code> permite ir agregando todas las que consideres necesarias para que tu gráfico incluya los elementos que consideres relevante.</p>\n<p>Si deseas ver gráficamente la tabla de contingencia que construiste anteriormente, puedes empezar haciendo la equivalencia de un atentado = un punto en el plano, a lo que correspondería la sentencia mínima:</p>\n<pre><code class=\"language-R\">ggplot(at59, aes(x = ciudad, y = objeto)) +\ngeom_point()\n</code></pre>\n<p>Con el código anterior obtendrás un resultado similar al de la Figura 4.</p>\n<p>{% include figure.html filename=&quot;visualizacion-y-animacion-de-tablas-historicas-con-R4.png&quot; caption=&quot;Figura 4. Gráfico de puntos que muestra el cruce de las variables objeto y ciudad.&quot; %}</p>\n<p>Sin embargo, debe reconocerse que la acumulación de puntos, uno sobre otro, en una misma coordenada (fenómeno conocido como <em>overplotting</em>), da como resultado una visualización muy poco aprovechable, ya que, a diferencia de la tabla, no logra representar las frecuencias. Solo muestra la existencia de cruces de variables, no cuántas veces ocurren. En casos como este, es recomendable reemplazar la función <code>geom_point()</code> por otra que contabilice el número de ocurrencias de cada combinación, para obtener una imagen que te dé una pista rápida sobre las variaciones en la frecuencia de los atentados. Para ello está disponible <code>geom_count()</code>, que además del efecto visual, añade al gráfico una escala de frecuencias.</p>\n<p>Si te interesa, además, enriquecer la visualización mediante la adición de etiquetas al gráfico (ponerle un título, cambiar los nombres de las variables en los ejes, etcétera), puedes agregar una capa adicional con la función <code>labs()</code>. Incluso, puedes cambiar la apariencia general si agregas una capa con alguna de las variantes que te proveen las funciones <code>theme_()</code>, que permiten controlar los elementos del gráfico que no son datos. Obtendrás un resultado similar al de la Figura 5.</p>\n<pre><code class=\"language-R\">ggplot(at59, aes(x = ciudad, y = objeto)) +\ngeom_count() +\nlabs(title = &quot;Atentados durante 1959&quot;, subtitle = &quot;Objeto utilizado según ciudad&quot;, x = &quot;CIUDAD&quot;, y = &quot;OBJETO&quot;) +\ntheme_bw()\n</code></pre>\n<p>{% include figure.html filename=&quot;visualizacion-y-animacion-de-tablas-historicas-con-R5.png&quot; caption=&quot;Figura 5. Gráfico de puntos que representa la frecuencia de atentados, según objeto y ciudad. El tamaño de los puntos depende del recuento de combinaciones entre objeto del atentado y ciudad. Se advierte que las ciudades de Avellaneda y La Plata concentran la mayor cantidad de atentados, y que en la mayoría de estos se utilizaron explosivos.&quot; %}</p>\n<p>Para almacenar el gráfico en un archivo, cuentas con la función <code>ggsave()</code>, que guardará tu imagen en tu directorio de trabajo:</p>\n<pre><code class=\"language-R\">ggsave(&quot;nombre-archivo.png&quot;)\n</code></pre>\n<p>Otra forma de aprovechar las ventajas de visualización que te da R y evitar la superposición de puntos, es utilizando la propiedad <em>jitter</em>, que afecta la posición de los mismos. La función gráfica <code>geom_jitter()</code> te permite agregar una pequeña variación aleatoria a la ubicación de cada punto; esto es muy útil si trabajas posiciones discretas y conjuntos de datos pequeños. Para explorar otras capacidades estéticas, prueba, por ejemplo, aplicar como parámetro que el color de los puntos sea diferente según la ciudad, mediante el argumento <code>colour</code>. Como el argumento debe estar en formato numérico, debes convertirlo con <code>as.numeric()</code>. Además de establecer la coloración, tienes la posibilidad de manipular el tamaño de los puntos mediante el argumento <code>size</code>, su transparencia con <code>alpha</code> y la distancia interpuntos vertical u horizontal con <code>width</code> o <code>height</code>. Obtendrás un gráfico similar al de la Figura 6.</p>\n<pre><code class=\"language-R\">ggplot(at59, aes(x = ciudad, y = objeto)) +\ngeom_jitter(colour = as.numeric(at59$ciudad), size = 3) +\nlabs(title = &quot;Atentados durante 1959&quot;, subtitle = &quot;Objeto utilizado según ciudad&quot;, x = &quot;CIUDAD&quot;, y = &quot;OBJETO&quot;) +\ntheme_bw()\n</code></pre>\n<p>{% include figure.html filename=&quot;visualizacion-y-animacion-de-tablas-historicas-con-R6.png&quot; caption=&quot;Figura 6. Gráfico que resulta de aplicar la función geom_jitter(). Permite visualizar la misma tendencia que el gráfico anterior (mayor cantidad de explosivos en Avellaneda y La Plata), pero asignando un punto por cada combinación objeto/ciudad evitando su superposición.&quot; %}</p>\n<h1 id=\"animando-la-visualización-de-los-datos-con-gganimate\">Animando la visualización de los datos con gganimate</h1>\n<p>Si bien existen distintos paquetes para animar visualizaciones en R, te invitamos a hacerlo con <a href=\"https://gganimate.com/\">gganimate</a>[^11], que es una extensión del paquete <em>ggplot2</em> que te permitirá crear una animación a partir de un gráfico <em>ggplot</em> y ver de forma dinámica cómo tus datos evolucionan según estados o en el tiempo. Las funciones centrales de <em>gganimate</em> son las para transiciones (<code>transition_*()</code>), que permiten especificar cómo los datos deben interpretarse en términos de la su animación, es decir, según qué criterio se crearán los cuadros (<em>frames</em>) que se animarán.</p>\n<p>Para instalar y activar el paquete puedes utilizar el código que se presenta a continuación. Si estás trabajando en Mac, te sugerimos instalar también la última versión del paquete <em>gifski</em>. Algunas personas han reportado problemas al generar las animaciones cuando utilizan una versión anterior a la 0.8.6.</p>\n<pre><code class=\"language-R\">install.packages(&quot;gganimate&quot;)\nlibrary (gganimate)\n\n# Si trabajas en Mac y tu versión de gifski es anterior a 0.8.6\ninstall.packages(&quot;gifski&quot;)\n</code></pre>\n<p>Si deseas generar una animación que represente la ocurrencia de atentados según una progresión temporal, la función indicada es <code>transiton_time()</code>. El procedimiento es muy sencillo; al código que escribiste para hacer el gráfico le sumas esta función, poniendo como argumento la variable temporal, en este caso, <em>fecha</em>. Sin embargo, con el fin de realizar una visualización más clara de tus datos, es conveniente que al código le agregues un par de elementos.</p>\n<p>Por un lado, como en <em>gganimate</em> la animación resultante es un conjunto de imágenes (instantáneas) desplegadas en serie consecutiva, cada nuevo <em>frame</em> -si no le indicas lo contrario- al mostrarse oculta el anterior y sólo lograrás ver puntos parpadeando. Para manejar esto, cuentas con el grupo de funciones <em>shadow</em>, que te deja elegir cómo se muestran los datos que ya no se corresponden con los del <em>frame</em> actual. En el caso de este gráfico, para que permanezcan todos los datos anteriores de fondo, es necesario utilizar <code>shadow_mark(past = TRUE)</code>, que te permite dejar visibles los cuadros ya mostrados.\nPor otra parte, como puede ser bastante difícil entender una animación sin ninguna indicación sobre el significado de cada punto temporal, <em>gganimate</em> te proporciona un conjunto de variables para cada fotograma (<em>frame variables</em>), los cuales puedes insertar en las etiquetas de los gráficos utilizando la sintaxis propia del paquete <em>glue</em>, que utiliza los símbolos <code>{}</code>. Con ello dispondrás de una serie de metadatos, según la variante de transición que ensayes. Para <code>transition_time()</code> cuentas con <code>{frame_time}</code>, que te retornará el valor del argumento que procesa la función durante el fotograma en curso, es decir, te permitirá ir viendo la fecha correspondiente. El código quedaría de esta manera:</p>\n<pre><code class=\"language-R\">ggplot(at59, aes(x = ciudad, y = objeto)) +\ngeom_jitter(colour = as.numeric(at59$ciudad), size = 4) +\nlabs(title = &quot;Atentados durante 1959&quot;, subtitle = &quot;Objeto utilizado según ciudad - Fecha: {frame_time}&quot;, x = &quot;CIUDAD&quot;, y = &quot;OBJETO&quot;) +\ntheme_bw() +\ntransition_time(fecha) +\nshadow_mark(past = TRUE)\n</code></pre>\n<p>Al ingresar el código directamente en la consola, comienza el proceso de generación de la animación, denominado <em>rendering</em>. Este proceso tiene una duración relativa, dependiendo del volumen de los datos y de tu procesado. En este caso sólo debería tomar unos segundos, durante los cuales podrás ver una barra de progreso que te indicará cuánto falta. Cuando concluya, en la pestaña <em>Viewer</em> de la ventana de utilidades podrás observar la animación. Si presionas el ícono <em>Show in new window</em>, se abrirá un <em>gif</em> en tu navegador asociado por defecto, desde donde podrás almacenarlo. En caso de que te interese continuar practicando con la consola, también puedes almacenarlo con la función <code>anim_save()</code>, que guarda la última animación realizada en tu directorio de trabajo:</p>\n<pre><code class=\"language-R\">anim_save(&quot;nombre-archivo.gif&quot;)\n</code></pre>\n<p>Para poder explorar más posibilidades del paquete <em>gganimate</em>, la sugerencia es que asignes el bloque de código para generar el gráfico a un objeto. Esto te dará la posibilidad de manejar parámetros como la velocidad y las pausas en la animación por medio de la función <code>animate()</code>. Con ella podrás ajustar también la cantidad total de <em>frames</em>, la duración total y los <em>frames</em> por segundo. Para ensayarlo, dale a <code>fps</code> un parámetro de 5 cuadros por segundo y añade una pausa final de 15 segundos con <code>end_pause</code>. Con ello obtendrás una animación similar a la Figura 7.</p>\n<pre><code class=\"language-R\">atentados &lt;- ggplot(at59, aes(x = ciudad, y = objeto)) +\ngeom_jitter(colour = as.numeric(at59$ciudad), size = 4) +\nlabs(title = &quot;Atentados durante 1959&quot;, subtitle = &quot;Objeto utilizado según ciudad - Fecha: {frame_time}&quot;, x = &quot;CIUDAD&quot;, y = &quot;OBJETO&quot;) +\ntheme_bw() +\ntransition_time(fecha) +\nshadow_mark(past = TRUE)\n\nanimate(atentados, fps = 5, end_pause = 15)\n</code></pre>\n<p>{% include figure.html filename=&quot;visualizacion-y-animacion-de-tablas-historicas-con-R7.gif&quot; caption=&quot;Figura 7. Versión animada del gráfico creado con la función geom_jitter.&quot; %}</p>\n<p>A esta altura y con estos resultados, puedes considerar que has realizado un análisis exploratorio de tus datos y estás en condiciones de plantear hipótesis al respecto. En el caso trabajado, y si te dedicas a la historia de las luchas sociales y políticas en Argentina contemporánea, las tablas de contingencia y los gráficos estáticos trabajadas en esta lección, por ejemplo, te permiten encontrar similitudes entre Avellaneda y La Plata, tanto entre las frecuencias de los atentados, como en su tipo (en términos del objeto utilizado). Además, disponemos del ritmo temporal (intensidad) de los mismos, lo que te invita a enfocar sobre posibles patrones o relaciones de corte más histórico, entre casos que no suelen estar conectados en las investigaciones, por su diferente estructura socio-económica para la época.</p>\n<h1 id=\"conclusión\">Conclusión</h1>\n<p>Esta lección buscó darte una idea general de las diversas tareas que deberías seguir para preparar y llevar adelante un primer análisis exploratorio de datos sobre alguna serie de documentos históricos. Este procedimiento te permite realizar cálculos básicos con esos datos y analizarlos visualmente para pensar, generar preguntas e hipotetizar a partir de ellos.</p>\n<p>En esta lección te hemos ofrecido solo un punto de partida para el análisis de tus tablas históricas. Como desafío, y a partir de lo que aprendiste en este tutorial, te proponemos que continúes probando otros cruces de variables. Finalmente, te invitamos a que te animes a descubrir por ti mismo la potencia de <em>ggplot</em> y <em>gganimate</em>, explorando <a href=\"https://gganimate.com/index.html\">la documentación</a> de este último paquete para conocer otras opciones disponibles.</p>\n<h1 id=\"notas\">Notas</h1>\n<p>[^1]: Roderick Floud, <em>Métodos cuantitativos para historiadores</em> (Madrid: Alianza, 1983).</p>\n<p>[^2]: Puedes encontrar una detallada referencia del archivo en el sitio de la Comisión Provincial por la Memoria de la provincia de Buenos Aires: <a href=\"https://www.comisionporlamemoria.org/extra/archivo/cuadroclasificacion/\">https://www.comisionporlamemoria.org/extra/archivo/cuadroclasificacion/</a></p>\n<p>[^3]:Los fundamentos y significado de la noción de &quot;datos ordenados&quot; puedes encontrarlos en: Hadley Wickham, &quot;Tidy Data&quot;, <em>Journal of Statistical Software</em>, Volume 59, Issue 10, 2019,<a href=\"https://www.jstatsoft.org/index.php/jss/article/view/v059i10/v59i10.pdf\">https://www.jstatsoft.org/index.php/jss/article/view/v059i10/v59i10.pdf</a>)</p>\n<p>[^4]: Hadley Wickham and Jennifer Bryan, &quot;readxl: Read Excel Files. R package version 1.3.1&quot;, 2019, <a href=\"https://CRAN.R-project.org/package=readxl\">https://CRAN.R-project.org/package=readxl</a></p>\n<p>[^5]: Hadley Wickham et al.,&quot;Welcome to the tidyverse&quot;, <em>Journal of Open Source Software</em>, 4(43), 1686 (2019): 1-5, <a href=\"https://doi.org/10.21105/joss.01686\">https://doi.org/10.21105/joss.01686</a></p>\n<p>[^6]: Lionel Henry and Hadley Wickham, &quot;purrr: Functional Programming Tools. R package version 0.3.4&quot;, 2020, <a href=\"https://CRAN.R-project.org/package=purrr\">https://CRAN.R-project.org/package=purrr</a></p>\n<p>[^7]: Hadley Wickham, Romain François, Lionel Henry and Kirill Müller, &quot;dplyr: A Grammar of Data Manipulation. R package version 1.0.6&quot;, CRAN R Project, 2021, <a href=\"https://CRAN.R-project.org/package=dplyr\">https://CRAN.R-project.org/package=dplyr</a></p>\n<p>[^8]: Hao Zhu, &quot;kableExtra: Construct Complex Table with &#39;kable&#39; and Pipe Syntax. R package version 1.3.2&quot;, 2021, <a href=\"https://CRAN.R-project.org/package=kableExtra\">https://CRAN.R-project.org/package=kableExtra</a></p>\n<p>[^9]: Hadley Wickham, &quot;ggplot2: Create Elegant Data Visualisations Using the Grammar of Graphics&quot;, Springer-Verlag New York, 2016, <a href=\"https://ggplot2.tidyverse.org\">https://ggplot2.tidyverse.org</a></p>\n<p>[^10]: El referente del concepto es Leland Wilkinson, con su obra <em>The Grammar of Graphics</em>, de la que puedes consultar algunas páginas en: <a href=\"https://www.springer.com/gp/book/9780387245447\">https://www.springer.com/gp/book/9780387245447</a></p>\n<p>[^11]: Thomas Lin Pedersen and David Robinson, &quot;gganimate: A Grammar of Animated Graphics. R package version 1.0.7&quot;, 2020, <a href=\"https://CRAN.R-project.org/package=gganimate\">https://CRAN.R-project.org/package=gganimate</a></p>\n"}