{"metadata":{"title":"Text Mining in Python through the HTRC Feature Reader","authors":["Peter Organisciak","Boris Capitanu"],"date":"2016-11-22T00:00:00.000Z","reviewers":["Stéfan Sinclair","Catherine DeRose"],"editors":["Ian Milligan"],"layout":"lesson","activity":"analyzing","topics":["distant-reading"],"difficulty":3,"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/29","abstract":"Explains how to use Python to summarize and visualize data on millions of texts from the HathiTrust Research Center's Extracted Features dataset.\n","redirect_from":"/lessons/text-mining-with-extracted-features","mathjax":true,"avatar_alt":"A book inside a torn case","doi":"10.46430/phen0058"},"html_body":"<p>{% include toc.html %}</p>\n<p>Summary: <em>We introduce a toolkit for working with the 13.6 million volume Extracted Features Dataset from the HathiTrust Research Center. You will learn how to peer at the words and trends of any book in the collection, while developing broadly useful Python data analysis skills.</em></p>\n<p>The <a href=\"https://www.hathitrust.org\">HathiTrust</a> holds nearly 15 million digitized volumes from libraries around the world. In addition to their individual value, these works in aggregate are extremely valuable for historians. Spanning many centuries and genres, they offer a way to learn about large-scale trends in history and culture, as well as evidence for changes in language or even the structure of the book. To simplify access to this collection the HathiTrust Research Center (HTRC) has released the Extracted Features dataset (Capitanu et al. 2015): a dataset that provides quantitative information describing every page of every volume in the collection.</p>\n<p>In this lesson, we introduce the HTRC Feature Reader, a library for working with the HTRC Extracted Features dataset using the Python programming language. The HTRC Feature Reader is structured to support work using popular data science libraries, particularly Pandas. Pandas provides simple structures for holding data and powerful ways to interact with it. The HTRC Feature Reader uses these data structures, so learning how to use it will also cover general data analysis skills in Python.</p>\n<p>Today, you&#39;ll learn:</p>\n<ul>\n<li>How to work with <em>notebooks</em>, an interactive environment for data science in Python;</li>\n<li>Methods to read and visualize text data for millions of books with the HTRC Feature Reader; and</li>\n<li>Data malleability, the skills to select, slice, and summarize extracted features data using the flexible &quot;DataFrame&quot; structure.</li>\n</ul>\n<h2 id=\"background\">Background</h2>\n<p>The <strong>HathiTrust Research Center</strong> (<strong>HTRC</strong>) is the research arm of the HathiTrust, tasked with supporting research usage of the works held by the HathiTrust. Particularly, this support involves mediating large-scale access to materials in a non-consumptive manner, which aims to allow research over a work without enabling that work to be traditionally enjoyed or read by a human reader.  Huge digital collections can be of public benefit by allowing scholars to discover insights about history and culture, and the non-consumptive model allows for these uses to be sought within the restrictions of intellectual property law.</p>\n<p>As part of its mission, the HTRC has released the <strong>Extracted Features</strong> (<strong>EF</strong>) dataset containing features derived for every page of 13.6 million &#39;volumes&#39; (a generalized term referring to the different types of materials in the HathiTrust collection, of which books are the most prevalent type).</p>\n<p>What is a feature? A <strong>feature</strong> is a quantifiable marker of something measurable, a datum. A computer cannot understand the meaning of a sentence implicitly, but it can understand the counts of various words and word forms, or the presence or absence of stylistic markers, from which it can be trained to better understand text. Many text features are non-consumptive in that they don&#39;t retain enough information to reconstruct the book text.</p>\n<p>Not all features are useful, and not all algorithms use the same features. With the HTRC EF Dataset, we have tried to include the most generally useful features, as well as adapt to scholarly needs. We include per-page information such as counts of words tagged by part of speech (e.g. <em>how many times does the word <code>jaguar</code> appear as a lowercase noun on this page</em>), line and sentence counts, and counts of characters at the leftmost and rightmost sides of a page. No positional information is provided, so the data would not specify if &#39;brown&#39; is followed by &#39;dog&#39;, though the information is shared for every single page, so you can at least infer how often &#39;brown&#39; and &#39;dog&#39; occurred in the same general vicinity within a text.</p>\n<p>Freely accessible and preprocessed, the Extracted Features dataset offers a great entry point to programmatic text analysis and text mining. To further simplify beginner usage, the HTRC has released the HTRC Feature Reader. The <strong>HTRC Feature Reader</strong> scaffolds use of the dataset with the Python programming language.</p>\n<p>This tutorial teaches the fundamentals of using the Extracted Features dataset with the HTRC Feature Reader. The HTRC Feature Reader is designed to make use of data structures from the most popular scientific tools in Python, so the skills taught here will apply to other settings of data analysis. In this way, the Extracted Features dataset is a particularly good use case for learning more general text analysis skills. We will look at data structures for holding text, patterns for querying and filtering that information, and ways to summarize, group, and visualize the data.</p>\n<h2 id=\"possibilities\">Possibilities</h2>\n<p>Though it is relatively new, the Extracted Features dataset is already seeing use by scholars, as seen on a <a href=\"https://wiki.htrc.illinois.edu/display/COM/Extracted+Features+in+the+Wild\">page collected by the HTRC</a>.</p>\n<p><a href=\"https://doi.org/10.6084/m9.figshare.1279201\">Underwood</a> leveraged the features for identifying genres, such as fiction, poetry, and drama (2014). Associated with this work, he has released a dataset of 178k books classified by genre alongside genre-specific word counts (<a href=\"https://doi.org/10.13012/J8JW8BSJ\">Underwood 2015</a>).</p>\n<p>The Underwood subset of the Extracted Features dataset was used by Forster (2015) to <a href=\"http://cforster.com/2015/09/gender-in-hathitrust-dataset/\">observing gender in literature</a>, illustrating the decline of woman authors through the 19th century.</p>\n<p>The Extracted Features dataset also underlies higher-level analytic tools. <a href=\"http://mimno.infosci.cornell.edu/wordsim/nearest.html\">Mimno</a> processed word co-occurrence tables per year, allowing others to view how correlations between topics change over time (2014). The <a href=\"https://analytics.hathitrust.org/bookworm\">HT Bookworm</a> project has developed an API and visualization tools to support exploration of trends within the HathiTrust collection across various classes, genres, and languages. Finally, we have developed an approach to <a href=\"https://github.com/organisciak/htrc-book-models\">within-book topic modelling</a> which functions as a mnemonic accompaniment to a previously-read book (Organisciak 2014).</p>\n<h2 id=\"suggested-prior-skills\">Suggested Prior Skills</h2>\n<p>This lesson provides a gentle but technical introduction to text analysis in Python with the HTRC Feature Reader. Most of the code is provided, but is most useful if you are comfortable tinkering with it and seeing how outputs change when you do.</p>\n<p>We recommend a baseline knowledge of Python conventions, which can be learned with Turkel and Crymble&#39;s <a href=\"/lessons/introduction-and-installation\">series of Python lessons</a> on Programming Historian.</p>\n<p>The skills taught here are focused on flexibly accessing and working with already-computed text features. For a better understanding of the process of deriving word features, Programming Historian provides a lesson on <a href=\"/lessons/counting-frequencies\">Counting Frequencies</a>, by Turkel and Crymble.</p>\n<p>A more detailed look at text analysis with Python is provided in the <a href=\"https://github.com/sgsinclair/alta/blob/master/ipynb/ArtOfLiteraryTextAnalysis.ipynb\">Art of Literary Text Analysis</a> (Sinclair). The Art of Literary Text Analysis (ALTA) provides a deeper introduction to foundation Python skills, as well as introduces further text analytics concepts to accompany the skills we cover in this lesson. This includes lessons on extracting features (<a href=\"https://github.com/sgsinclair/alta/blob/master/ipynb/Nltk.ipynb\">tokenization</a>, <a href=\"https://github.com/sgsinclair/alta/blob/master/ipynb/RepeatingPhrases.ipynb\">collocations</a>), and <a href=\"https://github.com/sgsinclair/alta/blob/master/ipynb/GettingGraphical.ipynb\">visualizing trends</a>.</p>\n<h1 id=\"download-the-lesson-files\">Download the Lesson Files</h1>\n<p>To follow along, download <a href=\"https://github.com/programminghistorian/ph-submissions/raw/gh-pages/assets/extracted-features-lesson_files.zip\">lesson_files.zip</a> and unzip it to any directory you choose.</p>\n<p>The lesson files include a sample of files from the HTRC Extracted Features dataset. After you learn to use the feature data in this lesson, you may want to work with the entirety of the dataset. The details on how to do this are described in <a href=\"#appendix-downloading-custom-files-via-rsync\">Appendix: rsync</a>.</p>\n<h2 id=\"installation\">Installation</h2>\n<p>For this lesson, you need to install the HTRC Feature Reader library for Python alongside the data science libraries that it depends on.</p>\n<p>For ease, this lesson will focus on installing Python through a scientific distribution called Anaconda. Anaconda is an easy-to-install Python distribution that already includes most of the dependencies for the HTRC Feature Reader.</p>\n<p>To install Anaconda, download the installer for your system from the <a href=\"https://www.continuum.io\">Anaconda download page</a> and follow their instructions for installation of either the Windows 64-bit Graphical Installer or the Mac OS X 64-bit Graphical Installer. You can choose either version of Python for this lesson. If you have followed earlier lessons on Python at the <em>Programming Historian</em>, you are using Python 2, but the HTRC Feature Reader also supports Python 3.</p>\n<p>{% include figure.html filename=&quot;conda-install.PNG&quot; caption=&quot;Conda Install&quot; %}</p>\n<h3 id=\"installing-the-htrc-feature-reader\">Installing the HTRC Feature Reader</h3>\n<p>The HTRC Feature Reader can be installed by command line. First open a terminal application:</p>\n<ul>\n<li><em>Windows</em>: Open &#39;Command Prompt&#39; from the Start Menu and type: <code>activate</code>.</li>\n<li><em>Mac OS/Linux</em>: Open &#39;Terminal&#39; from Applications and type <code>source activate</code>.</li>\n</ul>\n<p>If Anaconda was properly installed, you should see something similar to this:</p>\n<p>{% include figure.html filename=&quot;activating-env.PNG&quot; caption=&quot;Activating the default Anaconda environment.&quot; %}</p>\n<p>Now, you need to type one command:</p>\n<pre><code class=\"language-bash\">conda install -c htrc htrc-feature-reader\n</code></pre>\n<p>This command installs the HTRC Feature Reader and its necessary dependencies. We specify <code>-c htrc</code> so the installation command knows to find the library from the <code>htrc</code> organization.</p>\n<p>That&#39;s it! At this point you have everything necessary to start reading HTRC Feature Reader files.</p>\n<blockquote>\n<p><em>psst</em>, advanced users: You can install the HTRC Feature Reader <em>without</em> Anaconda with <code>pip install htrc-feature-reader</code>, though for this lesson you&#39;ll need to install two additional libraries <code>pip install matplotlib jupyter</code>. Also, note that not all manual installations are alike because of hard-to-configure system optimizations: this is why we recommend Anaconda. If you think your code is going slow, you should check that Numpy has access to <a href=\"http://stackoverflow.com/a/19350234/233577\">BLAS and LAPACK libraries</a> and install <a href=\"http://pandas.pydata.org/pandas-docs/version/0.15.2/install.html#recommended-dependencies\">Pandas recommended packages</a>. The rest is up to you, advanced user!</p>\n</blockquote>\n<h2 id=\"start-a-notebook\">Start a Notebook</h2>\n<p>Using Python the traditional way -- writing a script to a file and running it -- can become clunky for text analysis, where the ability to look at and interact with data is invaluable.\nThis lesson uses an alternative approach: Jupyter notebooks.</p>\n<p>Jupyter gives you an interactive version of Python (called IPython) that you can access in a &quot;notebook&quot; format in your web browser. This format has many benefits. The interactivity means that you don&#39;t need to re-run an entire script each time: you can run or re-run blocks of code as you go along, without losing your enviroment (i.e. the variables and code that are already loaded). The notebook format makes it easier to examine bits of information as you go along, and allows for text blocks to intersperse a narrative.</p>\n<p>Jupyter was installed alongside Anaconda in the previous section, so it should be available to load now.</p>\n<p>From the Start Menu (Windows) or Applications directory (Mac OS), open &quot;Jupyter notebook&quot;. This will start Jupyter on your computer and open a browser window. Keep the console window in the background, the browser is where the magic happens.</p>\n<p>{% include figure.html filename=&quot;open-notebook.PNG&quot; caption=&quot;Opening Jupyter on Windows&quot; %}</p>\n<p>If your web browser does not open automatically, Jupyter can be accessed by going to the address &quot;localhost:8888&quot; - or a different port number, which is noted in the console (&quot;The Jupyter Notebook is running at...&quot;):</p>\n<p>{% include figure.html filename=&quot;notebook-start.png&quot; caption=&quot;A freshly started Jupyter notebook instance.&quot; %}</p>\n<p>Jupyter is now showing a directory structure from your home folder. Navigate to the lesson folder where you unzipped <a href=\"https://github.com/programminghistorian/ph-submissions/raw/gh-pages/assets/extracted-features-lesson_files.zip\">lesson_files.zip</a>.</p>\n<p>In the lesson folder, open <code>Start Here.pynb</code>: your first notebook!</p>\n<p>{% include figure.html filename=&quot;notebook-hello-world.png&quot; caption=&quot;Hello world in a notebook&quot; %}</p>\n<p>Here there are instructions for editing a cell of text or code, and running it. Try editing and running a cell, and notice that it only affects itself. Here are a few tips for using the notebook as the lesson continues:</p>\n<ul>\n<li>New cells are created with the <i class=\"fa-plus fa\"> Plus</i> button in the toolbar. When not editing, this can be done by pressing &#39;b&#39; on your keyboard.</li>\n<li>New cells are &quot;code&quot; cells by default, but can be changed to &quot;Markdown&quot; (a type of text input) in a dropdown menu on the toolbar. In edit mode, you can paste in code from this lesson or type it yourself.</li>\n<li>Switching a cell to edit mode is done by pressing Enter.</li>\n<li>Running a cell is done by clicking <i class=\"fa-step-forward fa\"> Play</i> in the toolbar, or with <code>Ctrl+Enter</code> (<code>Ctrl+Return</code> on Mac OS). To run a cell and immediately move forward, use <code>Shift+Enter</code> instead.</li>\n</ul>\n<blockquote>\n<p>An example of a full-fledged notebook is included with the lesson files in <code>example/Lesson Draft.ipynb</code>.</p>\n</blockquote>\n<p>In this notebook, it&#39;s time to give the HTRC Feature Reader a try. When it is time to try some code, start a new cell with <i class=\"fa-plus fa\"> Plus</i>, and run the code with <i class=\"fa-step-forward fa\"> Play</i>. Before continuing, click on the title to change it to something more descriptive than &quot;Start Here&quot;.</p>\n<h2 id=\"reading-your-first-volume\">Reading your First Volume</h2>\n<p>The HTRC Feature Reader library has three main objects: <strong>FeatureReader</strong>, <strong>Volume</strong>, and <strong>Page</strong>.</p>\n<p>The <strong>FeatureReader</strong> object is the interface for loading the dataset files and making sense of them. The files are originally formatted in a notation called JSON (which <em>Programming Historian</em> discusses <a href=\"/lessons/json-and-jq\">here</a>) and compressed, which FeatureReader makes sense of and returns as Volume objects. A <strong>Volume</strong> is a representation of a single book or other work. This is where you access features about a work. Many features for a volume are collected from individual pages; to access Page information, you can use the <strong>Page</strong> object.</p>\n<p>Let&#39;s load two volumes to understand how the FeatureReader works. Create a cell in the already-open Jupyter notebook and run the following code. This should give you the input shown below.</p>\n<pre><code class=\"language-python\">from htrc_features import FeatureReader\nimport os\npaths = [os.path.join(&#39;data&#39;, &#39;sample-file1.json.bz2&#39;), os.path.join(&#39;data&#39;, &#39;sample-file2.json.bz2&#39;)]\nfr = FeatureReader(paths)\nfor vol in fr.volumes():\n    print(vol.title)\n</code></pre>\n<pre><code>June / by Edith Barnard Delano ; with illustrations.\nYou never know your luck; being the story of a matrimonial deserter, by Gilbert Parker ... illustrated by W.L. Jacobs.\n</code></pre>\n<p>Here, the FeatureReader is imported and initialized with file paths pointing to two Extracted Features files. The files are in a directory called &#39;data&#39;. Different systems do file paths differently: Windows uses back slashes (&#39;data\\...&#39;) while Linux and Mac OS use forward slashes (&#39;data/...&#39;). <code>os.path.join</code> is used to make sure that the file path is correctly structured, a convention to ensure that code works on these different platforms.</p>\n<p>With <code>fr = FeatureReader(paths)</code>, the FeatureReader is initialized, meaning it is ready to use. An initialized FeatureReader is holding references to the file paths that we gave it, and will load them into Volume objects when asked.</p>\n<p>Consider the last bit of code:</p>\n<pre><code class=\"language-python\">for vol in fr.volumes():\n    print(vol.title)\n</code></pre>\n<p>This code asks for volumes in a way that can be iterated through. The <code>for</code> loop is saying to <code>fr.volumes()</code>, &quot;give me every single volume that you have, one by one.&quot; Each time the <code>for</code> loop gets a volume, it starts calling it <code>vol</code>, runs what is inside the loop on it, then asks for the next one. In this case, we just told it to print the title of the volume.</p>\n<p>You may recognize <code>for</code> loops from past experience iterating through what is known as a <code>list</code> in Python. However, it is important to note that <code>fr.volumes()</code> is <em>not</em> a list. If you try to access it directly, it won&#39;t print all the volumes; rather, it identifies itself as something known as a generator:</p>\n<p>{% include figure.html filename=&quot;generator.png&quot; caption=&quot;Identifying a generator&quot; %}</p>\n<p>What is a generator, and why do we iterate over it?</p>\n<p>Generators are the key to working with lots of data. They allow you to iterate over a set of items that don&#39;t exist yet, preparing them only when it is their turn to be acted upon.</p>\n<p>Remember that there are 13.6 million volumes in the Extracted Features dataset. When coding at that scale, you need to be be mindful of two rules:</p>\n<ol>\n<li>Don&#39;t hold everything in memory: you can&#39;t. Use it, reduce it, and move on.</li>\n<li>Don&#39;t devote cycles to processing something before you need it.</li>\n</ol>\n<p>A generator simplifies such on-demand, short term usage. Think of it like a pizza shop making pizzas when a customer orders, versus one that prepares them beforehand. The traditional approach to iterating through data is akin to making <em>all</em> the pizzas for the day before opening. Doing so would make the buying process quicker, but also adds a huge upfront time cost, needs larger ovens, and necessitates the space to hold all the pizzas at once. An alternate approach is to make pizzas on-demand when customers buy them, allowing the pizza place to work with smaller capacities and without having pizzas laying around the shop. This is the type of approach that a generator allows.</p>\n<p>Volumes need to be prepared before you do anything with them, being read, decompressed and parsed. This &#39;initialization&#39; of a volume is done when you ask for the volume, <em>not</em> when you create the FeatureReader. In the above code, after you run <code>fr = FeatureReader(paths)</code>, there are are still no <code>Volume</code> objects held behind the scenes: just the references to the file locations. The files are only read when their time comes in the loop on the generator <code>fr.volumes()</code>. Note that because of this one-by-one reading, the items of a generator cannot be accessed out of order (e.g. you cannot ask for the third item of <code>fr.volumes()</code> without going through the first two first).</p>\n<h2 id=\"whats-in-a-volume\">What&#39;s in a Volume?</h2>\n<p>Let&#39;s take a closer look at what features are accessible for a Volume object. For clarity, we&#39;ll grab the first Volume to focus on, which can conveniently be accessed with the <code>first()</code> method. Any code you write can easily be run later with a <code>for vol in fr.volumes()</code> loop.</p>\n<p>Again here, start a new code cell in the same notebook that you had open before and run the following code. The FeatureReader does not need to be loaded again: it is still initialized and accessible as <code>fr</code> from earlier.</p>\n<pre><code class=\"language-python\"># Reading a single volume\nvol = fr.first()\nvol\n</code></pre>\n<pre><code>&lt;htrc_features.feature_reader.Volume at 0x1cf355a60f0&gt;\n</code></pre>\n<p>While the majority of the HTRC Extracted Features dataset is <em>features</em>, quantitative abstractions of a book&#39;s written content, there is also a small amount of metadata included for each volume. We already saw <code>Volume.title</code> accessed earlier. Other metadata attributes include:</p>\n<ul>\n<li><code>Volume.id</code>: A unique identifier for the volume in the HathiTrust and the HathiTrust Research Center.</li>\n<li><code>Volume.year</code>: The publishing date of the volume.</li>\n<li><code>Volume.language</code>: The classified language of the volume.</li>\n<li><code>Volume.oclc</code>: The OCLC control number(s).</li>\n</ul>\n<p>The volume id can be used to pull more information from other sources. The scanned copy of the book can be found from the HathiTrust Digital Library, when available, by accessing <code>http://hdl.handle.net/2027/{VOLUME ID}</code>. In the feature reader, this url is retrieved by calling <code>vol.handle_url</code>:</p>\n<pre><code class=\"language-python\">print(vol.handle_url)\n</code></pre>\n<pre><code>http://hdl.handle.net/2027/nyp.33433075749246\n</code></pre>\n<p>{% include figure.html filename=&quot;June-cover.PNG&quot; caption=&quot;Digital copy of sample book&quot; %}</p>\n<p>Hopefully by now you are growing more comfortable with the process of running code in a Jupyter notebook, starting a cell, writing code, and running the cell. A valuable property of this type of interactive coding is that there is room for error. An error doesn&#39;t cause the whole program to crash, requiring you to rerun everything from the start. Instead, just fix the code in your cell and try again.</p>\n<p>In Jupyter, pressing the &#39;TAB&#39; key will guess at what you want to type next. Typing <code>vo</code> then TAB will fill in <code>vol</code>, typing <code>Fea</code> then TAB will fill in <code>FeatureReader</code>.</p>\n<p>Auto-completion with the tab key also provides more information about what you can get from an object. Try typing <code>vol.</code> (with the period) in a new cell, then press TAB. Jupyter shows everything that you can access for that Volume.</p>\n<p>{% include figure.html filename=&quot;autocomplete.png&quot; caption=&quot;Tab Autocomplete in Jupyter&quot; %}</p>\n<p>The Extracted Features dataset does not hold all the metadata that the HathiTrust has for the book. More in-depth metadata like genre and subject class needs to be grabbed from other sources, such as the <a href=\"https://www.hathitrust.org/bib_api\">HathiTrust Bibliographic API</a>. The URL to access this information can be retrieved with <code>vol.ht_bib_url</code>.</p>\n<h2 id=\"our-first-feature-access-visualizing-words-per-page\">Our First Feature Access: Visualizing Words Per Page</h2>\n<p>It&#39;s time to access the first features of <code>vol</code>: a table of total words for every single page. These can be accessed by calling <code>vol.tokens_per_page()</code>. Try the following code.</p>\n<blockquote>\n<p>If you are using a Jupyter notebook, returning this table at the end of a cell formats it nicely in the browser. Below, you&#39;ll see us append <code>.head()</code> to the <code>tokens</code> table, which allows us to look at just the top few rows: the &#39;head&#39; of the data.</p>\n</blockquote>\n<pre><code class=\"language-python\">tokens = vol.tokens_per_page()\n# Show just the first few rows, so we can look at what it looks like\ntokens.head()\n</code></pre>\n<div>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>count</th>\n    </tr>\n    <tr>\n      <th>page</th>\n      <th></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>1</th>\n      <td>5</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>0</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>0</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>1</td>\n    </tr>\n  </tbody>\n</table>\n</div>\n\n\n\n<blockquote>\n<p>No print! We didn&#39;t call &#39;print()&#39; to make Jupyter show the table. Instead, it automatically guessed that you want to display the information from the last code line of the cell.</p>\n</blockquote>\n<p>This is a straightforward table of information, similar to what you would see in Excel or Google Spreadsheets. Listed in the table are page numbers and the count of words on each page. With only two dimensions, it is trivial to plot the number of words per page. The table structure holding the data has a <code>plot</code> method for data graphics. Without extra arguments, <code>tokens.plot()</code> will assume that you want a line chart with the page on the x-axis and word count on the y-axis.</p>\n<pre><code class=\"language-python\">%matplotlib inline\ntokens.plot()\n</code></pre>\n<p>{% include figure.html filename=&quot;draft_23_1.png&quot; caption=&quot;Output graph.&quot; %}</p>\n<blockquote>\n<p><code>%matplotlib inline</code> tells Jupyter to show the plotted image directly in the notebook web page. It only needs to be called once, and isn&#39;t needed if you&#39;re not using notebooks.</p>\n</blockquote>\n<p>On some systems, this may take some time the first time. It is clear that pages at the start of a book have fewer words per page, after which the count is fairly steady except for occasional valleys.</p>\n<p>You may have some guesses for what these patterns mean. A look at the <a href=\"http://hdl.handle.net/2027/nyp.33433074811310\">scans</a> confirms that the large valleys are often illustration pages or blank pages, small valleys are chapter headings, and the upward pattern at the start is from front matter.</p>\n<p>Not all books will have the same patterns so we can&#39;t just codify these correlations for millions of books. However, looking at this plot makes clear an inportant assumption in text and data mining: that there are patterns underlying even the basic statistics derived from a text. The trick is to identify the consistent and interesting patterns and teach them to a computer.</p>\n<h3 id=\"understanding-dataframes\">Understanding DataFrames</h3>\n<p>Wait... how did we get here so quickly!? We went from a volume to a data visualization in two lines of code. The magic is in the data structure used to hold our table of data: a DataFrame.</p>\n<p>A <strong>DataFrame</strong> is a type of object provided by the data analysis library, Pandas. <strong>Pandas</strong> is very common for data analysis, allowing conveniences in Python that are found in statistical languages like R or Matlab.</p>\n<p>In the first line, <code>vol.tokens_per_page()</code> returns a DataFrame, something that can be confirmed if you ask Python about its type with <code>type(tokens)</code>. This means that <em>after setting <code>tokens</code>, we&#39;re no longer working with HTRC-specific code, just book data held in a common and very robust table-like construct from Pandas</em>. <code>tokens.head()</code> used a DataFrame method to look at the first few rows of the dataset, and <code>tokens.plot()</code> uses a method from Pandas to visualize data.</p>\n<p>Many of the methods in the HTRC Feature Reader return DataFrames. The aim is to fit into the workflow of an experienced user, rather than requiring them to learn proprietary new formats. For new Python data mining users, learning to use the HTRC Feature Reader means learning many data mining skills that will translate to other uses.</p>\n<h2 id=\"loading-a-token-list\">Loading a Token List</h2>\n<p>The information contained in <code>vol.tokens_per_page()</code> is minimal, a sum of all words in the body of each page.\nThe Extracted Features dataset also provides token counts with much more granularity: for every part of speech (e.g. noun, verb) of every occurring capitalization of every word of every section (i.e. header, footer, body) of every page of the volume.</p>\n<p><code>tokens_per_page()</code> only kept the &quot;for every page&quot; grouping; <code>vol.tokenlist()</code> can be called to return section-, part-of-speech-, and word-specific details:</p>\n<pre><code class=\"language-python\">tl = vol.tokenlist()\n# Let&#39;s look at some words deeper into the book:\n# from 1000th to 1100th row, skipping by 15 [1000:1100:15]\ntl[1000:1100:15]\n</code></pre>\n<div>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th></th>\n      <th></th>\n      <th></th>\n      <th>count</th>\n    </tr>\n    <tr>\n      <th>page</th>\n      <th>section</th>\n      <th>token</th>\n      <th>pos</th>\n      <th></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th rowspan=\"2\" valign=\"top\">27</th>\n      <th rowspan=\"2\" valign=\"top\">body</th>\n      <th>those</th>\n      <th>DT</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>within</th>\n      <th>IN</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th rowspan=\"5\" valign=\"top\">28</th>\n      <th rowspan=\"5\" valign=\"top\">body</th>\n      <th>a</th>\n      <th>DT</th>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>be</th>\n      <th>VB</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>deserted</th>\n      <th>VBN</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>faintly</th>\n      <th>RB</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>important</th>\n      <th>JJ</th>\n      <td>1</td>\n    </tr>\n  </tbody>\n</table>\n</div>\n\n\n\n<p>As before, the data is returned as a Pandas DataFrame. This time, there is much more information. Consider a single row:</p>\n<p>{% include figure.html filename=&quot;single-row-tokencount.png&quot; caption=&quot;Single row of tokenlist.&quot; %}</p>\n<p>The columns in bold are an index. Unlike the typical one-dimensional index seen before, here there are four dimensions to the index: page, section, token, and pos. This row says that for the 24th page, in the body section (i.e. ignoring any words in the header or footer), the word &#39;years&#39; occurs 1 time as an plural noun. The part-of-speech tag for a plural noun, <code>NNS</code>, follows the <a href=\"https://www.ling.upenn.edu/courses/Fall_2003/ling001/penn_treebank_pos.html\">Penn Treebank</a> definition.</p>\n<blockquote>\n<p>The &quot;words&quot; on the first page seems to be OCR errors for the cover of the book. The HTRC Feature Reader refers to &quot;pages&quot; as the $$n^{th}$$ scanned image of the volume, not the actual number printed on the page. This is why &quot;page 1&quot; for this example is the cover.</p>\n</blockquote>\n<p>Tokenlists can be retrieved with arguments that combine information by certain dimensions, such as <code>case</code>, <code>pos</code>, or <code>page</code>. For example, <code>case=False</code> specified that &quot;Jaguar&quot; and &quot;jaguar&quot; should be counted together. You may also notice that, by default, only &#39;body&#39; is returned, a default that can be overridden.</p>\n<p>Look at the following list of commands: can you guess what the output will look like? Try for yourself and observe how the output changes.</p>\n<ul>\n<li><code>vol.tokenlist(case=False)</code></li>\n<li><code>vol.tokenlist(pos=False)</code></li>\n<li><code>vol.tokenlist(pages=False, case=False, pos=False)</code></li>\n<li><code>vol.tokenlist(section=&#39;header&#39;)</code></li>\n<li><code>vol.tokenlist(section=&#39;group&#39;)</code></li>\n</ul>\n<p>Details for these arguments are available in the code <a href=\"http://htrc.github.io/htrc-feature-reader/htrc_features/feature_reader.m.html#htrc_features.feature_reader.Volume.tokenlist\">documentation</a> for the Feature Reader.</p>\n<p>Jupyter provides another convenience here. Documentation can be accessed within the notebook by adding a &#39;?&#39; to the start of a piece of code. Try it with <code>?vol.tokenlist</code>, or with other objects or variables.</p>\n<h2 id=\"working-with-dataframes\">Working with DataFrames</h2>\n<p>The Pandas DataFrame type returned by the HTRC Feature Reader is very malleable. To work with the tokenlist that you retrieved earlier, three skills are particularily valuable:</p>\n<ol>\n<li>Selecting subsets by a condition</li>\n<li>Slicing by named row index</li>\n<li>Grouping and aggregating</li>\n</ol>\n<h3 id=\"selecting-subsets-of-a-dataframe-by-a-condition\">Selecting Subsets of a DataFrame by a Condition</h3>\n<p>Consider this example: <em>I only want to look at tokens that occur more than a hundred times in the book.</em></p>\n<p>Remembering that the table-like output from the HTRC Feature Reader is a Pandas DataFrame, the way to pursue this goal is to learn to filter and subset DataFrames. Knowing how to do so is important for working with just the data that you need.</p>\n<p>To subset individual rows of a DataFrame, you can provide a series of True/False values to the DataFrame, formatted in square brackets. When True, the DataFrame returns that row; when False, the row is excluded from what is returned.</p>\n<p>To see this in context, first load a basic tokenlist without parts-of-speech or individual pages:</p>\n<pre><code class=\"language-python\">tl_simple = vol.tokenlist(pos=False, pages=False)\n# .sample(5) returns five random words from the full result\ntl_simple.sample(5)\n</code></pre>\n<div>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th></th>\n      <th>count</th>\n    </tr>\n    <tr>\n      <th>section</th>\n      <th>token</th>\n      <th></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th rowspan=\"5\" valign=\"top\">body</th>\n      <th>halleluya</th>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>realty</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>addressed</th>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>win-</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>broke</th>\n      <td>3</td>\n    </tr>\n  </tbody>\n</table>\n</div>\n\n\n\n<p>To select just the relevant tokens, we need to look at each row and evaluate whether it matches the criteria that &quot;this token has a count greater than 100&quot;. Let&#39;s try to convert that requirement to code.</p>\n<p>&quot;This token has a count&quot; means that we are concerned specifically with the &#39;count&#39; column, which can be singled out from the <code>tl</code> table with <code>tl[&#39;count&#39;]</code>. &quot;greater than 100&quot; is formalized as <code>&gt; 100</code>. Putting it together, try the following and see what you get:</p>\n<pre><code class=\"language-python\">tl_simple[&#39;count&#39;] &gt; 100\n</code></pre>\n<p>It is a DataFrame of True/False values. Each value indicates whether the &#39;count&#39; column in the corresponding row matches the criteria or not. We haven&#39;t selected a subset yet, we simply asked a question and were told for each row when the question was true or false.</p>\n<blockquote>\n<p>You may wonder why section and token are still seen, even though &#39;count&#39; was selected. These are part of the DataFrame <strong>index</strong>, so they&#39;re considered part of the information <em>about</em> that row rather than data <em>in</em> the row. You can convert the index to data columns with <code>reset_index()</code>. In this lesson we will keep the index intact, though there are advanced cases where there are benefits to resetting it.</p>\n</blockquote>\n<p>Armed with the True/False values of whether each token&#39;s &#39;count&#39; value is or isn&#39;t greater than 100, we can give those values to <code>tl_simple</code> in square brackets.</p>\n<pre><code class=\"language-python\">matches = tl_simple[&#39;count&#39;] &gt; 100\ntl_simple[matches].sample(5)\n</code></pre>\n<div>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th></th>\n      <th>count</th>\n    </tr>\n    <tr>\n      <th>section</th>\n      <th>token</th>\n      <th></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th rowspan=\"5\" valign=\"top\">body</th>\n      <th>they</th>\n      <td>127</td>\n    </tr>\n    <tr>\n      <th>have</th>\n      <td>210</td>\n    </tr>\n    <tr>\n      <th>The</th>\n      <td>107</td>\n    </tr>\n    <tr>\n      <th>about</th>\n      <td>110</td>\n    </tr>\n    <tr>\n      <th>,</th>\n      <td>3258</td>\n    </tr>\n  </tbody>\n</table>\n</div>\n\n\n\n<p>You can move the comparison straight into the square brackets, the more conventional equivalent of the above:</p>\n<pre><code class=\"language-python\">tl_simple[tl_simple[&#39;count&#39;] &gt; 100].sample(5)\n</code></pre>\n<div>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th></th>\n      <th>count</th>\n    </tr>\n    <tr>\n      <th>section</th>\n      <th>token</th>\n      <th></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th rowspan=\"5\" valign=\"top\">body</th>\n      <th>not</th>\n      <td>220</td>\n    </tr>\n    <tr>\n      <th>had</th>\n      <td>455</td>\n    </tr>\n    <tr>\n      <th>have</th>\n      <td>210</td>\n    </tr>\n    <tr>\n      <th>,</th>\n      <td>3258</td>\n    </tr>\n    <tr>\n      <th>his</th>\n      <td>206</td>\n    </tr>\n  </tbody>\n</table>\n</div>\n\n\n\n<p>As might be expected, many of the tokens that occur very often are common words like &quot;she&quot; and &quot;and&quot;, as well as various punctuation.</p>\n<p>Multiple conditions can be chained with <code>&amp;</code> (and) or <code>|</code> (or), using regular brackets so that Python knows the order of operations. For example, words with a count greater than 150 <em>and</em> a count less than 200 are selected in this way:</p>\n<pre><code class=\"language-python\">tl_simple[(tl_simple[&#39;count&#39;] &gt; 150) &amp; (tl_simple[&#39;count&#39;] &lt; 200)]\n</code></pre>\n<div>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th></th>\n      <th>count</th>\n    </tr>\n    <tr>\n      <th>section</th>\n      <th>token</th>\n      <th></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th rowspan=\"7\" valign=\"top\">body</th>\n      <th>Mr.</th>\n      <td>159</td>\n    </tr>\n    <tr>\n      <th>be</th>\n      <td>196</td>\n    </tr>\n    <tr>\n      <th>but</th>\n      <td>178</td>\n    </tr>\n    <tr>\n      <th>do</th>\n      <td>179</td>\n    </tr>\n    <tr>\n      <th>is</th>\n      <td>170</td>\n    </tr>\n    <tr>\n      <th>on</th>\n      <td>190</td>\n    </tr>\n    <tr>\n      <th>—</th>\n      <td>167</td>\n    </tr>\n  </tbody>\n</table>\n</div>\n\n\n\n<h3 id=\"slicing-dataframes\">Slicing DataFrames</h3>\n<p>Above, subsets of the DataFrame were selected based on a matching criteria for columns. It is also possible to select a DataFrame subset by specifying the values of its index, a process called <strong>slicing</strong>. For example, you can ask, <em>&quot;give me all the verbs for pages 9-12&quot;</em>.</p>\n<p>In the DataFrame returned by <code>vol.tokenlist()</code>, page, section, token, and POS were part of the index (try the command <code>tl.index.names</code> to confirm). One can think of an index as the margin content of an Excel spreadsheet: the letters along the top and numbers along the left side are the indices. A cell can be referred to as A1, A2, B1... In Pandas, however, you can name these, so instead of A, B, C, or 1,2,3, columns and rows can be referred to by more descriptive names. You can also have multiple levels, so you&#39;re not bound by the two-dimensions of a table format. With a multi-indexed DataFrame, you can ask for <code>Page=24,section=Body, ...</code>.</p>\n<p>{% include figure.html filename=&quot;Excel.PNG&quot; caption=&quot;One can think of an index as the margin notations in Excel (i.e. 1,2,3... and A,B,C,..), except it can be named and can have multiple levels.&quot; %}</p>\n<p>Slicing a DataFrame against a labelled index is done using <code>DataFrame.loc[]</code>. Try the following examples and see what is returned:</p>\n<ul>\n<li>Select information from page 17:<ul>\n<li><code>tl.loc[(17),]</code></li>\n</ul>\n</li>\n<li>Select &#39;body&#39; section of page 17:<ul>\n<li><code>tl.loc[(17, &#39;body&#39;),]</code></li>\n</ul>\n</li>\n<li>Select counts of the word &#39;Anne&#39; in the &#39;body&#39; section of page 17:<ul>\n<li><code>tl.loc[(17, &#39;body&#39;, &#39;Anne&#39;),]</code></li>\n</ul>\n</li>\n</ul>\n<p>The levels of the index are specified in order, so in this case the first value refers to &#39;page&#39;, then &#39;section&#39;, and so on. To skip specifying anything for an index level -- that is, to select everything for that level -- <code>slice(None)</code> can be used as a placeholder:</p>\n<ul>\n<li>Select counts of the word &#39;Anne&#39; for all pages and all page sections<ul>\n<li><code>tl.loc[(slice(None), slice(None), &quot;Anne&quot;),]</code></li>\n</ul>\n</li>\n</ul>\n<p>Finally, it is possible to select multiple labels for a level of the index, with a list of labels (i.e. <code>[&#39;label1&#39;, &#39;label2&#39;]</code>) or a sequence covering everything from one value to another (i.e. <code>slice(start, end)</code>):</p>\n<ul>\n<li>Select pages 37, 38, and 52<ul>\n<li><code>tl.loc[([37, 38, 52]),]</code></li>\n</ul>\n</li>\n<li>Select all pages from 37 to 40<ul>\n<li><code>tl.loc[(slice(37, 40)),]</code></li>\n</ul>\n</li>\n<li>Select counts for &#39;Anne&#39; or &#39;Hilary&#39; from all pages<ul>\n<li><code>tl.loc[(slice(None), slice(None), [&quot;Anne&quot;, &quot;Hilary&quot;]),]</code></li>\n</ul>\n</li>\n</ul>\n<blockquote>\n<p>The reason for the comma in <code>tl.loc[(...),]</code> is because columns can be selected in the same way after the comma. Pandas DataFrames can have a multiple-level index for columns, but the HTRC Feature Reader does not use this.</p>\n</blockquote>\n<p>Knowing how to slice, let&#39;s try to find the word &quot;CHAPTER&quot; in this book, and compare where that shows up to the token-per-page pattern previously plotted.</p>\n<p>The token list we previously set to <code>tl</code> only included body text; to include headers and footers in a search for <code>CHAPTER</code> we&#39;ll grab a new tokenlist with <code>section=&#39;all&#39;</code> specified.</p>\n<pre><code class=\"language-python\">tl_all = vol.tokenlist(section=&#39;all&#39;)\nchapter_pages = tl_all.loc[(slice(None), slice(None), &quot;CHAPTER&quot;),]\nchapter_pages\n</code></pre>\n<div>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th></th>\n      <th></th>\n      <th></th>\n      <th>count</th>\n    </tr>\n    <tr>\n      <th>page</th>\n      <th>section</th>\n      <th>token</th>\n      <th>pos</th>\n      <th></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>19</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>35</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>56</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>73</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>91</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>115</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>141</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>158</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>174</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>193</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>217</th>\n      <th>body</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>231</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>246</th>\n      <th>header</th>\n      <th>CHAPTER</th>\n      <th>NNP</th>\n      <td>1</td>\n    </tr>\n  </tbody>\n</table>\n</div>\n\n\n\n<p>Earlier, token counts were visualized using <code>tokens.plot()</code>, a built-in function of DataFrames that uses the Matplotlib visualization library.</p>\n<p>We can add to the earlier visualization by using Matplotlib directly. Try the following code in a new cell, which goes through every page number in the earlier search for &#39;CHAPTER&#39; and adds a red vertical line at the place in the chart with <code>matplotlib.pyplot.axvline()</code>:</p>\n<pre><code class=\"language-python\"># Get just the page numbers from the search for &quot;CHAPTER&quot;\npage_numbers = chapter_pages.index.get_level_values(&#39;page&#39;)\n\n# Visualize the tokens-per-page from before\ntokens.plot()\n\n# Add vertical lines for pages with &quot;CHAPTER&quot;\nimport matplotlib.pyplot as plt\nfor page_number in page_numbers:\n    plt.axvline(x=page_number, color=&#39;red&#39;)\n</code></pre>\n<p>{% include figure.html filename=&quot;draft_41_0.png&quot; caption=&quot;Output graph.&quot; %}</p>\n<blockquote>\n<p>Advanced: Though slicing with <code>loc</code> is more common when working with the index, it is possible to create a True/False list from an index to select rows as we did earlier. Here&#39;s an advanced example that grabs the &#39;token&#39; part of the index and, using the <code>isalpha()</code> string method that Pandas provides, filters to fully alphabetical words.</p>\n</blockquote>\n<pre><code>token_idx = tl.index.get_level_values(&quot;token&quot;)\ntl[token_idx.str.isalpha()]\n</code></pre>\n<p>Readers familiar with regular expressions (see <a href=\"/lessons/understanding-regular-expressions\">Understanding Regular Expressions</a> by Doug Knox) can adapt this example for even more robust selection using the <code>contains()</code> string method.</p>\n<h2 id=\"sorting-dataframes\">Sorting DataFrames</h2>\n<p>A DataFrame can be sorted with <code>DataFrame.sort_values()</code>, specifying the column to sort by as the first argument. By default, sorting is done in ascending order:</p>\n<pre><code class=\"language-python\">tl_simple.sort_values(&#39;count&#39;).head()\n</code></pre>\n<div>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th></th>\n      <th>count</th>\n    </tr>\n    <tr>\n      <th>section</th>\n      <th>token</th>\n      <th></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th rowspan=\"5\" valign=\"top\">body</th>\n      <th>gratified</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>reminding</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>dome</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>remembering</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>remains</th>\n      <td>1</td>\n    </tr>\n  </tbody>\n</table>\n</div>\n\n\n\n<p>Descending order is possible with the argument <code>ascending=False</code>, which puts the most common tokens at the top. For example:</p>\n<pre><code class=\"language-python\">tl_simple.sort_values(&#39;count&#39;, ascending=False).head()\n</code></pre>\n<div>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th></th>\n      <th>count</th>\n    </tr>\n    <tr>\n      <th>section</th>\n      <th>token</th>\n      <th></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th rowspan=\"5\" valign=\"top\">body</th>\n      <th>,</th>\n      <td>3258</td>\n    </tr>\n    <tr>\n      <th>\"</th>\n      <td>1670</td>\n    </tr>\n    <tr>\n      <th>the</th>\n      <td>1565</td>\n    </tr>\n    <tr>\n      <th>.</th>\n      <td>1532</td>\n    </tr>\n    <tr>\n      <th>and</th>\n      <td>1252</td>\n    </tr>\n  </tbody>\n</table>\n</div>\n\n\n\n<p>The most common tokens are &#39;the&#39; and &#39;and&#39;, alongside punctuation.</p>\n<p><em>Exercise: Try to retrieve the five most-common tokens used as a noun (&#39;NNP&#39;) or a plural noun (&#39;NNS&#39;) in the book</em>. You will have to get a new tokenlist, without pages but with parts-of-speech, then slice by the criteria, sort, and output the first five rows. (<a href=\"https://gist.github.com/organisciak/163e59ea6cf71c3cd12de410d075567c\">Solution</a>)</p>\n<h3 id=\"grouping-dataframes\">Grouping DataFrames</h3>\n<p>Up to this point, the token count DataFrames have been subsetted, but not modified from the way they were returned by the HTRC Feature Reader. There are many cases where one may want to perform aggregation or transformation based on subsets of data. To do this, Pandas supports the &#39;split-apply-combine&#39; pattern (Wickham 2011).</p>\n<p>Split-apply-combine refers to the process of dividing a dataset into groups (<em>split</em>), performing some activity for each of those groups (<em>apply</em>), and joining the new groups back together into a single DataFrame (<em>combine</em>).</p>\n<p>{% include figure.html filename=&quot;split-apply-combine.png&quot; caption=&quot;Graph demonstrating Split-Apply-Combine.&quot; %}</p>\n<p>{% include figure.html filename=&quot;example-split-apply-combine.png&quot; caption=&quot;Example of Split-Apply-Combine, averaging movie grosses by director.&quot; %}</p>\n<p>Split-apply-combine processes are supported on DataFrames with <code>groupby()</code>, which tells Pandas to split by some criteria. From there, it is possible to apply some change to each group individually, after which Pandas combines the affected groups into a single DataFrame again.</p>\n<p>Try the following, can you tell what happens?</p>\n<pre><code>tl.groupby(level=[&quot;pos&quot;]).sum()\n</code></pre>\n<p>The output is a count of how often each part-of-speech tag (&quot;pos&quot;) occurs in the entire book.</p>\n<ul>\n<li><em>Split</em> with <code>groupby()</code>: We took the token count dataframe that is set to <code>tl</code> and grouped by the part-of-speech (<code>pos</code>) level of the index. This means that rather than thinking in terms of rows, Pandas is now thinking of the <code>tl</code> DataFrame as a series of smaller groups, the groups selected by a common value for part of speech. So, all the personal pronouns (&quot;PRP&quot;) are in one group, and all the adverbs (&quot;RB&quot;) are in another, and so on.</li>\n<li><em>Apply</em> with <code>sum()</code>: These groups were sent to an apply function, <code>sum()</code>. Sum is an aggregation function, so it sums all the information in the &#39;count&#39; column for each group. For example, all the rows of data in the adverb group are summed up into a single count of all adverbs.</li>\n<li><em>Combine</em>: The combine step is implicit: the DataFrame knows from the <code>groupby</code> pattern to take everything that the apply function gives back (in the case of &#39;sum&#39;, just one row for every group) and stick it together.</li>\n</ul>\n<p><code>sum()</code> is one of many convenient functions <a href=\"http://pandas.pydata.org/pandas-docs/stable/groupby.html\">built-in</a> to Pandas. Other useful functions are <code>mean()</code>, <code>count()</code>, <code>max()</code>. It is also possible to send your groups to any function that you write with <code>apply()</code>.</p>\n<blockquote>\n<p>groupby can be used on data columns or an index. To run against an index, use <code>level=[index_level_name]</code> as above. To group against columns, use <code>by=[column_name]</code>.</p>\n</blockquote>\n<p>Below are some examples of grouping token counts.</p>\n<ul>\n<li>Find most common tokens in the entire volume (sorting by most to least occurrences)<ul>\n<li><code>tl.groupby(level=&quot;token&quot;).sum().sort_values(&quot;count&quot;, ascending=False)</code></li>\n</ul>\n</li>\n<li>Count how many pages each token/pos combination occurs on<ul>\n<li><code>tl.groupby(level=[&quot;token&quot;, &quot;pos&quot;]).count()</code></li>\n</ul>\n</li>\n</ul>\n<p>Remember from earlier that certain information can be called by sending arguments to <code>vol.tokenlist()</code>, so you don&#39;t always have to do the grouping yourself.</p>\n<p>With <code>sum</code>, the data is being reduced: only one row is left for each group. It is also possible to &#39;transform&#39; a group, where the same number of rows are returned. This is useful if processing is necessary based on the group statistics, such as percentages. Here is an advanced example of transformation, a <a href=\"https://web.archive.org/web/20161108211721/https://porganized.com/2016/03/09/term-weighting-for-humanists/\">TF*IDF</a> function. TF*IDF weighs a token&#39;s value to a document based on how common it is. In this case, it highlights words that are notable for a page but not the entire book.</p>\n<pre><code class=\"language-python\">from numpy import log\ndef tfidf(x):\n    return x * log(1+vol.page_count / x.count())\n# Will take a few seconds to run, depending on your system\nidf_scores = tl.groupby(level=[&quot;token&quot;]).transform(tfidf)\nidf_scores[1000:1100:30]\n</code></pre>\n<div>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th></th>\n      <th></th>\n      <th></th>\n      <th>count</th>\n    </tr>\n    <tr>\n      <th>page</th>\n      <th>section</th>\n      <th>token</th>\n      <th>pos</th>\n      <th></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>24</th>\n      <th>body</th>\n      <th>years</th>\n      <th>NNS</th>\n      <td>2.315830</td>\n    </tr>\n    <tr>\n      <th rowspan=\"3\" valign=\"top\">25</th>\n      <th rowspan=\"3\" valign=\"top\">body</th>\n      <th>asked</th>\n      <th>VBD</th>\n      <td>1.730605</td>\n    </tr>\n    <tr>\n      <th>him</th>\n      <th>PRP</th>\n      <td>2.994040</td>\n    </tr>\n    <tr>\n      <th>n't</th>\n      <th>RB</th>\n      <td>1.250162</td>\n    </tr>\n  </tbody>\n</table>\n</div>\n\n\n\n<p>Compare the parts of the function given to <code>transform()</code> with the equation:</p>\n<p>$$ IDF_w = log(1 + \\frac{N}{df_w}) $$</p>\n<p>N is the total number of pages. Document frequency, $$df_w$$, is &#39;how many pages (docs) does the word occur on?&#39; That is the <code>x.count()</code>. Can you modify the above to use corpus frequency, which is &#39;how many times does the word occur overall in the corpus (i.e. across all pages)?&#39; You&#39;d want to add everything up.</p>\n<h1 id=\"more-features-in-the-htrc-extracted-features-dataset\">More Features in the HTRC Extracted Features Dataset</h1>\n<p>So far we have mainly used token-counting features, accessed through <code>Volume.tokenlist()</code>. The HTRC Extracted Features Dataset provides more features at the volume level. Here are other features that are available to Volume objects. Try them on <code>vol</code> and see what the output is:</p>\n<ul>\n<li><code>vol.line_counts()</code>: How many vertically spaced lines of text, a measure related to the phyical format of the page.</li>\n<li><code>vol.sentence_counts()</code>: How many sentences of text: a measure related to the content on a page.</li>\n<li><code>vol.empty_line_counts()</code>: How many larger vertical spaces are there on the page between lines of text? In many cases, this can be used as a proxy for paragraph count. This is based on what software was used to OCR so there are inconsistencies: not all scans in the HathiTrust are OCR&#39;d identically.</li>\n<li><code>vol.begin_line_chars()</code>, <code>vol.end_line_chars()</code>: The count of different characters along the left-most and right-most sides of a page. This can tell you about what kind of page it is: for example, a table of contents might have a lot of numbers or roman numerals at the end of each line</li>\n</ul>\n<p>Earlier, we saw that the number of words on a page gave some indication of whether it was a page of the story or a different kind of page (chapter, front matter, etc). We can see that line count is another contextual &#39;hint&#39;:</p>\n<pre><code class=\"language-python\">line_counts = vol.line_counts()\nplt.plot(line_counts)\n</code></pre>\n<p>{% include figure.html filename=&quot;draft_52_1.png&quot; caption=&quot;Output graph.&quot; %}</p>\n<p>The majority of pages have 20-25 lines, confirmable with a histogram: <code>plt.hist(line_counts)</code>. This is likely what a full page of text looks like in this book. A scholar trying to focus on patterns only in the text and comfortable missing a few short pages might choose to filter to just these pages.</p>\n<h2 id=\"page-level-features\">Page-Level Features</h2>\n<p>If you open the raw dataset file for a HTRC EF volume on your computer, you may notice that features are provided for each page. While this lesson has focused on volumes, most of the features that we have seen can be accessed for a single page; e.g. <code>Page.tokenlist()</code> instead of <code>Volume.tokenlist()</code>. The methods to access the features are named the same, with the exception that <code>line_count</code>, <code>empty_line_count</code>, and <code>sentence_count</code> are not pluralized.</p>\n<p>Like iterating over <code>FeatureReader.volumes()</code> to get Volume objects, it is possible to iterate across pages with <code>Volume.pages()</code>.</p>\n<h1 id=\"next-steps\">Next Steps</h1>\n<p>Now that you know the basics of the HTRC Feature Reader, you can learn more about the <a href=\"https://analytics.hathitrust.org/features\">Extracted Features dataset</a>. The <a href=\"https://github.com/htrc/htrc-feature-reader/blob/master/README.ipynb\">Feature Reader home page</a> contains a lesson similar to this one but for more advanced users (that&#39;s you now!), and the <a href=\"http://htrc.github.io/htrc-feature-reader/htrc_features/feature_reader.m.html\">code documentation</a> gives exact information about what types of information can be called.</p>\n<p>Underwood (2015) has released <a href=\"https://analytics.hathitrust.org/genre\">genre classifications of public-domain texts in the HTRC EF Dataset</a>, comprised of fiction, poetry, and drama. Though many historians will be interested in other corners of the dataset, fiction is a good place to tinker with text mining ideas because of its expressiveness and relative format consistency.</p>\n<p>Finally, the repository for the HTRC Feature Reader has <a href=\"https://github.com/htrc/htrc-feature-reader/tree/master/examples\">advanced tutorial notebooks</a> showing how to use the library further. One such tutorial shows how to <a href=\"https://github.com/htrc/htrc-feature-reader/blob/master/examples/Within-Book%20Sentiment%20Trends.ipynb\">derive &#39;plot arcs&#39; for a text</a>, a process popularized by Jockers (2015).</p>\n<p>{% include figure.html filename=&quot;plot-arc.png&quot; caption=&quot;Plot Arc Example.&quot; %}</p>\n<h1 id=\"references\">References</h1>\n<p>Boris Capitanu, Ted Underwood, Peter Organisciak, Timothy Cole, Maria Janina Sarol, J. Stephen Downie (2016). The HathiTrust Research Center Extracted Feature Dataset (1.0) [Dataset]. HathiTrust Research Center, <a href=\"https://doi.org/10.13012/J8X63JT3\">https://doi.org/10.13012/J8X63JT3</a>.</p>\n<p>Chris Forster. &quot;A Walk Through the Metadata: Gender in the HathiTrust Dataset.&quot; Blog. <a href=\"http://cforster.com/2015/09/gender-in-hathitrust-dataset/\">http://cforster.com/2015/09/gender-in-hathitrust-dataset/</a>.</p>\n<p>Matthew L. Jockers (Feb 2015). &quot;Revealing Sentiment and Plot Arcs with the Syuzhet Package&quot;. <em>Matthew L. Jockers</em>. Blog. <a href=\"http://www.matthewjockers.net/2015/02/02/syuzhet/\">http://www.matthewjockers.net/2015/02/02/syuzhet/</a>.</p>\n<p>Peter Organisciak, Loretta Auvil, J. Stephen Downie (2015). “Remembering books: A within-book topic mapping technique.” Digital Humanities 2015. Sydney, Australia.</p>\n<p>Stéfan Sinclair &amp; Geoffrey Rockwell (2016). &quot;The Art of Literary Text Analysis.&quot; Github.com. Commit b04bc18. <a href=\"https://github.com/sgsinclair/alta\">https://github.com/sgsinclair/alta</a>.</p>\n<p>William J. Turkel and Adam Crymble (2012). &quot;Counting Word Frequencies with Python&quot;. The Programming Historian. /lessons/counting-frequencies.</p>\n<p>Ted Underwood (2014): Understanding Genre in a Collection of a Million Volumes, Interim Report. figshare.\n<a href=\"https://doi.org/10.6084/m9.figshare.1281251.v1\">https://doi.org/10.6084/m9.figshare.1281251.v1</a>.</p>\n<p>Ted Underwood, Boris Capitanu, Peter Organisciak, Sayan Bhattacharyya, Loretta Auvil, Colleen Fallaw, J. Stephen Downie (2015). &quot;Word Frequencies in English-Language Literature, 1700-1922&quot; (0.2) [Dataset]. <em>HathiTrust Research Center</em>. <a href=\"https://doi.org/10.13012/J8JW8BSJ\">https://doi.org/10.13012/J8JW8BSJ</a>.</p>\n<p>Hadley Wickham (2011). &quot;The split-apply-combine strategy for data analysis&quot;. <em>Journal of Statistical Software</em>, 40(1), 1-29.</p>\n<h1 id=\"appendix-downloading-custom-files-via-rsync\">Appendix: Downloading custom files via rsync</h1>\n<p>The full HTRC Extracted Features dataset is accessible using <em>rsync</em>, a Unix command line program for syncing files. It is already preinstalled on Linux or Mac OS. Windows users need to use <em>rsync</em> by downloading a program such as <a href=\"https://cygwin.com/\">Cygwin</a>, which provides a Unix-like command line environment in Windows.</p>\n<p>To download all <em>4 TB</em> comprising the EF dataset, you can use this command (be aware the full transfer will take a very long time):</p>\n<pre><code class=\"language-bash\">rsync -rv data.analytics.hathitrust.org::features/ .\n</code></pre>\n<p>This command recurses (the <code>-r</code> flag) through all the folders on the HTRC server, and syncs all the files to a location on your system; in this case the <code>.</code> at the end means &quot;the current folder&quot;. The <code>-v</code> flag means <code>--verbose</code>, which tells rsync to show you more information.</p>\n<p>It is possible to sync individual files by specifying a full file path. Files are organized in a <a href=\"https://wiki.ucop.edu/display/Curation/PairTree\">PairTree structure</a>, meaning that you can find an exact dataset file from a volume&#39;s HathiTrust id. The HTRC Feature Reader has a tools and instructions for <a href=\"https://github.com/htrc/htrc-feature-reader/blob/master/examples/ID_to_Rsync_Link.ipynb\">getting the path for a volume</a>. A list of all file paths is available:</p>\n<pre><code class=\"language-bash\">rsync -azv data.analytics.hathitrust.org::features/listing/htrc-ef-all-files.txt .\n</code></pre>\n<p>Finally, it is possible to download many files from a list. To try, we&#39;ve put together lists for public-domain <a href=\"http://data.analytics.hathitrust.org/genre/fiction_paths.txt\">fiction</a>, <a href=\"http://data.analytics.hathitrust.org/genre/drama_paths.txt\">drama</a>, and <a href=\"http://data.analytics.hathitrust.org/genre/poetry_paths.txt\">poetry</a> (Underwood 2014). For example:</p>\n<pre><code class=\"language-bash\">rsync -azv --files-from=fiction_paths.txt data.analytics.hathitrust.org::features/ .\n</code></pre>\n"}