{"metadata":{"title":"De HTML a lista de palabras (parte 2)","authors":["William J. Turkel","Adam Crymble"],"date":"2012-07-17T00:00:00.000Z","translation_date":"2017-03-15T00:00:00.000Z","editors":["Miriam Posner"],"reviewers":["Jim Clifford","Frederik Elwert"],"translator":["Víctor Gayol"],"translation-editor":["Adam Crymble"],"translation-reviewer":["Jairo A. Melo","Maria José Afanador-Llach","Antonio Rojas Castro"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/45","layout":"lesson","next":"normalizar-datos","previous":"de-html-a-lista-de-palabras-1","original":"from-html-to-list-of-words-2","python_warning":false,"difficulty":2,"activity":"transforming","topics":["python"],"abstract":"En esa lección aprenderás los comandos de Python que son necesarios para implementar la segunda parte del algoritmo que comenzamos en la lección 'De HTML a lista de palabras (parte 1)'.","avatar_alt":"Grabado de un hombre vestido de militar y otro hombre por detrás del primero que parece tener la intención de tropezarlo.","doi":"10.46430/phes0006","sequence":8,"series_total":14},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"objetivos-de-la-lección\">Objetivos de la lección</h2>\n<p>En esa lección aprenderás los comandos de Python que son necesarios para implementar la segunda parte del algoritmo que comenzamos en <a href=\"/es/lecciones/de-html-a-lista-de-palabras-1\">De HTML a lista de palabras (parte 1)</a>. La primera parte del algoritmo obtiene el contenido de una página HTML y guarda solamente el contenido que se encuentra entre la primera etiqueta <code>&lt;p&gt;</code> y la última etiqueta <code>&lt;br/&gt;</code>. La segunda mitad del algoritmo hace lo siguiente:</p>\n<ul>\n<li>Revisar cada carácter de la cadena de texto <em>contenidoPagina</em>, uno por uno.</li>\n<li>Si el carácter es un corchete angular izquierdo (&lt;) entonces estamos dentro de una etiqueta así que ignora cada uno de los caracteres siguientes.</li>\n<li>Si el carácter es un corchete angular derecho (&gt;) entonces estamos saliendo de una etiqueta; ignora el carácter actual, pero mira cada uno de los caracteres siguientes.</li>\n<li>Si no estamos dentro de una etiqueta, añade añade el carácter actual a una nueva variable: <em>texto</em>.</li>\n<li>Secciona la cadena de caracteres <em>texto</em> en una lista de palabras individuales que puedan ser manipuladas después.</li>\n</ul>\n<h3 id=\"archivos-requeridos-para-esta-lección\">Archivos requeridos para esta lección</h3>\n<ul>\n<li><em>obo.py</em></li>\n<li><em>contenido-juicio.py</em></li>\n</ul>\n<p>Si no tienes estos archivos puedes descargar el archivo comprimido python-es-lecciones2.zip (<a href=\"/assets/python-es-lecciones2.zip\">zip</a>) de la lección anterior.</p>\n<h2 id=\"repetir-y-probar-en-python\">Repetir y probar en Python</h2>\n<p>El siguiente escalón es implementar el algoritmo que busca cada uno de los caracteres en la cadema <em>contenidoPagina</em>, uno a la vez, y decide si el carácter pertenece a una marca de HTML o al contenido de la transcripción del juicio. Antes de que puedas hacer esto tienes que aprender algunas cuantas técnicas para la repetición de tareas y condiciones de prueba.</p>\n<h3 id=\"bucles-looping\">Bucles (<em>Looping</em>)</h3>\n<p>Como muchos lenguajes de programación Python incluye un número de mecanismos de bucle. El que necesitarás usar en este caso es un <em>bucle for</em>. La versión debajo le dice al intérprete que haga algo en cada carácter de una cadena llamada <em>contenidoPagina</em>. La variable <em>caract</em> contendrá cada carácter de <em>contenidoPagina</em> en sucesión. La nombramos <em>caract</em> porque no tiene un significado especial y podríamos haberla llamado <em>tintineo</em> o <em>k</em> si nos hubiéramos sentido tentados. Puedes utilizar la codificación a colores en Komodo Edit como una guía para decidir si una palabra es una variable con un nombre dado por el usuario (como <em>caract</em>) o se trata de un nombre definido para Python que sirve para un propósito específico (como &#39;<code>for</code>&#39;). Generalmente es buena idea darle a las variables nombres que provean información acerca de lo que contienen. Esto hará mucho más fácil entender un programa que no has revisado desde hace tiempo. Con esto en mente, <em>tintineo</em> no es seguramente una buena elección para el nombre de la variable en este caso.</p>\n<pre><code class=\"language-python\">for caract in contenidoPagina:\n    # haz algo con caract\n</code></pre>\n<h3 id=\"salto-branching\">Salto (<em>Branching</em>)</h3>\n<p>Enseguida necesitarás una manera de comprobar los contenidos de una cadena y escoger la acción a seguir basada en esa prueba. De nuevo, como muchos lenguajes de programación, Python incluye un número de mecanismos de salto (o estructuras de control). La que vamos a utilizar aquí es la <em>sentencia condicional if</em>. La versión debajo hace una prueba para ver si la cadena llamada <em>caract</em> consiste en un corchete angular izquierdo. Como mencionamos anteriormente, la sangría o indentación en Python es importante. Si el código está indentado, Python lo ejecutará cuando la condición sea verdadera.</p>\n<p>Toma en cuanta que Python utiliza el signo de igual (=) para <em>asignación</em>, es decir, para ajustar que una cosa sea equivalente a otra. Con el fin de comprobar la igualdad, utiliza dos signos de igual (==) en lugar de uno. Los programadores principiantes suelen confundir ambos.</p>\n<pre><code class=\"language-python\">if caract == &#39;&lt;&#39;:\n    # haz algo\n</code></pre>\n<p>Una forma más general de la sentencia condicional <em>if</em> te permite especificar qué hacer ante un evento en el que la condición de prueba es falsa.</p>\n<pre><code class=\"language-python\">if caract == &#39;&lt;&#39;:\n    # haz algo\nelse:\n    # haz algo distinto\n</code></pre>\n<p>En Python tienes la opción de hacer pruebas adicionales después de la primera mediante la utilización de la sentencia condicional <em>elif</em> (abreviatura de <em>else if</em>).</p>\n<pre><code class=\"language-python\">if caract == &#39;&lt;&#39;:\n    # haz algo\nelif caract == &#39;&gt;&#39;:\n    # haz otra cosa\nelse:\n    # haz algo completamente diferente\n</code></pre>\n<h2 id=\"utiliza-el-algoritmo-para-retirar-el-marcado-en-html\">Utiliza el algoritmo para retirar el marcado en HTML</h2>\n<p>Ahora sabes lo suficiente para implementar la segunda parte del algoritmo: retirar todas las etiquetas HTML. En esta parte del algoritmo queremos:</p>\n<ul>\n<li>Buscar en cada carácter de la cadena <em>contenidoPagina</em>, un carácter a la vez</li>\n<li>Si el carácter es un corchete angular izquierdo (&lt;) estamos dentro de una etiqueta así que ignora el carácter</li>\n<li>Si el carácter es un corchete angular derecho (&gt;) estamos saliendo de una etiqueta, ignora el carácter</li>\n<li>Si no estamos al interior de una etiqueta, anexa el carácter actual a una nueva variable: texto</li>\n</ul>\n<p>Para hacer esto, usarás un bucle para buscar cada carácter sucesivo en la cadena. Usarás entonces una sentencia condicional <em>if / elif</em> para determinar si el carácter es parte de una marca de HTML o parte del contenido, después anexar los caracteres de contenido a la cadena <em>texto</em>. ¿Cómo haremos el seguimiento de si nos encontramos dentro o fuera de una etiqueta? Podemos utilizar una variable entera que podrá ser 1 (verdadero) si el carácter correspondiente está dentro de una etiqueta y 0 (falso) si  no lo está (en el siguiente ejemplo hemos llamado a la variable &quot;adentro&quot;).</p>\n<h3 id=\"la-rutina-de-quitaretiquetas\">La rutina de <em>quitarEtiquetas</em></h3>\n<p>Poniendo todo junto, la versión final de la rutina se muestra a continuación. Observa que hemos expandido la función <em>quitarEtiquetas</em> que creamos anteriormente. Asegúrate de mantener la sangría o indentación como se muestra cuando remplaces la anterior rutina <em>quitarEtiquetas</em> de <em>obo.py</em> con esta nueva.</p>\n<p>Tu rutina debe verse ligeramente diferente y, mientras que funcione, todo está bien. Si estás inclinado a experimentar, probablemente es mejor que pruebes nuestra versión para asegurarte que tu programa hace lo que hace el nuestro.</p>\n<pre><code class=\"language-python\"># obo.py\ndef quitarEtiquetas(contenidoPagina):\n    contenidoPagina = str(contenidoPagina)\n    lugarInicio = contenidoPagina.find(&quot;&lt;p&gt;&quot;)\n    lugarFin = contenidoPagina.rfind(&quot;&lt;br/&gt;&quot;)\n\n    contenidoPagina = contenidoPagina[lugarInicio:lugarFin]\n\n    adentro = 0\n    texto = &#39;&#39;\n\n    for caract in contenidoPagina:\n        if caract == &#39;&lt;&#39;:\n            adentro = 1\n        elif (adentro == 1 and caract == &#39;&gt;&#39;):\n            adentro = 0\n        elif adentro == 1:\n            continue\n        else:\n            texto += caract\n\n    return texto\n</code></pre>\n<p>Hay dos nuevos conceptos de Python en este nuevo código: <em>continue</em> y <em>return</em>.</p>\n<p>La declaración de Python <em>continue</em> le ordena al intérprete regresar al principio del bucle. Así que si estamos procesando caracteres dentro de un par de corchetes angulares, queremos ir al siguiente carácter en la cadena de texto <em>contenidoPagina</em> sin añadir nada a nuestra variable <em>texto</em>.</p>\n<p>En los ejemplos anteriores hemos utilizado <code>print</code> extensamente. Éste da salida al resultado de nuestro programa en la pantalla para que lo lea el usuario. Sin embargo, a menudo queremos que una parte del programa envíe información a otra parte. Cuando termina de ejecutarse una función, puede regresar un valor al código que la ha invocado.  Si vamos a llamar a <em>quitarEtiquetas</em> utilizando otro programa, deberemos hacerlo de esta manera:</p>\n<pre><code class=\"language-python\">#entender la declaración Return\n\nimport obo\n\nmiTexto = &quot;Éste es mi &lt;h1&gt;HTML&lt;/h1&gt; mensaje&quot;\n\nelResultado = obo.quitarEtiquetas(miTexto)\n</code></pre>\n<p>Al utilizar <code>return</code>, hemos sido capaces de guardar la salida de datos de la función <em>quitarEtiquetas</em> directamente en una variable que hemos denominado &#39;elResultado&#39;, cuyo proceso podemos reanudar según sea necesario mediante código adicional.</p>\n<p>Fíjate que en el ejemplo <em>quitarEtiquetas</em> desde el inicio de esta subsección, el valor que queremos recuperar no es <em>contenidoPagina</em> sino el contenido que ha sido despojado de las etiquetas HTML.</p>\n<p>Para comprobar nuestra nueva rutina de <em>quitarEtiquetas</em> puedes ejecutar el programa <em>contenido-juicio.py</em> de nuevo. Dado que hemos redefinido <em>quitarEtiquetas</em>, el programa <em>contenido-juicio.py</em> ahora hace algo diferente (y más cercano a lo que nosotros queremos). Antes de que continúes, asegúrate de comprender por qué cambia el comportamiento de <em>contenido-juicio.py</em> si solamente hemos editado <em>obo.py</em>.</p>\n<h2 id=\"listas-en-python\">Listas en Python</h2>\n<p>Ahora que tienes la habilidad para extraer texto en crudo de páginas Web, querrás tener ese texto en una forma que sea fácil de procesar. Hasta ahora, cuando has necesitado guardar información en tus programas de Python lo has hecho utilizando cadenas de texto. Sin embargo, hay un par de excepciones. En la rutina de <em>quitarEtiquetas</em> también hiciste uso de un <a href=\"http://docs.python.org/2.4/lib/typesnumeric.html\">entero</a> llamado <em>adentro</em> para guardar un 1 cuando estabas procesando una etiqueta y un 0 cuando no. Puedes hacer operaciones matemáticas con los enteros pero no puedes guardar fracciones o números decimales en una variable de entero.</p>\n<pre><code class=\"language-python\">adentro = 1\n</code></pre>\n<p>Y cada vez que has necesitado leer o escribir a un archivo, has utilizado un controlador de archivo especial como <em>f</em> en el ejemplo siguiente:</p>\n<pre><code class=\"language-python\">f = open(&#39;holamundo.txt&#39;,&#39;w&#39;)\nf.write(&#39;hola mundo&#39;)\nf.close()\n</code></pre>\n<p>Sin embargo, uno de los <a href=\"http://docs.python.org/3/library/types.html\">tipos</a> de objetos que provee Python es <em>list</em> (o <em>lista</em>), una colección ordenada de otros objetos (incluyendo, potencialmente, otras listas). Convertir una cadena de texto a una lista de caracteres o palabras es muy sencillo. Escribe o copia el siguiente programa en tu editor de texto para ver dos maneras de lograrlo. Guarda el archivo como <em>cadena-a-lista.py</em> y ejecútalo. Compara las dos listas que se imprimen en el panel de comandos de salida y ve si puedes imaginarte cómo funciona este código.</p>\n<pre><code class=\"language-python\"># cadena-a-lista.py\n\n# algunas cadenas\ns1 = &#39;hola mundo&#39;\ns2 = &#39;qué tal mundo&#39;\n\n# lista de caracteres\ncaracList = []\nfor caract in s1:\n    caracList.append(caract)\nprint(caracList)\n\n# lista de &#39;palabras&#39;\nlistPalabras = s2.split()\nprint(listPalabras)\n</code></pre>\n<p>La primera rutina utiliza un bucle &quot;for&quot; para pasar por cada carácter en la cadena de texto <em>s1</em>, y añade el carácter al final de <em>caracList</em>. La segunda rutina utiliza la operación dividir para romper la cadena <em>s2</em> en fragmentos cada vez que encuentre espacios en blanco (espacios, tabulaciones, retornos de carro y caracteres similares). En realidad, es simplificar un poco las cosas referirse a los objetos de la segunda lista como palabras. Prueba a cambiar el contenido de <em>s2</em> del programa anterior por &quot;qué tal mundo!&quot; y ejecútalo de nuevo. ¿Qué sucedió con el signo de exclamación? Recuerda que deberás guardar los cambios antes de utilizar Ejecutar Python de nuevo.</p>\n<p>Considerando lo que has aprendido hasta ahora, ya puedes abrir un URL, descargar la página Web en una cadena de texto, despojarla de las etiquetas HTML y luego cortar el texto en una lista de palabras. Intenta ejecutar el siguiente programa:</p>\n<pre><code class=\"language-python\"># html-a-lista-1.py\nimport urllib.request, urllib.error, urllib.parse, obo\n\nurl = &#39;http://www.oldbaileyonline.org/browse.jsp?id=t17800628-33&amp;div=t17800628-33&#39;\n\nrespuesta = urllib.request.urlopen(url)\nhtml = respuesta.read().decode(&#39;UTF-8&#39;)\ntexto = obo.quitarEtiquetas(html)\nlistaPalabras = texto.split()\n\nprint((listaPalabras[0:120]))\n</code></pre>\n<p>Debes obtener algo como lo siguiente:</p>\n<pre><code class=\"language-python\">[&#39;324.&#39;, &#39;\\xc2\\xa0&#39;, &#39;BENJAMIN&#39;, &#39;BOWSEY&#39;, &#39;(a&#39;, &#39;blackmoor&#39;, &#39;)&#39;, &#39;was&#39;,\n&#39;indicted&#39;, &#39;for&#39;, &#39;that&#39;, &#39;he&#39;, &#39;together&#39;, &#39;with&#39;, &#39;five&#39;, &#39;hundred&#39;,\n&#39;other&#39;, &#39;persons&#39;, &#39;and&#39;, &#39;more,&#39;, &#39;did,&#39;, &#39;unlawfully,&#39;, &#39;riotously,&#39;,\n&#39;and&#39;, &#39;tumultuously&#39;, &#39;assemble&#39;, &#39;on&#39;, &#39;the&#39;, &#39;6th&#39;, &#39;of&#39;, &#39;June&#39;, &#39;to&#39;,\n&#39;the&#39;, &#39;disturbance&#39;, &#39;of&#39;, &#39;the&#39;, &#39;public&#39;, &#39;peace&#39;, &#39;and&#39;, &#39;did&#39;, &#39;begin&#39;,\n&#39;to&#39;, &#39;demolish&#39;, &#39;and&#39;, &#39;pull&#39;, &#39;down&#39;, &#39;the&#39;, &#39;dwelling&#39;, &#39;house&#39;, &#39;of&#39;,\n&#39;\\xc2\\xa0&#39;, &#39;Richard&#39;, &#39;Akerman&#39;, &#39;,&#39;, &#39;against&#39;, &#39;the&#39;, &#39;form&#39;, &#39;of&#39;,\n&#39;the&#39;, &#39;statute,&#39;, &#39;&amp;amp;c.&#39;, &#39;\\xc2\\xa0&#39;, &#39;ROSE&#39;, &#39;JENNINGS&#39;, &#39;,&#39;, &#39;Esq.&#39;,\n&#39;sworn.&#39;, &#39;Had&#39;, &#39;you&#39;, &#39;any&#39;, &#39;occasion&#39;, &#39;to&#39;, &#39;be&#39;, &#39;in&#39;, &#39;this&#39;, &#39;part&#39;,\n&#39;of&#39;, &#39;the&#39;, &#39;town,&#39;, &#39;on&#39;, &#39;the&#39;, &#39;6th&#39;, &#39;of&#39;, &#39;June&#39;, &#39;in&#39;, &#39;the&#39;,\n&#39;evening?&#39;, &#39;-&#39;, &#39;I&#39;, &#39;dined&#39;, &#39;with&#39;, &#39;my&#39;, &#39;brother&#39;, &#39;who&#39;, &#39;lives&#39;,\n&#39;opposite&#39;, &#39;Mr.&#39;, &quot;Akerman&#39;s&quot;, &#39;house.&#39;, &#39;They&#39;, &#39;attacked&#39;, &#39;Mr.&#39;,\n&quot;Akerman&#39;s&quot;, &#39;house&#39;, &#39;precisely&#39;, &#39;at&#39;, &#39;seven&#39;, &quot;o&#39;clock;&quot;, &#39;they&#39;,\n&#39;were&#39;, &#39;preceded&#39;, &#39;by&#39;, &#39;a&#39;, &#39;man&#39;, &#39;better&#39;, &#39;dressed&#39;, &#39;than&#39;, &#39;the&#39;,\n&#39;rest,&#39;, &#39;who&#39;]\n</code></pre>\n<p>Tener simplemente una lista de palabras no es realmente significativo. Como seres humanos tenemos la habilidad de leer; sin embargo, te estás acercando a tener una idea de lo que tus programas pueden procesar.</p>\n<h2 id=\"lecturas-sugeridas\">Lecturas sugeridas</h2>\n<ul>\n<li>Lutz, <em>Learning Python</em><ul>\n<li>Ch. 7: Strings</li>\n<li>Ch. 8: Lists and Dictionaries</li>\n<li>Ch. 10: Introducing Python Statements</li>\n<li>Ch. 15: Function Basics</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"sincronización-de-código\">Sincronización de código</h3>\n<p>Para seguir a lo largo de las lecciones futuras es importante que tengas los archivos correctos y programas en el directorio &quot;programming-historian&quot; de tu disco duro. Al final de cada lección puedes descargar el archivo zip &quot;python-es-lecciones&quot; para asegurarte que tienes el código correcto.</p>\n<ul>\n<li>python-es-lecciones3.zip (<a href=\"/assets/python-es-lecciones3.zip\">zip sync</a>)</li>\n</ul>\n"}