{"metadata":{"title":"Preserving Your Research Data","layout":"lesson","date":"2014-04-30T00:00:00.000Z","authors":["James Baker"],"reviewers":["Jane Winters","Sharon Howard","William J. Turkel"],"editors":["Adam Crymble"],"difficulty":1,"exclude_from_check":["review-ticket"],"activity":"sustaining","topics":["data-management"],"abstract":"This lesson will suggest ways in which historians can document and structure their research data so as to ensure it remains useful in the future.","redirect_from":"/lessons/preserving-your-research-data","avatar_alt":"A large barrel","doi":"10.46430/phen0039"},"html_body":"<p>{% include toc.html %}</p>\n<h4 id=\"background\">Background</h4>\n<p>In his 2003 essay &#39;Scarcity or Abundance&#39; Roy Rosenzweig sought to alert\nhistorians to what he called &#39;the fragility of evidence in the digital\nera&#39; (Rosenzweig, 736). And whilst his concerns were focused on sources\navailable on the open web, they can easily be extended to the\nborn-digital materials – or data – historians create during their\nresearch.</p>\n<p>It is this research data that the present guide will focus upon. But\nwhy?</p>\n<p>Well, historians are moving toward using computers as the default means\nof storing all of their research data, their stuff. Their manuscripts\nhave been digital objects for some time and their research is moving\naccordingly – be that in the form of typed notes, photographs of\narchives, or tabulated data. Moreover research data held in a digital\nform has clear advantages over its physical antecedents: it can be\nbrowsed and searched, hosted in ways that enable access in many places,\nand merged with or queried against other research data.</p>\n<p>Merely putting research data into digital form does not guarantee it\nwill survive. Here by survival I neither mean survive in a literal sense\nnor in a survival as readable by the next version of Microsoft Word\nsense, but rather in a usable by people sense. For if not a problem\nsolved, the nuts and bolts of how to preserve research data for the\nfuture is a problem whose potential solutions have already been\naddressed at length, both with and without historians in mind. So too\nhave data management experts, services and the like talked about\nscholarly best practice with regards to documenting, structuring and\norganising research data. In spite of all this, research data generated\nby an individual historian is at risk of loss if that historian is not\nable to generate and preserve it in a form they can understand and find\nmeaningful years or decades after the fact, let alone someone else\nwading through the idiosyncrasies of their research process. In short,\nthere is a risk of loss as a consequence of data being detached from the\ncontext of its creation, from the tacit knowledge that made it useful at\nthe time of preparing talk X or manuscript Y. As William Stafford Noble\nputs it:</p>\n<blockquote>\n<p>The core guiding principle is simple: Someone unfamiliar with your\nproject should be able to look at your computer files and understand\nin detail what you did and why […]Most commonly, however, that\n“someone” is you. A few months from now, you may not remember what you\nwere up to when you created a particular set of files, or you may not\nremember what conclusions you drew. You will either have to then spend\ntime reconstructing your previous experiments or lose whatever\ninsights you gained from those experiments.</p>\n<p>William Stafford Noble (2009) A Quick Guide to Organizing\nComputational Biology Projects. PLoSComputBiol 5(7): e1000424.\ndoi:10.1371/journal.pcbi.1000424</p>\n</blockquote>\n<p>Drawing on the lessons and expertise of research data experts, the\npresent guide will suggest ways in which historians can document and\nstructure their research data so as to ensure it remains useful in the\nfuture. The guide is not intended to be prescriptive, rather it is\nassumed readers will iterate, change, and adapt the ideas presented to\nbest fit their own research.</p>\n<hr>\n<h4 id=\"documenting-research-data\">Documenting research data</h4>\n<blockquote>\n<p>Birkwood, Katie (girlinthe). “Victory is mine: while ago I worked out\nsome Clever Stuff ™ in Excel. And I MADE NOTES ON IT. And those notes\nENABLED ME TO DO IT AGAIN.” 7 October 2013, 3:46 a.m.. Tweet.</p>\n<p><a href=\"https://twitter.com/Girlinthe/status/387166944094199809\">https://twitter.com/Girlinthe/status/387166944094199809</a></p>\n</blockquote>\n<p>The purpose of documentation is to capture the process of data creation,\nchanges made to data, and tacit knowledge associated with data. Project\nmanagement methodologies, such as <a href=\"http://en.wikipedia.org/wiki/PRINCE2\">PRINCE2</a>, place great emphasis on\nprecise, structured, and verbose documentation. Whilst there are\nbenefits to this approach, especially for large, complex, multi-partner\nprojects, the average working historian is more likely to benefit from a\nflexible, bespoke approach to documentation that draws on, but is not\nyoked to, project management principles. In the case of historical\nresearch, the sort of documentation that might be produced to preserve\nthe usefulness of research data includes:</p>\n<ul>\n<li>documentation describing notes taken whilst examining a document in\nan archive, such as the archival reference for the original\ndocument, how representative the notes are (e.g. full\ntranscriptions, partial transcriptions, or summaries), how much of\nthe document was examined, or decisions taken to exclude sections of\nthe document from the research process.</li>\n<li>documentation describing tabulated data, such as how it was\ngenerated (e.g. by hand or in an automated manner), archival\nreferences for the original sources some data came from, or what\nattributes of the original sources were retained (and why).</li>\n<li>documentation describing a directory of digital images, such as how\neach image was created, where those images were downloaded from, or\nresearch notes that refer to them.</li>\n</ul>\n<p>As the last example suggests, one of the key purposes of documentation\nis to describe the meaningful links that exist between research data,\nlinks that may not remain obvious over time.</p>\n<p>When to document is very much up to the individual and the rhythm of\ntheir research. The main rule is to get into a habit of writing and\nupdating documentation at regular intervals, ideally every time a batch\nof work is finished for the morning, afternoon, or day. At the same time\nit is important not to worry about perfection, rather to aim to write\nconsistent and efficient documentation that will be useful to you, and\nhopefully someone else using your research data, years after the fact.</p>\n<hr>\n<h4 id=\"file-formats\">File formats</h4>\n<p>Research data and documentation should ideally be saved in <a href=\"http://en.wikipedia.org/wiki/Cross-platform\">platform\nagnostic</a> formats such as .txt for notes and .csv (comma-separated\nvalues) or .tsv (tab-seperated values) for tabulated data. These plain\ntext formats are preferable to the proprietary formats used as defaults\nby Microsoft Office or iWork because they can be opened by many software\npackages and have a strong chance of remaining viewable and editable in\nthe future. Most standard office suites include the option to save files\nin .txt, .csv and .tsv formats, meaning you can continue to work with\nfamiliar software and still take appropriate action to make your work\naccessible. Compared to .doc or .xls these formats have the additional\nbenefit, from a preservation perspective, of containing only\nmachine-readable elements. Whilst using bold, italics, and colouring to\nsignify headings or to make a visual connection between data elements is\ncommon practice, these display-orientated annotations are not\nmachine-readable and hence can neither be queried and searched nor are\nappropriate for large quantities of information. Preferable are simple\nnotation schemes such as using a double-asterisk or three hashes to\nrepresent a data feature: in my own notes, for example, three question\nmarks indicate something I need to follow up on, chosen because &#39;???&#39;\ncan easily be found with a CTRL+F search.</p>\n<p>It is likely that on many occasions these notation schemes will emerge\nfrom existing individual practice (and as a consequence will need to be\ndocumented), though existing schema such as <a href=\"http://en.wikipedia.org/wiki/Markdown\">Markdown</a> are available\n(Markdown files are saved as .md). An excellent Markdown cheat sheet is\navailable on GitHub <a href=\"https://github.com/adam-p/markdown-here\">https://github.com/adam-p/markdown-here</a>) for those\nwho wish to follow – or adapt – this existing schema. Notepad++\n<a href=\"http://notepad-plus-plus.org/\">http://notepad-plus-plus.org/</a> is recommended for Windows users, though\nby no means essential, for working with .md files. Mac or Unix users may\nfind <a href=\"http://komodoide.com/komodo-edit/\">Komodo Edit</a> or <a href=\"https://www.barebones.com/products/textwrangler/\">Text Wrangler</a> helpful.</p>\n<hr>\n<h4 id=\"recap-1\">Recap 1</h4>\n<p>To recap, the key points about documentation and file formats are:</p>\n<ul>\n<li>Aim for documentation to capture in a precise and consistent manner\nthe tacit knowledge surrounding a research process, be that with\nrelation to note taking, generating tabulated data, or accumulating\nvisual evidence.</li>\n<li>Keep documentation simple by using file formats and notation\npractices that are platform agnostic and machine-readable.</li>\n<li>Build time for updating and creating documentation into your\nworkflow without allowing documentation work to become a burden.</li>\n<li>Make an investment in leaving a paper trail now to save yourself\ntime attempting to reconstruct it in the future.</li>\n</ul>\n<hr>\n<h4 id=\"structuring-research-data\">Structuring research data</h4>\n<p>Documenting your research is made easier by structuring your research\ndata in a consistent and predictable manner.</p>\n<p>Why?</p>\n<p>Well, every time we use a library or archive catalogue, we rely upon\nstructured information to help us navigate data (both physical and\ndigital) the library or archive contains. Without that structured\ninformation, our research would be much poorer.</p>\n<p>Examining URLs is a good way of thinking about why structuring research\ndata in a consistent and predictable manner might be useful in your\nresearch. Bad URLs are not reproducible and hence, in a scholarly\ncontext, not citable. On the contrary, good URLs represent with clarity\nthe content of the page they identify, either by containing semantic\nelements or by using a single data element found across a set or\nmajority of pages.</p>\n<p>A typical example of the former are the URLs used by news websites or\nblogging services. WordPress URLs follow the format:</p>\n<ul>\n<li><em>website name</em>/<em>year(4 digits)</em>/<em>month (2 digits)</em>/<em>day (2\ndigits)</em>/<em>words-of-title-separated-by-hyphens</em></li>\n<li><a href=\"http://cradledincaricature.com/2014/02/06/comic-art-beyond-the-print-shop/\">http://cradledincaricature.com/2014/02/06/comic-art-beyond-the-print-shop/</a></li>\n</ul>\n<p>A similar style is used by news agencies such as a The Guardian\nnewspaper:</p>\n<ul>\n<li><em>website name</em>/<em>section subdivision</em>/<em>year (4 digits)</em>/<em>month (3\ncharacters)</em>/<em>day (2\ndigits)</em>/<em>words-describing-content-separated-by-hyphens</em></li>\n<li><a href=\"http://www.theguardian.com/uk-news/2014/feb/20/rebekah-brooks-rupert-murdoch-phone-hacking-trial\">http://www.theguardian.com/uk-news/2014/feb/20/rebekah-brooks-rupert-murdoch-phone-hacking-trial</a>\n.</li>\n</ul>\n<p>In archival catalogues, URLs structured by a single data element are\noften used. The British Cartoon Archive structures its online archive\nusing the format:</p>\n<ul>\n<li><em>website name</em>/record/<em>reference number</em></li>\n<li><a href=\"http://www.cartoons.ac.uk/record/SBD0931\">http://www.cartoons.ac.uk/record/SBD0931</a></li>\n</ul>\n<p>And the Old Bailey Online uses the format:</p>\n<ul>\n<li><em>website name</em>/browse.jsp?ref=<em>reference number</em></li>\n<li><a href=\"http://www.oldbaileyonline.org/browse.jsp?ref=OA16780417\">http://www.oldbaileyonline.org/browse.jsp?ref=OA16780417</a></li>\n</ul>\n<p>What we learn from these examples is that a combination of semantic\ndescription and data elements make consistent and predictable data\nstructures readable both by humans and machines. Transferring this to\ndigital data accumulated during the course of historical research makes\nresearch data easier to browse, to search and to query using the\nstandard tools provided by our operating systems (and, as we shall see\nin a future lesson, by more advanced tools).</p>\n<p>In practice (for OS X and Linux users, replace all backslashes hereafter\nwith forward slash), the structure of a good research data archive might\nlook something like this:</p>\n<p>A base or root directory, perhaps called &#39;work&#39;.</p>\n<pre><code>\\work\\\n</code></pre>\n<p>A series of sub-directories.</p>\n<pre><code>     \\work\\events\\\n     \\research\\\n     \\teaching\\\n     \\writing\\\n</code></pre>\n<p>Within these directories are series of directories for each event,\nresearch project, module, or piece of writing. Introducing a naming\nconvention that includes a date elements keeps the information organised\nwithout the need for subdirectories by, say, year or month.</p>\n<pre><code>\\work\\research\\2014-01_Journal_Articles\n              \\2014-02_Infrastructure\n</code></pre>\n<p>Finally, further sub-directories can be used to separate out information\nas the project grows.</p>\n<pre><code>\\work\\research\\2014_Journal_Articles\\analysis\n                                    \\data\n                                    \\notes\n</code></pre>\n<p>Obviously not all information will fit neatly within any given structure\nand as new projects arise taxonomies will need to be revisited. Either\nway, idiosyncrasy is fine so long as the overall directory structure is\nconsistent and predictable, and so long as anything that isn’t is\nclearly documented: for example, the &#39;writing&#39; sub-directory in the\nabove structure might include a .txt file stating what it contained\n(drafts and final version of written work) and what it didn&#39;t contain\n(research pertaining to that written work).</p>\n<p>The name of this .txt file, indeed any documentation and research data,\nis important to ensuring it and its contents are easy to identify.\n&#39;Notes about this folder.docx&#39; is not a name that fulfils this purpose,\nwhilst &#39;2014-01-31_Writing_readme.txt&#39; is as it replicates the title\nof the directory and included some date information (North American\nreaders should note that I&#39;ve chosen the structure year_month_date). A\n<a href=\"/assets/preserving-your-research-data/network_analysis_of_Isaac_Cruikshank_and_his_publishers_readme.txt\">readme file I made for a recent project</a>\ncontains the sort of information that you and other users of your data\nmight find useful.</p>\n<p>An cautionary tale should be sufficient to confirm the value of this\napproach. During the course of a previous research project, I collected\nsome 2,000 digital images of Georgian satirical prints from a number of\nonline sources, retaining the file names upon download. Had I applied a\nnaming convention to these from the outset (say &#39;PUBLICATION\nYEAR_ARTIST SURNAME_TITLE OF WORK.FORMAT&#39;) I would be able to search\nand query these images. Indeed starting each filename with some version\nof YYYYMMDD would have meant that the files could be sorted in\nchronological order on Windows, OS X and Linux. And ensuring that all\nspaces or punctuation (except dash, dot and underscore) were removed\nfrom the filenames in the process of making them consistent and\npredictable, would have made command line work with the files possible.\nBut I did not, and as it stands I would need to set aside a large amount\nof time to amend every filename individually so as to make the data\nusable in this way.</p>\n<p>Further, applying such naming conventions to all research data in a\nconsistent and predictable manner assists with the readability and\ncomprehension of the data structure. For example for a project on\njournal articles we might choose the directory…</p>\n<pre><code>\\work\\research\\2014-01_Journal_Articles\\\n</code></pre>\n<p>…where the year-month elements captures when the project started.</p>\n<p>Within this directory we include a \\data\\ directory where the original\ndata used in the project is kept.</p>\n<pre><code>2014-01-31_Journal_Articles.tsv\n</code></pre>\n<p>Alongside this data is documentation that describes\n2014-01-31_Journal_Articles.tsv.</p>\n<pre><code>2014-01-31_Journal_Articles_notes.txt\n</code></pre>\n<p>Going back a directory level to \\2014-01_Journal_Articles\\ we create\nthe \\analysis\\ directory in which we place:</p>\n<pre><code>2014-02-02_Journal_Articles_analysis.txt\n2014-02-15_Journal_Articles_analysis.txt\n</code></pre>\n<p>Note the different month and date attributes here. These reflect the\ndates on which data analysis took place, a convention described briefly\nin 2014-02-02_Journal_Articles_analysis_readme.txt.</p>\n<p>Finally, a directory within \\data\\ called \\derived_data\\ contains\ndata derived from the original 2014-01-31_Journal_Articles.tsv. In\nthis case, each derived .tsv file contains lines including the keywords,\n&#39;africa&#39;, &#39;america&#39;, &#39;art&#39; et cetera, and are named accordingly.</p>\n<pre><code>2014-01-31_Journal_Articles_KW_africa.tsv\n\n2014-01-31_Journal_Articles_KW_america.tsv\n\n2014-02-01_Journal_Articles_KW_art .tsv\n\n2014-02-02_Journal_Articles_KW_britain.tsv\n</code></pre>\n<hr>\n<h4 id=\"recap-2\">Recap 2</h4>\n<p>To recap, the key points about structuring research data are:</p>\n<ul>\n<li>Data structures should be consistent and predictable.</li>\n<li>Consider using semantic elements or data identifiers to structure\nresearch data directories.</li>\n<li>Fit and adapt your research data structure to your research.</li>\n<li>Apply naming conventions to directories and file names to identify\nthem, to create associations between data elements, and to assist\nwith the long term readability and comprehension of your data\nstructure.</li>\n</ul>\n<hr>\n<h4 id=\"summary\">Summary</h4>\n<p>This lesson has suggested ways for documenting and structuring research\ndata, the purpose of which is to ensure that data is preserved by\ncapturing tacit knowledge gained during the research process and thus\nmaking the information easy to use in the future. It has recommended the\nuse of platform agnostic and machine-readable formats for documentation\nand research data. It has suggested that URLs offer a practice example\nof both good and bad data structures that can be replicated for the\npurposes of a historian&#39;s research data.</p>\n<p>These suggestions are intended merely as guides; it is expected that\nresearchers will adapt them to suit their purposes. In doing so, it is\nrecommended that researchers keep digital preservation strategies and\nproject management best practice in mind, whilst ensuring that time\nspent documenting and structuring research does not become a burden.\nAfter all, the purpose of this guide is to make more not less efficient\nhistorical research that generates data. That is, your research.</p>\n<hr>\n<h4 id=\"further-reading\">Further Reading</h4>\n<p>Ashton, Neil, &#39;Seven deadly sins of data publication&#39;, School of Data\nblog (17 October 2013)\n<a href=\"http://schoolofdata.org/2013/10/17/seven-deadly-sins-of-data-publication/\">http://schoolofdata.org/2013/10/17/seven-deadly-sins-of-data-publication/</a></p>\n<p>Hitchcock, Tim, &#39;Judging a book by its URLs&#39;, Historyonics blog (3\nJanuary 2014)\n<a href=\"http://historyonics.blogspot.co.uk/2014/01/judging-book-by-its-url.html\">http://historyonics.blogspot.co.uk/2014/01/judging-book-by-its-url.html</a></p>\n<p>Howard, Sharon, &#39;Unclean, unclean! What historians can do about sharing\nour messy research data&#39;, Early Modern Notes blog (18 May 2013)\n<a href=\"http://earlymodernnotes.wordpress.com/2013/05/18/unclean-unclean-what-historians-can-do-about-sharing-our-messy-research-data/\">http://earlymodernnotes.wordpress.com/2013/05/18/unclean-unclean-what-historians-can-do-about-sharing-our-messy-research-data/</a></p>\n<p>Noble, William Stafford, A Quick Guide to Organizing Computational\nBiology Projects.PLoSComputBiol 5(7): e1000424 (2009)\n<a href=\"https://doi.org/10.1371/journal.pcbi.1000424\">https://doi.org/10.1371/journal.pcbi.1000424</a></p>\n<p>Oxford University Computing Services, &#39;Sudamih Project. Research\nInformation Management: Organising Humanities Material&#39; (2011)\n<a href=\"https://zenodo.org/record/28329\">https://zenodo.org/record/28329</a></p>\n<p>Pennock, Maureen, &#39;The Twelve Principles of Digital Preservation (and a\ncartridge in a repository…)&#39;, British Library Collection Care blog (3\nSeptember 2013)\n<a href=\"http://britishlibrary.typepad.co.uk/collectioncare/2013/09/the-twelve-principles-of-digital-preservation.html\">http://britishlibrary.typepad.co.uk/collectioncare/2013/09/the-twelve-principles-of-digital-preservation.html</a></p>\n<p>Pritchard, Adam, &#39;Markdown Cheatsheet&#39; (2013)\n<a href=\"https://github.com/adam-p/markdown-here\">https://github.com/adam-p/markdown-here</a></p>\n<p>Rosenzweig, Roy, &#39;Scarcity or Abundance? Preserving the Past in a\nDigital Era&#39;, The American Historical Review 108:3 (2003), 735-762.</p>\n<p>UK Data Archive, &#39;Documenting your Data&#39;\n<a href=\"http://data-archive.ac.uk/create-manage/document\">http://data-archive.ac.uk/create-manage/document</a></p>\n"}