{"metadata":{"title":"Instalar módulos de Python con pip","authors":["Fred Gibbs"],"date":"2013-05-06T00:00:00.000Z","translation_date":"2017-04-20T00:00:00.000Z","reviewers":["Ben Hurwitz","Amanda Morton"],"translator":["Víctor Gayol"],"translation-editor":["Antonio Rojas Castro"],"translation-reviewer":["José Calvo Tello","Antonio Rojas Castro"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/63","layout":"lesson","original":"installing-python-modules-pip","avatar_alt":"Una rama con tres frutos","difficulty":1,"activity":"acquiring","topics":["get-ready","python"],"abstract":"Hay muchas maneras de instalar módulos externos; este tutorial explica uno de los métodos más comunes utilizando un programa llamado pip.","exclude_from_check":["editors"],"doi":"10.46430/phes0012"},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"objetivos-de-la-lección\">Objetivos de la lección</h2>\n<p>Esta lección muestra cómo descargar e instalar módulos de Python. Hay muchas maneras de instalar módulos externos, pero para esta lección vamos a utilizar un programa llamado <a href=\"https://pip.pypa.io/en/stable/\">pip</a>. El programa pip viene instalado por defecto en Python 2.7.9 y versiones más nuevas. Este tutorial es muy útil para cualquiera que utilice versiones antiguas de Python (lo que todavía es común).</p>\n<h2 id=\"introducir-módulos\">Introducir módulos</h2>\n<p>Una de las principales ventajas de utilizar Python es el número de librerías o bibliotecas de código excelentes que están amplia y fácilmente disponibles y que te pueden ahorrar escribir mucho código, o simplemente realizar una tarea particular de la manera más sencilla (como crear un archivo CSV o recopilar información de una página web de forma automática -<em>webscraping</em>). Cuando buscas en Google soluciones a problemas, encuentras ejemplos de código que utilizan librerías de las cuales no habías escuchado hablar antes. ¡No tengas miedo! Una vez que estas bibliotecas están instaladas en tu computadora, puedes utilizarlas importándolas al principio de tu código. Puedes importar tantas librerías como quieras, por ejemplo:</p>\n<pre><code class=\"language-python\">import csv\nimport requests\nimport kmlwriter\nimport pprint\n</code></pre>\n<p>Para los nuevos usuarios de Python puede resultar un tanto intimidante descargar e instalar por primera vez módulos externos. Hay muchas maneras de hacerlo (aumentando así la confusión); esta lección explica una de las formas más sencillas y la más común de instalar módulos de Python.</p>\n<p>El objetivo aquí es instalar <em>software</em> en tu computadora que puede descargar e instalar automáticamente los módulos de Python. Utilizaremos el programa llamado <a href=\"https://pip.pypa.io/en/stable/\">pip</a>.</p>\n<blockquote>\n<p>Nota: En Python 3.4, pip está incluido en la instalación por defecto. Hay muchas razones por las que no debes tener todavía esta versión; en caso de que no la tengas, estas instrucciones deben ayudar.</p>\n</blockquote>\n<h3 id=\"instrucciones-para-mac-y-linux\">Instrucciones para Mac y Linux</h3>\n<p>Según la documentación de <code>pip</code>, podemos descargar una secuencia de comandos (<em>script</em>) Python para instalarlo. En una Mac o Linux debemos instalar <code>pip</code> con línea de comandos usando <a href=\"http://www.thegeekstuff.com/2012/04/curl-examples/\">curl</a>, que es una orden que descarga el <em>script</em> de <a href=\"https://es.wikipedia.org/wiki/Perl\">Perl</a> y que permite la instalación de <code>pip</code>.</p>\n<pre><code class=\"language-bash\">curl -O https://bootstrap.pypa.io/get-pip.py\n</code></pre>\n<p>Una vez que descargaste el archivo get-pip.py, necesitas ejecutarlo con el intérprete de Python. Sin embargo, si intentas ejecutar el <em>script</em> con Python de esta manera:</p>\n<pre><code class=\"language-bash\">python get-pip.py\n</code></pre>\n<p>La secuencia de comandos del <em>script</em> seguramante falle. Esto se debe a que no tiene permisos para actualizar ciertos directorios en tu sistema de archivos para evitar que <em>scripts</em> aleatorios puedan cambiar archivos importantes e instalarte virus. En este caso, y en todos los casos en que necesites dar permiso a un <em>script</em> seguro para escribir en las carpetas del sistema, puedes utilizar el comando <code>sudo</code> (abreviatura de &quot;Super User DO&quot;) delante del comando Python, como:</p>\n<pre><code class=\"language-bash\">sudo python get-pip.py\n</code></pre>\n<h3 id=\"instrucciones-para-windows\">Instrucciones para Windows</h3>\n<p>Como en los sistemas operativos anteriores, la manera más fácil de instalar pip es utilizando el programa de Python llamado get-pip.py, que puedes descargar <a href=\"https://bootstrap.pypa.io/get-pip.py\">aquí</a>. Cuando abres este enlace te puede asustar el revoltijo horrible que te espera. Por favor, no te espantes. Solamente usa tu navegador para guardar esta página con su nombre por defecto, que es <code>get-pip.py</code>. Guarda el archivo en tu directorio de Python para que sepas dónde encontrarlo.</p>\n<p>Una vez guardes el archivo, necesitas ejecutarlo, lo cual puedes hacer de dos maneras. Si prefieres utilizar tu intérprete de Python, solamente haz click con el botón derecho sobre el archivo <code>get-pip.py</code> y selecciona &quot;abrir con&quot; y luego selecciona el intérprete de Python que suelas utilizar.</p>\n<p>Si prefieres instalar pip utilizando la terminal de línea de comandos, navega al directorio en el que pusiste Python y obtén <code>get-pip.py</code>. Para este ejemplo asumimos el directorio <code>python27</code>, así que usa el comando <code>C:\\&gt;cd python27</code>. Una vez que estés en este directorio, para instalar pip ejecuta el comando:</p>\n<pre><code class=\"language-bash\">python get-pip.py\n</code></pre>\n<p>Si buscas más información consulta la página de <a href=\"http://stackoverflow.com/questions/4750806/how-to-install-pip-on-windows\">StackOverflow</a> que parece estar actualizada de manera regular.</p>\n<h2 id=\"instalar-módulos-de-python\">Instalar módulos de Python</h2>\n<p>Ahora que ya tienes pip, resultará fácil instalar los módulos de Python dado que el programa hace todo el trabajo por ti. Cuando encuentres un módulo que quieras utilizar, generalmente tendrá documentación o instrucciones de instalación que incluyan el comando pip necesario, como:</p>\n<pre><code class=\"language-bash\">pip install requests\npip install beautifulsoup4\npip install simplekml\n</code></pre>\n<p>Como ya se dijo, recuerda que probablemente necesitarás ejecutar <code>pip</code> con <code>sudo</code> en Mac y Linux (no en Windows).</p>\n<pre><code class=\"language-bash\">sudo pip install requests\n</code></pre>\n<p>¡Listo para trabajar!</p>\n"}