{"metadata":{"title":"Salida de datos como archivo HTML con Python","authors":["William J. Turkel","Adam Crymble"],"date":"2012-07-17T00:00:00.000Z","translation_date":"2017-03-15T00:00:00.000Z","editors":["Miriam Posner"],"reviewers":["Jim Clifford","Frederik Elwert"],"translator":["Víctor Gayol"],"translation-editor":["Adam Crymble"],"translation-reviewer":["Jairo A. Melo","Maria José Afanador-Llach","Antonio Rojas Castro"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/49","layout":"lesson","next":"palabras-clave-en-contexto-n-grams","previous":"crear-y-ver-archivos-html-con-python","original":"output-data-as-html-file","python_warning":false,"difficulty":2,"activity":"transforming","topics":["python","website"],"abstract":"Esta lección toma los pares de frecuencia creados en 'Contar frecuencias de palabras con Python' y crea una salida de datos a un archivo HTML.","avatar_alt":"Grabado de mujer y dos niños.","doi":"10.46430/phes0025","sequence":12,"series_total":14},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"objetivo-de-la-lección\">Objetivo de la lección</h2>\n<p>Esta lección toma los pares de frecuencia creados en <a href=\"/es/lecciones/contar-frecuencias\">Contar frecuencias de palabras con Python</a> y crea una salida de datos a un archivo HTML.</p>\n<p>Aquí aprenderás a crear esta salida de datos como archivo HTML utilizando Python. También aprenderás acerca del formato de cadenas. El resultado final es un archivo HTML que muestra las palabras clave encontradas en la fuente original en orden de frecuencia descendente junto con el número de veces que aparece cada palabra clave.</p>\n<h2 id=\"archivos-necesarios-para-esta-lección\">Archivos necesarios para esta lección</h2>\n<ul>\n<li><code>obo.py</code></li>\n</ul>\n<p>Si no tienes estos archivos de las lecciones anteriores, puedes descargar python-es-lecciones6, un <a href=\"/assets/python-es-lecciones6.zip\">archivo zip de las lecciones anteriores</a>.</p>\n<h2 id=\"construcción-de-un-contenedor-de-html\">Construcción de un contenedor de HTML</h2>\n<p>En la lección anterior aprendiste cómo etiquetar el mensaje &quot;Hola Mundo&quot; en HTML, escribir el resultado en un archivo y abrirlo automáticamente en el navegador. Un programa que pone códigos de formato alrededor de algo para que pueda ser usado por otro programa es llamado a veces &quot;contenedor&quot; (<em>wrapper</em>). Lo que vamos a hacer ahora es desarrollar un contenedor de HTML para la salida de nuestro código que computa frecuencias de palabras. También añadiremos algunos <em>metadatos</em> dinámicos útiles para complementar los datos de frecuencia recogidos en <a href=\"/es/lecciones/contar-frecuencias\">Contar frecuencias</a>.</p>\n<h2 id=\"metadatos\">Metadatos</h2>\n<p>La distinción entre datos y metadatos es crucial en las ciencias de la información. Los metadatos son datos acerca de datos. Este concepto ya te debe ser familiar incluso si no has escuchado antes el término. Considera un libro tradicional. Si tomamos el texto del libro como los datos, hay un número de otras características que están asociadas con el texto pero que pueden o no estar impresas en el libro de manera explícita. El título del libro, el autor, el editor y el lugar y fecha de la publicación son metadatos y generalmente están impresos en el trabajo. El lugar y fecha del escrito, el nombre del corrector de estilo, los datos de catalogación de la Biblioteca del Congreso y el nombre del tipo de fuente utilizado para la composición tipográfica, a veces están impresas en él. La persona que compra una copia particular puede escribir o no su nombre en el libro. Si el libro pertenece a la colección de una biblioteca, esa biblioteca mantendrá metadatos adicionales, pero solamente algunos de ellos estarán unidos físicamente al libro. El registro de los préstamos, por ejemplo, se mantiene generalmente en una especie de base de datos y se vincula al libro con un identificador único. Bibliotecas, archivos y museos tienen complejos sistemas para generar y mantener un registro de metadatos.</p>\n<p>Cuando trabajas con datos digitales es buena idea incorporar metadatos en tus propios archivos siempre que sea posible. Ahora vamos a desarrollar algunas estrategias básicas para hacer que nuestros archivos de datos sean <em>auto-documentados</em>. En nuestro contenedor queremos incluir información dinámica acerca del archivo, tales como la hora y fecha en el que fue creado así como un título HTML que es relevante para el archivo. En este caso podríamos darle un nombre nosotros mismos, pero cuando empecemos a trabajar con múltiples archivos, crear automáticamente archivos autodocumentados nos ahorrará mucho tiempo, así que lo practicaremos ahora. Y para ello tendremos que aprender algunas opciones más potentes de formato de cadenas de texto.</p>\n<h2 id=\"formato-de-cadenas-de-texto-en-python\">Formato de cadenas de texto en Python</h2>\n<p>Python incluye un operador especial para formato que te permite insertar una cadena dentro de otra. Está representado por un signo de porcentaje seguido por una &quot;s&quot;. Abre el <em>shell</em> de Python e intenta los ejemplos siguientes:</p>\n<pre><code class=\"language-python\">\nformula = &#39;Esta fruta es una %s&#39;\nprint(formula)\n-&gt; Esta fruta es una %s\n\nprint(formula % &#39;banana&#39;)\n-&gt; Esta fruta es una banana\n\nprint(formula % &#39;pera&#39;)\n-&gt; Esta fruta es una pera\n</code></pre>\n<p>También hay una manera que te permite interpolar una lista de cadenas dentro de otra.</p>\n<pre><code class=\"language-python\">formula2 = &#39;Éstas son %s, aquellas son %s&#39;\nprint(formula2)\n-&gt; Éstas son %s, aquellas son %s\n\nprint(formula2 % (&#39;bananas&#39;, &#39;peras&#39;))\n-&gt; Éstas son bananas, aquellas son peras\n</code></pre>\n<p>En estos ejemplos, un <code>%s</code> en una cadena indica que otra cadena será incrustada en ese punto. Hay una serie de otros códigos de formato de cadenas, la mayoría de los cuales permiten introducir números en las cadenas con varios formatos como <code>%i</code> para enteros (i.e. 1, 2, 3), <code>%f</code> para punto decimal flotante (por ejemplo: 3.023, 4.59, 1.0) y demás. Al utilizar este método podemos introducir información que es única para ese archivo.</p>\n<h2 id=\"archivo-de-datos-auto-documentado\">Archivo de datos auto-documentado</h2>\n<p>Vamos a convertir en funciones algo del código que ya hemos escrito. Uno de ellos descargará el contenido de un URL y nos regresará una cadena de texto en minúsculas de la página Web. Copia este código en el módulo <code>obo.py</code>.</p>\n<pre><code class=\"language-python\"># Dado un URL, regresa una cadena de texto en mínusculas de una página.\n\ndef paginaWebATexto(url):\n    import urllib.request, urllib.error, urllib.parse\n    respuesta = urllib.request.urlopen(url)\n    html = respuesta.read().decode(&#39;UTF-8&#39;)\n    texto = quitarEtiquetas(html).lower()\n    return texto\n</code></pre>\n<p>También queremos una función que tome una cadena de texto en cualquier orden y la haga el cuerpo de un archivo HTML que se abra automáticamente en Firefox. Esta función debe incluir algunos metadatos básicos, como la hora y la fecha en la que se creó y el nombre del programa que lo creó. Estudia el siguiente código con atención y luego cópialo en el módulo <code>obo.py</code>.</p>\n<h3 id=\"instrucciones-para-mac\">Instrucciones para Mac</h3>\n<p>Si estás usado una Mac asegúrate de incluir la variable de la ruta de nombre de archivo adecuada en la segunda línea del último párrafo del código para reflejar en dónde estás guardando tus archivos.</p>\n<pre><code class=\"language-python\"># Dado el nombre de un programa de llamada, un url y una cadena a envolver,\n# crea una cadena en body de html con metadatos basicos y abrela en Firefox.\n\ndef envuelveCadenaenHTMLMac(programa, url, body):\n    import datetime\n    from webbrowser import open_new_tab\n\n    ahora = datetime.datetime.today().strftime(&quot;%Y%m%d-%H%M%S&quot;)\n    nombreArchivo = programa + &#39;.html&#39;\n    f = open(nombreArchivo,&#39;w&#39;)\n\n    wrapper = &quot;&quot;&quot;&lt;html&gt;\n    &lt;head&gt;\n    &lt;title&gt;%s output - %s&lt;/title&gt;\n    &lt;/head&gt;\n    &lt;body&gt;&lt;p&gt;URL: &lt;a href=\\&quot;%s\\&quot;&gt;%s&lt;/a&gt;&lt;/p&gt;&lt;p&gt;%s&lt;/p&gt;&lt;/body&gt;\n    &lt;/html&gt;&quot;&quot;&quot;\n\n    todo = wrapper % (programa, ahora, url, url, body)\n    f.write(todo)\n    f.close()\n\n    #Cambia la ruta de la variable siguiente para que coincida la localizacion en tu directorio\n    nombreArchivo = &#39;file:///Users/username/Desktop/programming-historian/&#39; + nombreArchivo\n\n    open_new_tab(nombreArchivo)\n</code></pre>\n<h3 id=\"instrucciones-para-windows\">Instrucciones para Windows</h3>\n<pre><code class=\"language-python\"># Dado el nombre de un programa de llamada, un url y una cadena a envolver,\n# crea una cadena en body de html con metadatos basicos y abrela en Firefox.\n\ndef envuelveCadenaenHTMLWindows(programa, url, body):\n    import datetime\n    from webbrowser import open_new_tab\n\n    ahora = datetime.datetime.today().strftime(&quot;%Y%m%d-%H%M%S&quot;)\n\n    nombreArchivo = programa + &#39;.html&#39;\n    f = open(nombreArchivo,&#39;w&#39;)\n\n    wrapper = &quot;&quot;&quot;&lt;html&gt;\n    &lt;head&gt;\n    &lt;title&gt;%s output - %s&lt;/title&gt;\n    &lt;/head&gt;\n    &lt;body&gt;&lt;p&gt;URL: &lt;a href=\\&quot;%s\\&quot;&gt;%s&lt;/a&gt;&lt;/p&gt;&lt;p&gt;%s&lt;/p&gt;&lt;/body&gt;\n    &lt;/html&gt;&quot;&quot;&quot;\n\n    todo = wrapper % (programa, ahora, url, url, body)\n    f.write(todo)\n    f.close()\n\n    open_new_tab(nombreArchivo)\n</code></pre>\n<p>***</p>\n<p>Ten en cuenta que esta función utiliza el operador de formato de cadenas que apenas aprendimos. Si aún tienes problema con esta idea, echa una mirada al archivo HTML que se abrió en la nueva pestaña de tu Firefox y podrás ver cómo funcionó. Si aún estás atascado en esta parte, échale un ojo a:</p>\n<pre><code>URL: http://www.oldbaileyonline.org/browse.jsp?id=t17800628-33&amp;div=t17800628-33\n</code></pre>\n<p>en el archivo HTML y rastrea cómo el programa sabe poner ahí el valor del URL.</p>\n<p>La función también convoca una biblioteca <code>datetime</code> de Python para determinar la hora y fecha actuales. Como el operador de formato de cadena <code>%s</code>, esta biblioteca utiliza el <code>%</code> como reemplazo de valores. En este caso, <code>%Y %m %d %H %M %S</code> representan año, mes, día, hora, minutos y segundos respectivamente. A diferencia de <code>%s</code>, el programa determinará para ti el valor de estas variables utilizando el reloj de tu computadora. Es importante que entiendas esta diferencia.</p>\n<p>Estos metadatos de fecha junto con el nombre del programa que llamó a la función, se guarda en la etiqueta de título del HTML. El archivo HTML que es creado tiene el mismo nombre que el programa de Python que lo creó pero con la extensión <code>.html</code> en vez de <code>.py</code>.</p>\n<h2 id=\"ensamblar-todo\">Ensamblar todo</h2>\n<p>Ahora podemos crear otra versión de nuestro programa para computar frecuencias. En vez de enviar su salida de datos a un archivo de texto o a una ventana de salida, envía la salida de datos a un archivo HTML que será abierto en una nueva pestaña de Firefox. De ahí, la salida de datos del programa puede agregarse fácilmente como una entrada bibliográfica a Zotero. Escribe o copia el código siguiente en tu editor de texto, guárdalo como <code>html-a-frec-3.py</code> y ejecútalo para confirmar que trabaja como se espera.</p>\n<p>Utiliza lo más apropiado para tu sistema: <code>obo.envuelveCadenaenHTMLMac()</code> u <code>obo.envuelveCadenaenHTMLWindows()</code>.</p>\n<pre><code class=\"language-python\"># html-a-frec-3.py\nimport obo\n\n# crea un diccionario ordenado de pares de frecuencia de palabras\nurl = &#39;http://www.oldbaileyonline.org/browse.jsp?id=t17800628-33&amp;div=t17800628-33&#39;\ntexto = obo.paginaWebATexto(url)\nlistaPalabrasCompleta = obo.quitaNoAlfaNum(texto)\nlistaPalabras = obo.quitarPalabrasvac(listaPalabrasCompleta, obo.palabrasvac)\ndiccionario = obo.listaPalabrasDicFrec(listaPalabras)\ndiccOrdenado = obo.ordenaDicFrec(diccionario)\n\n# compila el diccionario en una cadena y envuelve con HTML\nsalidaCadena = &quot;&quot;\nfor s in diccOrdenado:\n    salidaCadena += str(s)\n    salidaCadena += &quot;&lt;br /&gt;&quot;\nobo.envuelveCadenaenHTMLMac(&quot;html-a-frec-3&quot;, url, salidaCadena)\n</code></pre>\n<p>Observa que intercalamos nuestros pares de frecuencia de palabras con la etiqueta de salto <code>&lt;br\\&gt;</code> de HTML, la cual actúa como una <em>nueva línea</em>. Si todo va bien, deberías ver las mismas frecuencias de palabras que computamos en la última sección pero esta vez en la ventana de tu navegador.</p>\n<h3 id=\"leturas-sugeridas\">Leturas sugeridas</h3>\n<ul>\n<li>Lutz, Learning Python<ul>\n<li>Re-read and review Chs. 1-17</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"sincronización-de-código\">Sincronización de código</h3>\n<p>Para seguir a lo largo de las lecciones futuras es importante que tengas los archivos correctos y programas en el directorio &quot;programming-historian&quot; de tu disco duro. Al final de cada lección puedes descargar el archivo zip &quot;python-es-lecciones&quot; para asegurarte que tienes el código correcto. Si estás trabajando con la versión Mac o Linux de las lecciones deberás abrir el archivo <code>obo.py</code> y cambiar &quot;file:///Users/username/Desktop/programming-historian/&quot; a la ruta del directorio de tu propia computadora.</p>\n<ul>\n<li>python-es-lecciones7.zip <a href=\"/assets/python-es-lecciones7.zip\">zip sync</a></li>\n</ul>\n"}