{"metadata":{"title":"Installing Omeka","layout":"lesson","date":"2016-07-24T00:00:00.000Z","authors":["Jonathan Reeve"],"reviewers":["M. H. Beals"],"editors":["Fred Gibbs"],"difficulty":2,"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/6","activity":"presenting","topics":["website"],"abstract":"This lesson will teach you how to install your own copy of Omeka.","next":"creating-an-omeka-exhibit","redirect_from":"/lessons/installing-omeka","avatar_alt":"A figure working at a machine with gear diagrams","doi":"10.46430/phen0052"},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"introduction\">Introduction</h2>\n<p><a href=\"http://omeka.net\">Omeka.net</a>, as described in <a href=\"up-and-running-with-omeka.html\">the previous lesson</a>, is a useful service for Omeka beginners, but there are a few reasons why you might want to install your own copy of Omeka. Reasons include:</p>\n<ul>\n<li><strong>Upgrades</strong>. By installing Omeka yourself, you can use the latest versions of Omeka as soon as they&#39;re released, without having to wait for Omeka.net to upgrade their system.</li>\n<li><strong>Plugins and themes</strong>. You can install any plugin or theme you want, without being restricted to those provided by Omeka.net.</li>\n<li><strong>Customizations</strong>. You can buy a custom domain name, and customize your code to achieve your desired functionality.</li>\n<li><strong>Control</strong>. You have control over your own backups, and you can update the server yourself so that its security is always up-to-date.</li>\n<li><strong>Price</strong>. There are many low-cost Virtual Private Servers (VPSs) now, some of which cost only $5 per month.</li>\n<li><strong>Storage</strong>. Many shared hosting providers now offer unlimited storage. This is useful if you have a large media library.</li>\n</ul>\n<p>In this tutorial, we&#39;ll be entering a few commands on the command line. This tutorial assumes no prior knowledge of the command line, but if you want a concise primer, consult the <a href=\"/lessons/intro-to-bash\">Programming Historian introduction to BASH</a>. There are other ways of installing Omeka, of course, some using exclusively GUI tools. Some hosting providers even offer &quot;<a href=\"https://omeka.org/classic/docs/GettingStarted/Hosting_Suggestions/\">one-click installs</a>&quot; via their control panels. Many of those methods, however, will install older versions of Omeka which are then harder to upgrade and maintain. The method outlined below may not be the easiest way to install Omeka, but it will give you some good practice with using the command line, which is a skill that will be useful if you want to manually upgrade your install, or manually install other web frameworks. (For example, this installation method is very similar to WordPress&#39;s <a href=\"https://codex.wordpress.org/Installing_WordPress\">&quot;Five-Minute Install&quot;</a>.) There are four steps to this process, and it should take about an hour.</p>\n<h2 id=\"step-1-set-up-your-host\">Step 1: Set Up Your Host</h2>\n<p>First, sign up for an account with a hosting provider that gives you SSH access. There are two main types of hosting providers: VPS and shared. A VPS host gives you root access, which means you have more control over the server, but your storage space is often limited. For small archives of 20GB or less, this is the best solution, but for large archives, shared hosting plans might be better suited. <a href=\"https://www.digitalocean.com/signup/\">DigitalOcean</a> is an easy-to-use and inexpensive VPS host, and <a href=\"http://aws.amazon.com/free/\">Amazon Web Services</a> (AWS) hosts similar virtual servers on their Elastic Computing (EC2) platform, geared more toward advanced users. Both <a href=\"http://www.hostgator.com/\">HostGator</a> and <a href=\"http://www.dreamhost.com\">DreamHost</a> offer inexpensive shared hosting with unlimited storage.</p>\n<p>If you open an account with a VPS provider, you&#39;ll first want to create a virtual server with their interface. (If you’re using shared hosting, this is already done for you.) On DigitalOcean, VPS instances are called &quot;droplets,&quot; and you can create one by simply logging in and clicking &quot;Create Droplet.&quot; On AWS EC2, a VPS is called an &quot;instance,&quot; and you can create one by logging into your EC2 console and clicking &quot;Launch Instance.&quot; In both cases, <strong>choose an Ubuntu system</strong> to install, since we&#39;ll be running Ubuntu Linux commands below. For more detailed help with these steps, check out Digital Ocean&#39;s guide <a href=\"https://web.archive.org/web/20170608220025/https://www.digitalocean.com/community/tutorials/how-to-create-your-first-digitalocean-droplet-virtual-server\">How To Create Your First DigitalOcean Droplet Virtual Server</a>, and Amazon&#39;s guide <a href=\"http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-launch-instance_linux.html\">Launch an Amazon EC2 Instance</a>.</p>\n<p>Now that you have a running server, connect to it with an SSH client. This is sometimes as simple as opening a terminal and typing <code>ssh root@hostname</code>, where <code>hostname</code> is your server address. Consult your host&#39;s documentation for instructions for logging on via SSH. Here is a sampling of guides for VPS hosts:</p>\n<ul>\n<li><a href=\"https://www.digitalocean.com/docs/droplets/how-to/connect-with-ssh\">Digital Ocean: How To Connect To Your Droplet with SSH</a></li>\n<li><a href=\"http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AccessingInstancesLinux.html\">Amazon Web Services: Connecting to Your Linux Instance Using SSH</a></li>\n</ul>\n<p>And here are a few guides for shared hosts:</p>\n<ul>\n<li><a href=\"https://help.dreamhost.com/hc/en-us/articles/216041267-SSH-overview\">DreamHost Wiki: SSH</a></li>\n<li><a href=\"http://support.hostgator.com/articles/hosting-guide/lets-get-started/how-do-i-get-and-use-ssh-access\">HostGator: How Do I Get and Use SSH Access?</a></li>\n</ul>\n<p>When you&#39;re connected, you should see a prompt that looks roughly like this:</p>\n<pre><code>user@host #\n</code></pre>\n<p>This is where we will be entering our commands.</p>\n<h2 id=\"step-2-install-your-server-and-database\">Step 2: Install Your Server and Database</h2>\n<p>The commands we’re about to run are a little different for VPS and shared hosting providers, so if you have a VPS, follow step 2A below, and if you have shared hosting, skip to step 2B.</p>\n<h3 id=\"step-2a-for-vps-hosting\">Step 2A: for VPS Hosting</h3>\n<p>First, we’ll need to install a LAMP software stack. LAMP stands for Linux, Apache, MySQL, and PHP, and it&#39;s the set of software that runs Omeka. Linux is the operating system that runs the server, Apache is the web serving software, MySQL is the database, and PHP is the language in which Omeka is written.</p>\n<p>Make sure you&#39;re logged in as the root user first. (The root user is a super-level user that has permission to run any command.) If you&#39;re root, typing <code>whoami</code> should return <code>root</code>; if it returns something different, switch users (<code>su</code>) to the root user with <code>su root</code> or <code>sudo su root</code>. Enter the root password you set up when you created your VPS, if asked. Now let&#39;s update our system:</p>\n<pre><code>apt-get update &amp;&amp; apt-get upgrade\n</code></pre>\n<p>Now that our system is up-to-date, let&#39;s install the server stack:</p>\n<pre><code>apt-get install lamp-server^\n</code></pre>\n<p>Be sure to include the caret (<code>^</code>) at the end. This should install a LAMP server, prompting you to enter a root MySQL password. Enter a secure password here, and write it down, because we&#39;ll be using it later.</p>\n<p>At this point, your web server should be serving web pages. If you can open your VPS public IP address in a web browser and see the Apache2 Ubuntu Default Page that says “It works!” then everything is running correctly. If not, you might need to take extra steps to ensure your ports are forwarding properly. On Amazon EC2, for instance, ports aren&#39;t automatically forwarded, so you have to add HTTP ports to the allowed inbound traffic for your current security group. Navigate to Network &amp; Security -&gt; Security Groups, select the security group you’re using, select the “Inbound” tab, and click “Edit,” adding HTML ports.</p>\n<p>Let&#39;s get the Apache module <code>mod_rewrite</code> enabled now, which allows Omeka to let you use custom URL paths:</p>\n<pre><code>a2enmod rewrite &amp;&amp; service apache2 restart\n</code></pre>\n<p>Now let’s set up the database. First, log in to the MySQL database program as the root user, by entering this command:</p>\n<pre><code>mysql -u root -p\n</code></pre>\n<p>The <code>-u</code> flag allows you to specify the user, and the <code>-p</code>, when not followed by a password, will prompt you for the root password. Enter the MySQL password you created when you installed the LAMP server. You should now see a <code>mysql&gt;</code> prompt. Now let&#39;s enter a command to create the database. I&#39;m going to call my database <code>jonreeve_omeka</code>, but you can call yours whatever you like.</p>\n<pre><code>CREATE DATABASE jonreeve_omeka CHARACTER SET utf8 COLLATE utf8_general_ci;\n</code></pre>\n<p>Here, <code>CHARACTER SET utf8 COLLATE utf8_general_ci</code> ensures that you can use the full character set in your web site, and not just the Latin character set. If the command succeeds, MySQL should tell you <code>Query OK, 1 row affected (0.00 sec)</code>. For the following commands, you should see <code>Query OK, 0 rows affected (0.00 sec)</code> if all goes well.</p>\n<p>Next, let&#39;s create a database user account, so that Omeka can talk to the database:</p>\n<pre><code>CREATE USER &#39;jonreeve_omeka&#39;@&#39;localhost&#39; IDENTIFIED by &#39;%8)&amp;2P^TFR2C&#39;;\n</code></pre>\n<p>I&#39;ve given my user the same name as my database for convenience, and I&#39;ve chosen <code>%8)&amp;2P^TFR2C</code> as my secure password. Now we can allow our new user to access our newly-created database by typing these commands:</p>\n<pre><code>GRANT ALL PRIVILEGES ON jonreeve_omeka.* TO &#39;jonreeve_omeka&#39;@&#39;localhost&#39;;\n</code></pre>\n<p>FLUSH PRIVILEGES;</p>\n<p>Your database should now be set up for use with Omeka. Type <code>exit;</code> or press Control+C to exit MySQL and return to your command line.</p>\n<h3 id=\"step-2b-for-shared-hosting\">Step 2B: for Shared Hosting</h3>\n<p>Follow this step if you&#39;re using a shared hosting provider. If you&#39;re on a VPS, you can skip to step 3.</p>\n<p>Log into your hosting provider&#39;s control panel and find an item called something like &quot;MySQL Databases.&quot; If your hosting provider uses cPanel, it looks like this:</p>\n<p>{% include figure.html filename=&quot;omeka-install-new-db.png&quot; caption=&quot;Install a New Database&quot; %}</p>\n<p>In the box labeled Create New Database, enter a database name. On shared hosting providers, the prefix will typically be your user name (mine is <code>jonreeve</code>), and you&#39;ll enter the rest. In this example, I chose to call my database <code>omeka</code>, so my full database name is <code>jonreeve_omeka</code>. Click &quot;create database.&quot;</p>\n<p>Once you&#39;ve done that, click to go back to the previous screen. Below the Create New Database box you&#39;ll see an area for creating new MySQL users. It looks like this:</p>\n<p>{% include figure.html filename=&quot;omeka-install-new-user.png&quot; caption=&quot;Create a New User&quot; %}</p>\n<p>In the box labeled <code>Username</code>, enter the same thing you entered for your database name (this is just a convention, and will help you to keep everything organized). I&#39;ll enter <code>omeka</code> again, so that the full user name reads <code>jonreeve_omeka</code>. It&#39;s a good idea to click &quot;generate password&quot; here, since that will make a very secure password. At this point, write down the database name (<code>jonreeve_omeka</code>), the user name (which should be the same as the database name), and the generated password, since you&#39;ll need these later.</p>\n<p>{% include figure.html filename=&quot;omeka-install-password.png&quot; caption=&quot;Generate Password&quot; %}</p>\n<p>Next, add the user you just created to the database. Just select the user and the database you created in the dropdown menus and click &quot;add&quot;:</p>\n<p>{% include figure.html filename=&quot;omeka-install-add-to-db.png&quot; caption=&quot;Add User to Database&quot; %}</p>\n<p>Your database is now set up, and you&#39;re ready to install Omeka.</p>\n<h2 id=\"step-3-download-and-install-omeka\">Step 3: Download and Install Omeka.</h2>\n<p>Now let&#39;s download Omeka directly to the server. This will allow us to avoid the process of downloading it locally, unzipping it there, and uploading it to the server, and we&#39;ll save a lot of time. To do this, let&#39;s first get to the public HTML directory. This is usually <code>/var/www/html</code>, but could also be <code>/var/www</code>, or, on some shared hosts, <code>~/public_html</code>. If you’re unsure, check with your host about where it keeps its public HTML directory.</p>\n<pre><code>cd /var/www/html\n</code></pre>\n<p>If you get a permissions error here on a VPS, make sure you&#39;re logged in as the root user with <code>su root</code>. Now let&#39;s download Omeka. Grab the URL from <a href=\"http://omeka.org/download\">http://omeka.org/download</a>, and use it with the command <code>wget</code> like this:</p>\n<pre><code>wget http://omeka.org/files/omeka-2.4.zip\n</code></pre>\n<p>Now let’s first make sure we have the <code>unzip</code> command:</p>\n<pre><code>apt-get install unzip\n</code></pre>\n<p>And now we can unzip the Omeka zip file:</p>\n<pre><code>unzip omeka-2.4.zip\n</code></pre>\n<p>(If you get an error here on a VPS, you may need to install the <code>unzip</code> command with <code>apt-get install unzip</code> first.) This will unzip Omeka to a subdirectory on your website. Presuming you don&#39;t want your Omeka web site to have the URL <code>http://your-domain.com/omeka-2.4/</code>, let&#39;s change the name of the directory:</p>\n<pre><code>mv omeka-2.4 omeka\n</code></pre>\n<p>(Instead of <code>omeka-2.4</code>, substitute the version you downloaded.) Now you have an Omeka install which is ready to connect to the database.</p>\n<h2 id=\"step-4-configure-omeka-to-use-your-database\">Step 4: Configure Omeka to Use Your Database.</h2>\n<p>First, go into the directory where your Omeka install lives, using the command <code>cd</code>. On a VPS, that&#39;s probably <code>/var/www/html/omeka</code>, and on shared hosting, <code>~/public_html/omeka</code>.</p>\n<pre><code>cd /var/www/html/omeka\n</code></pre>\n<p>If you get a permissions error here using a VPS, make sure you&#39;re logged in as the root user first by running <code>su root</code>.\nNow let&#39;s edit the <code>db.ini</code> file. Unless you&#39;re already comfortable with a power editor like Vim, we&#39;re going to use the editor Nano:</p>\n<pre><code>nano db.ini\n</code></pre>\n<p>That will give you something that looks like this:</p>\n<p>{% include figure.html filename=&quot;omeka-install-db-ini-before.png&quot; caption=&quot;Db.ini, Before&quot; %}</p>\n<p>Now you can edit your file, changing the <code>XXXXXXXX</code> values to the appropriate values for your system, but keeping the double quotes (<code>&quot;</code>) intact. The field <code>host</code> should be <code>localhost</code>, since the database is on the same server. For <code>username</code> and <code>dbname</code>, enter the user name, password, and database name you generated in step 2. For my setup, these values are:</p>\n<ul>\n<li><code>host = &quot;localhost&quot;</code></li>\n<li><code>username = &quot;jonreeve_omeka&quot;</code></li>\n<li><code>password = &quot;%8)&amp;2P^TFR2C&quot;</code></li>\n<li><code>dbname = &quot;jonreeve_omeka&quot;</code></li>\n</ul>\n<p>The file will end up looking like this:</p>\n<p>{% include figure.html filename=&quot;omeka-install-db-ini-after.png&quot; caption=&quot;Db.ini, After&quot; %}</p>\n<p>Exit (Control+X) and when asked, save your changes by pressing <code>Y</code>. Now let&#39;s change the owner of our Omeka installation, so that it&#39;s readable by the Internet:</p>\n<pre><code>chown -R www-data:www-data .\n</code></pre>\n<p> Now you should have a working Omeka install. You can access your installation script at <code>http://your-domain/omeka/install/install.php</code>, replacing <code>your-domain</code> with your domain name or IP address, and <code>omeka</code> with the name you gave your directory above. Fill out the form there to get started configuring your Omeka install. If you run into any trouble along the way, consult the <a href=\"https://omeka.org/codex/Installation\">Omeka Installation Guide</a> or the <a href=\"https://omeka.org/codex/Troubleshooting_Omeka\">Omeka Troubleshooting Guide</a>.</p>\n"}