{"metadata":{"title":"Introducción a la publicación web de archivos TEI con CETEIcean","collection":"lessons","layout":"lesson","slug":"publicar-archivos-tei-ceteicean","date":"2021-12-14T00:00:00.000Z","authors":["Gabriel Calarco","Gimena del Río Riande"],"reviewers":["Melissa Jerome","Aldo Barriente"],"editors":["Joshua G. Ortiz Baco"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/373","difficulty":2,"activity":"transforming","topics":["website"],"abstract":"Esta lección te enseña los pasos necesarios para publicar en línea un archivo de TEI usando CETEIcean","avatar_alt":"Grabado que representa distintas fuentes tipográficas","doi":"10.46430/phes0056"},"html_body":"<p>{% include toc.html %}</p>\n<hr>\n<p><strong>Nota:</strong> Para seguir este tutorial de forma comprensiva debes saber qué es el lenguaje de marcado XML-TEI desarrollado por la <a href=\"https://tei-c.org/\">Text Encoding Initiative o TEI</a> y cuál es su función como lenguaje estándar en la edición digital académica de textos de Ciencias Sociales y Humanidades. Puedes encontrar recursos y tutoriales en español sobre codificación de textos con TEI en <a href=\"https://tthub.io/\">TTHub</a>. Asimismo, te recomendamos las partes 1 y 2 de la lección <a href=\"/es/lecciones/introduccion-a-tei-1\">Introducción a la codificación de textos en TEI de Nicolás Vaughan</a> y la <a href=\"https://tthub.io/aprende/introduccion-a-tei/\">Introducción a la Text Encoding Initiative de Susanna Allés</a>. Durante este tutorial se utilizarán otros lenguajes informáticos (como <a href=\"https://www.javascript.com/\">JavaScript</a> y <a href=\"https://es.wikipedia.org/wiki/Hoja_de_estilos_en_cascada\">CSS</a>), pero no es necesario tener conocimientos previos sobre su funcionamiento para utilizar <a href=\"https://github.com/TEIC/CETEIcean\">CETEIcean</a>.</p>\n<h2 id=\"introducción-y-software-que-usaremos\">Introducción y software que usaremos</h2>\n<p>Para quienes se inician en el uso de TEI, uno de los escollos más comunes es que, una vez que se han codificado los textos con este lenguaje de marcado, es difícil saber cómo hacer para publicarlos en línea. Para ser visualizados en un navegador, los archivos XML-TEI deben ser transformados primero a <a href=\"https://es.wikipedia.org/wiki/HTML\">HTML</a> mediante el uso de plantillas <a href=\"https://es.wikipedia.org/wiki/Extensible_Stylesheet_Language_Transformations\">XSLT</a>. Sin embargo, este proceso requiere de conocimientos técnicos y herramientas que no siempre se encuentran al alcance de todos los humanistas digitales, especialmente de quienes se acercan al uso de TEI por primera vez, de quienes aún no conocen en profundidad el manejo de software de edición, o de quienes no cuentan con acceso a servidores propios. CETEIcean es un software de edición digital que permite visualizar archivos XML-TEI en el navegador sin que necesitemos aplicarles una transformación XSLT.</p>\n<p>Este tutorial te guiará a través de los pasos necesarios para publicar un archivo TEI en línea utilizando CETEIcean, una librería abierta escrita en el lenguaje de programación JavaScript. CETEIcean permite que los documentos TEI se muestren en un navegador web sin transformarlos primero a HTML. CETEIcean carga el archivo TEI dinámicamente en el navegador y cambia el nombre de los elementos de TEI por otros en HTML, de tal forma que estos nos permitan visualizar en el navegador web los fenómenos textuales que marcamos en nuestros archivos usando TEI.</p>\n<p>En primer lugar, una aclaración sobre la visualización de tu trabajo: el método por defecto de CETEIcean para mostrar archivos TEI consiste en cargar los archivos desde otra ubicación. Sin embargo, no todos los navegadores te permitirán cargar los archivos si estos se encuentran almacenados en tu computadora. Puedes hacer el intento, pero si eso no funciona, tendrás que generar un servidor local, colocar los archivos en un servidor en línea, o utilizar un editor de código con funciones de previsualización. Para el caso de este tutorial, seguiremos esta última opción, ya que usaremos el editor <a href=\"https://atom.io\">Atom</a>, con el plug-in <code>atom-html-preview</code>. No obstante, existen otras opciones libres para editar archivos TEI y generar previsualizaciones de HTML, como <a href=\"http://www.jedit.org/\">jEdit</a> o <a href=\"https://code.visualstudio.com/\">Visual Studio Code</a>, y versiones propietarias como <a href=\"https://www.oxygenxml.com/\">Oxygen</a>.</p>\n<p>Deberás entonces descargar e instalar <a href=\"https://atom.io\">Atom</a> antes de continuar con este tutorial. Con Atom ya funcionando, instala el plug-in <code>atom-html-preview</code> (creado por Kyle J. Harms) que podrás encontrar abriendo el menú de opciones de Atom (file &gt; settings o cntrl+). En la pantalla de &quot;Settings&quot; ve a la pestaña &quot;Install&quot; y en el cuadro de diálogo introudce <code>atom-html-preview</code>. Cuando aparezca el plug-in que estamos buscando en la lista de resultado debes hacer clic en el botón azul que dice &quot;Install&quot;:</p>\n<p>{% include figure.html filename=&quot;publicar-archivos-tei-ceteicean1.png&quot; caption=&quot;Proceso de instalación del plug-in de Atom para previsualizar archivos en HTML&quot; %}</p>\n<p>Usaremos como texto de prueba la crónica conocida como <em>La Argentina Manuscrita</em>, del hispano-guaraní <a href=\"https://es.wikipedia.org/wiki/Ruy_D%C3%ADaz_de_Guzm%C3%A1n\">Ruy Díaz de Guzmán</a>. Este texto del siglo XVII hace uso del topónimo Argentina por primera vez, para referirse a los extensos territorios del Cono Sur que componían el Río de la Plata y sus adyacencias, es decir, territorios de la actual Argentina, Paraguay, Uruguay, sur de Brasil y Bolivia. Puedes encontrar una edición digital completa del texto en: <a href=\"http://hdlab.space/La-Argentina-Manuscrita\">http://hdlab.space/La-Argentina-Manuscrita</a>.</p>\n<p>Comenzaremos con un archivo simple (aunque un tanto extenso) en formato TEI P5, que queremos hacer visible en un navegador web: <a href=\"http://hdlab.space/La-Argentina-Manuscrita/assets/Ruy_Diaz-La_argentina_manuscrita.tei.xml\"><code>Ruy_Diaz-La_Argentina_Manuscrita.xml</code></a>. Para descargar el archivo haz clic derecho sobre el enlace de descarga y selecciona la opción &#39;Save Link As...&#39;.</p>\n<h2 id=\"paso-1-crear-una-estructura-para-nuestros-archivos\">Paso 1: Crear una estructura para nuestros archivos</h2>\n<p>Comenzaremos por establecer una estructura para nuestros archivos, es decir, una carpeta contenedora con el nombre &#39;tutorial_es&#39; con las subcarpetas y archivos que te indicaremos a continuación. Puedes descargar el directorio completo del repositorio <a href=\"https://github.com/TEIC/CETEIcean\">CETEIcean en GitHub</a> y trabajar en la carpeta &#39;tutorial_es&#39;, o puedes descargar los archivos individualmente, siempre y cuando mantengan la misma estructura que en GitHub, que es la siguiente:</p>\n<pre><code>  tutorial_es/\n      |\n      |--- css/\n            |\n            |--- tei.css\n      |\n      |--- js/\n            |\n            |--- CETEI.js\n      |\n      |--- Ruy_Diaz-La_Argentina_Manuscrita.xml\n      |--- README.md (el archivo que estas leyendo)\n</code></pre>\n<p>El siguiente paso será crear un archivo nuevo en Atom con el nombre <code>index.html</code>. Para ello puedes ir a File &gt; New o utilizar el atajo Ctrl + N (Cmd + N en Mac). En este documento deberás copiar y pegar el siguiente contenido:</p>\n<pre><code class=\"language-html\">&lt;!DOCTYPE html&gt;\n&lt;html&gt;\n&lt;head&gt;\n  &lt;meta charset=&quot;UTF-8&quot;&gt;\n  &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1.0&quot;&gt;\n  &lt;meta http-equiv=&quot;X-UA-Compatible&quot; content=&quot;ie=edge&quot;&gt;\n\n&lt;/head&gt;\n&lt;body&gt;\n\n&lt;/body&gt;\n&lt;/html&gt;\n</code></pre>\n<p>A continuación, debes guardar este archivo en el directorio raíz (en nuestro caso la carpeta &#39;tutorial_es&#39;); recuerda que su título debe ser <code>index.html</code>. Este archivo servirá como una estructura en la cual pondremos las instrucciones para mostrar nuestros archivos TEI. Al igual que en TEI, los archivos HTML tienen un encabezado, llamado <code>head</code> y un cuerpo de texto, llamado <code>body</code>. A lo largo de este tutorial usaremos este archivo para agregar enlaces a nuestra CSS (<em>Cascading Style Sheet</em>, también llamada <em>hoja de estilo</em> u <a href=\"https://es.wikipedia.org/wiki/Hoja_de_estilos_en_cascada\"><em>hoja de estilos en cascada</em></a> en español) y a nuestros archivos de JavaScript, y escribiremos un poco de JavaScript para lograr una visualización de nuestro documento TEI que refleje los aspectos del marcado que nos interesa destacar. En la primera línea vacía del <code>&lt;head&gt;</code>, escribe:</p>\n<pre><code class=\"language-html\">  &lt;link rel=&quot;stylesheet&quot; href=&quot;css/tei.css&quot;&gt;\n</code></pre>\n<p>Esto conectará nuestro archivo CSS con nuestra página HTML, dándole acceso a las directivas de estilo que este contiene (solo hay unas pocas, pero agregaremos más). A continuación, incluiremos la librería de CETEIcean, añadiendo la siguiente línea luego del enlace a la hoja de estilo:</p>\n<pre><code class=\"language-html\">  &lt;script src=&quot;js/CETEI.js&quot;&gt;&lt;/script&gt;\n</code></pre>\n<p>En este punto nuestro archivo <code>index.html</code> debe tener el siguiente contenido:</p>\n<pre><code class=\"language-html\">&lt;!DOCTYPE html&gt;\n&lt;html&gt;\n&lt;head&gt;\n  &lt;meta charset=&quot;UTF-8&quot;&gt;\n  &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1.0&quot;&gt;\n  &lt;meta http-equiv=&quot;X-UA-Compatible&quot; content=&quot;ie=edge&quot;&gt;\n&lt;!-- Líneas agregadas --&gt;\n&lt;link rel=&quot;stylesheet&quot; href=&quot;css/tei.css&quot;&gt;\n&lt;script src=&quot;js/CETEI.js&quot;&gt;&lt;/script&gt;\n&lt;!-- Líneas agregadas --&gt;\n&lt;/head&gt;\n&lt;body&gt;\n\n&lt;/body&gt;\n&lt;/html&gt;\n</code></pre>\n<h2 id=\"paso-2-cargar-y-previsualizar-el-archivo-tei\">Paso 2: Cargar y previsualizar el archivo TEI</h2>\n<p>Ahora ya estamos listos para cargar el archivo TEI. Para eso, debemos añadir una secuencia de comandos informáticos conocida habitualmente por su nombre en inglés <a href=\"https://es.wikipedia.org/wiki/Script\">&quot;script&quot;</a>, que nos permitirá recuperar el documento TEI de <em>La Argentina manuscrita</em> en nuestro archivo HTML (el que estamos editando en este momento). Copia y pega las siguientes líneas de código a continuación del último elemento que agregamos:</p>\n<pre><code class=\"language-html\">&lt;script&gt;\nlet c = new CETEI();\n c.getHTML5(&#39;Ruy_Diaz-La_Argentina_Manuscrita.xml&#39;, function(data) {\n   document.getElementsByTagName(&quot;body&quot;)[0].appendChild(data);\n });\n&lt;/script&gt;\n</code></pre>\n<p>No necesitas ser un experto en JavaScript para usar CETEIcean, pero aprender su funcionamiento básico puede ser de utilidad. Si deseas incluir funciones avanzadas, tendrás que aprender JavaScript. En la red para desarrolladores de Mozilla puedes encontrar una excelente <a href=\"https://developer.mozilla.org/es/docs/Web/JavaScript/Guide\">guía de JavaScript</a> en varias lenguas, incluido el español. Para el caso de este tutorial, solo te contaremos que las líneas de código que añadimos hacen varias cosas:</p>\n<ul>\n<li>En primer lugar, una variable <code>c</code> es definida como un nuevo objeto CETEI. Esto hará el trabajo de cargar y darle estilo a nuestro archivo fuente</li>\n<li>A continuación, le indicaremos a <code>c</code> que cargue el archivo fuente y lo convierta en HTML (<a href=\"https://lenguajejs.com/webcomponents/nativos/bases-custom-elements/\">Custom Elements</a>), y también le daremos una función que tomará los resultados y los pondrá en el <code>&lt;body&gt;</code>de nuestro archivo <code>index.html</code></li>\n<li>En la línea <code>document.getElementsByTagName(&#39;body&#39;)</code> se llama a una función que busca todos los elementos <code>&lt;body&gt;</code> y los devuelve en la forma de una lista ordenada (una lista en la cual se puede acceder a los miembros que la componen a través de su número índice)</li>\n<li>En nuestro ejemplo solo hay un elemento <code>&lt;body&gt;</code>, por lo que obtendremos una sola entrada en nuestra lista, con el índice 0. Este ítem, que es un elemento HTML, queda adjunto como un hijo del documento TEI que acabamos de cargar</li>\n</ul>\n<p>En este punto deberías poder ejecutar una previsualización del HTML desde el menú &quot;Packages&quot; y así ver tu documento. Vamos a previsualizarlo con el plug-in que instalamos al inicio de este tutorial. Entonces, ve a la pestaña packages del menú superior y elige en el menú desplegable la opción &quot;Preview HTML / Enable preview&quot;:</p>\n<p>{% include figure.html filename=&quot;publicar-archivos-tei-ceteicean2.png&quot; caption=&quot;Menú de opciones para previsualizar archivos en HTML en Atom&quot; %}</p>\n<p>{% include figure.html filename=&quot;publicar-archivos-tei-ceteicean3.png&quot; caption=&quot;Primera previsualización de nuestro archivo TEI con CETEIcean&quot; %}</p>\n<p>Si no estás usando Atom, puedes hacer esto mismo colocando tus archivos en un servidor web. Si conoces el funcionamiento de GitHub, puedes utilizar GitHub Pages (aquí tienes un <a href=\"https://guides.github.com/features/pages/\">tutorial</a> en inglés) y crear un repositorio. Si tienes instalado Python en tu computadora, puedes ejecutar un servidor web simple en el directorio de este tutorial (en nuestro caso la carpeta &#39;tutorial_es&#39;). Con este fin debes abrir la consola de comandos y comprobar que te encuentras en la carpeta deseada (en caso contrario puedes navegar hasta esa carpeta con el comando <code>cd + url del archivo</code>, por ejemplo: <code>cd Documentos/tutorial_es</code> ) e ingresar el comando:</p>\n<pre><code class=\"language-bash\">python -m SimpleHTTPServer\n</code></pre>\n<p>También es posible que tu computadora ya tenga los programas necesarios para ejecutar un servidor web, o puedes instalar <a href=\"https://www.mamp.info\">MAMP</a> o algún otro programa similar. El objetivo de crear este servidor es vusualizar nuestros archivos TEI en el navegador como si estos se trataran de un contenido online.</p>\n<h2 id=\"paso-3-mejorar-la-visualización-de-nuestro-archivo\">Paso 3: Mejorar la visualización de nuestro archivo</h2>\n<p>Esta primera visualización tendrá varios errores que deberemos arreglar. Para eso volveremos a nuestro trabajo en Atom. Comenzaremos por añadir una hoja de estilo para manipular los elementos de TEI en nuestro archivo y luego añadiremos funciones de CETEIcean para hacer modificaciones más complejas. Si todavía no le has echado un vistazo al archivo fuente XML, es un buen momento para hacerlo, para ver lo que CETEIcean ya está haciendo y lo que no. Podemos observar que el contenido del <code>teiHeader</code> no está siendo mostrado, como tampoco los comienzos de página y comienzos de líneas. Los elementos <code>div</code> y <code>p</code>, por su parte, están siendo formateados como bloques y las notas aparecen en el cuerpo del texto entre paréntesis. Con un poco de investigación sobre las posibilidades de codificación de la TEI, verás que hay siete tipos de elementos TEI en el <code>body</code> de nuestro documento fuente:  </p>\n<ul>\n<li><a href=\"https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-div.html\">div</a></li>\n<li><a href=\"https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-head.html\">head</a></li>\n<li><a href=\"https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-note.html\">note</a></li>\n<li><a href=\"https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-p.html\">p</a></li>\n<li><a href=\"https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-persName.html\">persName</a></li>\n<li><a href=\"https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-placeName.html\">placeName</a></li>\n<li><a href=\"https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-rs.html\">rs</a></li>\n</ul>\n<p>Algunos de estos elementos pueden no necesitar estilos o comportamientos especiales, pero otros definitivamente lo necesitarán.\nEcha un vistazo al archivo <code>tei.css</code> de la carpeta <code>css/</code>. Como puedes ver, por ahora tiene solo unas pocas reglas:</p>\n<pre><code class=\"language-css\">tei-div {\n  display: block;\n}\ntei-p {\n  display: block;\n  margin-top: .5em;\n  margin-bottom: .5em;\n}\n</code></pre>\n<p>Algunas cosas para tener en cuenta: los nombres de los elementos en nuestros selectores CSS tienen el prefijo <code>tei-</code>. Esto es necesario para que CETEIcean pueda convertir los elementos de TEI en elementos personalizados (<a href=\"https://lenguajejs.com/webcomponents/nativos/bases-custom-elements/\">Custom Elements</a>) de HTML. Estas reglas establecen que los elementos <code>&lt;div&gt;</code> se visualicen como bloques (empiezan en una nueva línea y terminan con un corte); lo mismo sucede con los párrafos, que también tienen un espaciado superior e inferior.</p>\n<p>Decidir qué estilos aplicar a los elementos que todavía no tienen reglas de estilo puede no resultar sencillo, pero podemos comenzar eligiendo algunos de los casos más simples. En nuestro documento fuente se señalan los encabezados de los capítulos y de las diferentes secciones mediante el elemento <code>&lt;head&gt;</code>. Probablemente desearemos que estos encabezados se destaquen del cuerpo del texto, para lograrlo podemos utilizar CSS para darles un estilo diferente. Ahora debes abrir el archivo <code>tei.css</code> (que encontrarás en la carpeta &quot;css&quot;) en Atom y al final del documento agregar las siguientes líneas:</p>\n<pre><code class=\"language-css\">tei-head {\n  font-size: 2em;\n  font-weight: bold;\n}\n</code></pre>\n<p>Verás que esta no es una solución perfecta, ya que tenemos diferentes niveles de elementos <code>&lt;div&gt;</code>, y sería apropiado que los encabezados de diferentes niveles tuvieran diferentes tamaños para identificarlos. Debido a que los elementos <code>&lt;div&gt;</code> de nuestro archivo TEI no indican a qué nivel pertenecen, esto puede resultar difícil de lograr con CSS.  Sin embargo, también podemos utilizar los comportamientos (behaviors) de CETEIcean para dar formato.</p>\n<p>En HTML, la convención es representar los diferentes niveles de encabezados con los elementos <code>h1</code>, <code>h2</code>, <code>h3</code>, etcétera (hasta <code>h6</code>). Podemos lograr esto utilizando un comportamiento. Para ello, en tu archivo <code>index.html</code> añade lo siguiente entre la primera y la segunda línea del código que se encuentra entre las etiquetas <code>&lt;script&gt;&lt;/script&gt;</code> (es decir, entre <code>&quot;let c = new CETEI();&quot;</code> y <code>&quot;c.getHTML5(&#39;Ruy_Diaz-La_Argentina_Manuscrita.xml&#39;…&quot;</code>):</p>\n<pre><code class=\"language-js\">  let comportamientos = {\n    &quot;tei&quot;: {\n      &quot;head&quot;: function(e) {\n        let nivel = document.evaluate(&quot;count(ancestor::tei-div)&quot;, e, null, XPathResult.NUMBER_TYPE, null);\n        let resultado = document.createElement(&quot;h&quot; + nivel.numberValue);\n        for (let n of Array.from(e.childNodes)) {\n          resultado.appendChild(n.cloneNode());\n        }\n        return resultado;\n      }    \n    }\n  };\n  c.addBehaviors(comportamientos);\n</code></pre>\n<p>Esto creará un objeto Javascript y le asignará la variable <code>comportamientos</code>, que luego enlazaremos con el objeto <code>CETEI</code> que creamos antes, usando el método <code>addBehaviors</code> (que ya viene incluido en CETEIcean). En el interior de ese objeto tenemos una sección etiquetada como “tei” (que es el prefijo para todos nuestros elementos personalizados), y dentro de esta se definen los comportamientos para los elementos. Cuando CETEIcean encuentra una coincidencia para el nombre de un elemento, como “head” (ten en cuenta que se utiliza el nombre de TEI sin el prefijo), aplica los comportamientos correspondientes.</p>\n<p>Este nuevo comportamiento toma una función de JavaScript, lo que hace que el elemento sea procesado como un parámetro (el <code>e</code>). Esto crea la variable <code>nivel</code>, que contiene el nivel de encabezamiento de la <code>&lt;tei-div&gt;</code> que contiene el <code>&lt;tei-head&gt;</code>, crea un elemento <code>&lt;h[nivel]&gt;</code> con el nivel correspondiente, y copia el contenido del elemento original en el nuevo elemento de encabezado. CETEIcean esconderá el contenido de <code>&lt;tei-head&gt;</code> y, en cambio, mostrará el contenido del nuevo elemento de encabezado. Ten en cuenta que este código tiene un problema potencial: un documento con muchas divisiones anidadas unas dentro de otras podría llegar a producir un elemento de encabezado superior al límite admitido por HTML (por ejemplo un elemento <code>&lt;h7&gt;</code>). Nuestro documento fuente no tiene más de dos niveles de anidamiento, pero para utilizarlo en otras fuentes sería prudente revisar que el anidamiento no supere el nivel del elemento <code>&lt;h6&gt;</code>.</p>\n<p>Si en este punto previsualizamos nuestro HTML en Atom, obtendremos el siguiente el resultado:</p>\n<p>{% include figure.html filename=&quot;publicar-archivos-tei-ceteicean4.png&quot; caption=&quot;Previsualización de nuestro archivo TEI con estilo para los títulos&quot; %}</p>\n<p>Con esta previsualización hemos mejorado notablemente la presentación de nuestro documento, pero las notas de la edición todavía dificultan la lectura del texto. Para solucionar este problema agregaremos un comportamiento más a nuestro script. Sin embargo, para lograr este objetivo, tendremos que usar una secuencia de comandos un tanto más extensa y compleja que la anterior. Copia y pega el siguiente texto entre las líneas <code>&quot;tei&quot;: {</code> y <code>&quot;head&quot;: function(e) {</code> que se encuentran en el segundo elemento <code>&lt;script&gt;</code> de nuestro documento <code>index.html</code>:</p>\n<pre><code class=\"language-js\">    &quot;note&quot;: function(e){\n    if (!this.noteIndex){\n      this[&quot;noteIndex&quot;] = 1;\n    } else {\n      this.noteIndex++;\n    }    \n    /* El primer bloque verifica si hay notas en el texto y las ordena en una secuencia*/\n\n    let id = &quot;note&quot; + this.noteIndex;\n    let link = document.createElement(&quot;a&quot;);\n    link.setAttribute(&quot;id&quot;, &quot;src&quot; + id);\n    link.setAttribute(&quot;href&quot;, &quot;#&quot; + id);\n    link.innerHTML = this.noteIndex;\n    let content = document.createElement(&quot;sup&quot;);\n    if (e.previousSibling.localName == &quot;tei-note&quot;) {\n      content.appendChild(document.createTextNode(&quot;,&quot;));\n    }\n    /* El segundo bloque le añade un número a cada nota*/\n\n    content.appendChild(link);\n    let notes = this.dom.querySelector(&quot;ol.notes&quot;);\n    if (!notes) {\n      notes = document.createElement(&quot;ol&quot;);\n      notes.setAttribute(&quot;class&quot;, &quot;notes&quot;);\n      this.dom.appendChild(notes);\n    }\n    /* El tercer bloque crea una sección de notas al final del documento*/\n\n    let note = document.createElement(&quot;li&quot;);\n    note.id = id;\n    note.innerHTML = &quot;&lt;a href=\\&quot;#src&quot; + id + &quot;\\&quot;&gt;^&lt;/a&gt; &quot; + e.innerHTML\n    notes.appendChild(note);\n    return content;\n  },\n    /* Finalmente, el cuarto bloque crea una lista con las notas y las enlaza con las referencias en el cuerpo del texto*/\n</code></pre>\n<p>A los fines de completar este tutorial no es necesario entender el funcionamiento de cada línea de este comportamiento. Sin embargo, si observas el resultado de la previsualización, notarás que al incluirlo las notas aparecen al final del texto, hipervinculadas con sus respectivas referencias:</p>\n<p>{% include figure.html filename=&quot;publicar-archivos-tei-ceteicean5.png&quot; caption=&quot;Previsualización de nuestro archivo TEI con estilo para las notas&quot; %}</p>\n<h2 id=\"paso-4-para-seguir-trabajando-con-ceteicean\">Paso 4: Para seguir trabajando con CETEIcean</h2>\n<p>CETEIcean posee una cantidad de comportamientos integrados que puedes reemplazar o desactivar al agregarles valores. Si, por ejemplo, deseas mostrar el contenido del TEI Header (que está oculto por defecto), puedes añadir la siguiente línea a nuestro <code>&lt;script&gt;</code> debajo de <code>&quot;tei&quot;: {</code>:</p>\n<pre><code class=\"language-js\">  &quot;teiHeader&quot;: null,\n</code></pre>\n<p>Si haces esto, puede que desees agregar estilos de CSS o comportamientos para elegir la forma en la que se visualizará el contenido del TEI Header en el navegador.</p>\n<p>En este tutorial no agotamos todas las posibilidades para la presentación de nuestro documento fuente. Te invitamos a que continúes experimentando por tu cuenta en las diferentes formas en las que un marcado de TEI puede visualizarse en un navegador usando CETEICean. Puedes encontrar más información en <a href=\"http://teic.github.io/CETEIcean/\">CETEIcean</a>.</p>\n<h2 id=\"referencias\">Referencias</h2>\n<p>Allés Torrent, Susanna; del Rio Riande, Gimena, y Calarco, Gabriel. 2018-. <em>TTHub. Text Technologies Hub. Recursos sobre tecnologías del texto y edición digital</em>. <a href=\"https://tthub.io/\">https://tthub.io/</a></p>\n<p>Allés Torrent, Susanna. 2019. &quot;Introducción a la Text Encoding Initiative&quot;. <em>TTHUB. Text Technologies Hub: Recursos sobre tecnologías del texto y edición digital</em>. <a href=\"https://tthub.io/aprende/introduccion-a-tei/\">https://tthub.io/aprende/introduccion-a-tei/</a></p>\n<p>Atom. A hackable text editor for the 21st Century. <a href=\"https://atom.io\">https://atom.io</a></p>\n<p>Cayless, Hugh y Viglianti, Raffaele. CETEIcean. <a href=\"http://teic.github.io/CETEIcean/\">http://teic.github.io/CETEIcean/</a></p>\n<p>del Rio Riande, Gimena; De León, Romina, y Hernández, Nidia. 2019. <em>Historia de la conquista del Río de la Plata o La Argentina manuscrita</em>. <a href=\"http://hdlab.space/La-Argentina-Manuscrita/\">http://hdlab.space/La-Argentina-Manuscrita/</a></p>\n<p>Jedit. Programmer&#39;s text editor. Stable Version: 5.6.0. <a href=\"http://www.jedit.org/\">http://www.jedit.org/</a></p>\n<p>Oxygen. XML Editor. <a href=\"https://www.oxygenxml.com/\">https://www.oxygenxml.com/</a></p>\n<p>Vaughan, Nicolás. 2021. &quot;Introducción a la codificación de textos en TEI (parte 1)&quot;, <em>Programming Historian en español</em> 5 (2021), <a href=\"https://doi.org/10.46430/phes0053\">https://doi.org/10.46430/phes0053</a></p>\n<p>Visual Studio Code. <a href=\"https://code.visualstudio.com/\">https://code.visualstudio.com/</a></p>\n"}