{"metadata":{"title":"Exploring and Analyzing Network Data with Python\n","authors":["John R. Ladd","Jessica Otis","Christopher N. Warren","Scott Weingart"],"reviewers":["Elisa Beshero-Bondar","Anne Chao","Qiwei Li"],"editors":["Brandon Walsh"],"difficulty":2,"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/92","layout":"lesson","collection":"lessons","slug":"exploring-and-analyzing-network-data-with-python","activity":"analyzing","topics":["network-analysis"],"date":"2017-08-23T00:00:00.000Z","abstract":"This lesson introduces network metrics and how to draw conclusions from them when working with humanities data. You will learn how to use the NetworkX Python package to produce and work with these network statistics.","redirect_from":"/lessons/exploring-and-analyzing-network-data-with-python","avatar_alt":"Train tracks intersecting","doi":"10.46430/phen0064"},"html_body":"<p>{% include toc.html %}</p>\n<h1 id=\"introduction\">Introduction</h1>\n<h2 id=\"lesson-goals\">Lesson Goals</h2>\n<p>In this tutorial, you will learn:</p>\n<ul>\n<li>To use the <a href=\"https://networkx.github.io/documentation/stable/index.html\"><strong>NetworkX</strong></a> package for working with network data in <a href=\"/lessons/introduction-and-installation\"><strong>Python</strong></a>; and</li>\n<li>To analyze humanities network data to find:<ul>\n<li>Network structure and path lengths,</li>\n<li>Important or central nodes, and</li>\n<li>Communities and subgroups</li>\n</ul>\n</li>\n</ul>\n<p><strong>n.b.:</strong> This is a tutorial for exploring network statistics and metrics. We will therefore focus on ways to analyze, and draw conclusions from, networks without visualizing them. You&#39;ll likely want a combination of visualization and network metrics in your own project, and so we recommend this article as a companion to <a href=\"/lessons/creating-network-diagrams-from-historical-sources\">this earlier Programming Historian tutorial</a>.</p>\n<h2 id=\"prerequisites\">Prerequisites</h2>\n<p>This tutorial assumes that you have:</p>\n<ul>\n<li>a basic familiarity with networks and/or have read  <a href=\"/lessons/creating-network-diagrams-from-historical-sources\">&quot;From Hermeneutics to Data to Networks: Data Extraction and Network Visualization of Historical Sources&quot;</a> by Martin Düring here on <em>Programming Historian</em>;</li>\n<li>Installed Python 3, not the Python 2 that is installed natively in Unix-based operating systems such as Macs (If you need assistance installing Python 3, check out the <a href=\"http://docs.python-guide.org/en/latest/starting/installation/\">Hitchhiker&#39;s Guide to Python</a>); and</li>\n<li>Installed the <code>pip</code> package installer.[^pipinstall]</li>\n</ul>\n<p>It&#39;s possible to have two versions of Python (2 <em>and</em> 3) installed on your computer at one time. For this reason, when accessing Python 3 you will often have to explicitly declare it by typing <code>python3</code> and <code>pip3</code> instead of simply <code>python</code> and <code>pip</code>. Check out the <em>Programming Historian</em> tutorials on <a href=\"/lessons/introduction-and-installation\">installing Python</a> and <a href=\"/lessons/installing-python-modules-pip\">working with pip</a> for more information.</p>\n<h2 id=\"what-might-you-learn-from-network-data\">What might you learn from network data?</h2>\n<p>Networks have long interested researchers in the humanities, but many recent scholars have progressed from a largely qualitative and metaphoric interest in links and connections to a more formal suite of quantitative tools for studying mediators, hubs (important nodes), and inter-connected structures. As sociologist Mark Granovetter pointed out in his important 1973 article “<a href=\"https://snap.stanford.edu/class/cs224w-readings/granovetter73weakties.pdf\">The Strength of Weak Ties</a>,” it’s rarely enough to notice that two people were connected with one another.  Factors such as their structural relation to further people and whether those additional people were themselves connected to one another have decisive influence on events.   Insofar as even the most perceptive of scholars has difficulty perceiving, say, the overall shape of a network (its network &quot;topology&quot;) and identifying the nodes most significant for connecting groups, quantitative network analysis offers scholars a way to move relatively fluidly between the large scale social object (the &quot;graph&quot;) and the minute particularities of people and social ties.</p>\n<p>This tutorial will help you answer questions such as:</p>\n<ul>\n<li>What is the overall structure of the network?</li>\n<li>Who are the important people, or hubs, in the network?</li>\n<li>What are the subgroups and communities in the network?</li>\n</ul>\n<h2 id=\"our-example-the-society-of-friends\">Our example: the Society of Friends</h2>\n<p>Before there were Facebook friends, there was the Society of Friends, known as the Quakers. Founded in England in the mid-seventeenth century, the Quakers were Protestant Christians who dissented from the official Church of England and promoted broad religious toleration, preferring Christians&#39; supposed &quot;inner light&quot; and consciences to state-enforced orthodoxy. Quakers&#39; numbers grew rapidly in the mid- to late-seventeenth century and their members spread through the British Isles, Europe, and the New World colonies---especially Pennsylvania, founded by Quaker leader William Penn and the home of your four authors.</p>\n<p>Since scholars have long linked Quakers&#39; growth and endurance to the effectiveness of their networks, the data used in this tutorial is a list of names and relationships among the earliest seventeenth-century Quakers. This dataset is derived from the <em><a href=\"http://www.oxforddnb.com\">Oxford Dictionary of National Biography</a></em> and from the ongoing work of the <em><a href=\"http://www.sixdegreesoffrancisbacon.com\">Six Degrees of Francis Bacon</a></em> project, which is reconstructing the social networks of early modern Britain (1500-1700).</p>\n<h1 id=\"data-prep-and-networkx-installation\">Data Prep and NetworkX Installation</h1>\n<p>Before beginning this tutorial, you will need to download two files that together constitute our network dataset. The file <a href=\"/assets/exploring-and-analyzing-network-data-with-python/quakers_nodelist.csv\" download=\"quakers_nodelist.csv\">quakers_nodelist.csv</a> is a list of early modern Quakers (nodes) and the file <a href=\"/assets/exploring-and-analyzing-network-data-with-python/quakers_edgelist.csv\" download=\"quakers_edgelist.csv\">quakers_edgelist.csv</a> is a list of relationships between those Quakers (edges). To download these files, simply right-click on the links and select &quot;Save Link As...&quot;.</p>\n<p>It will be extremely helpful to familiarize yourself with the structure of the dataset before continuing. For more on the general structure of network datasets, see <a href=\"/lessons/creating-network-diagrams-from-historical-sources#developing-a-coding-scheme\">this tutorial</a>. When you open the node file in the program of your choice, you will see that each Quaker is primarily identified by their name. Each Quaker node also has a number of associated attributes including historical significance, gender, birth/death dates, and SDFB ID---a unique numerical identifier that will enable you to cross-reference nodes in this dataset with the original <em>Six Degrees of Francis Bacon</em> dataset, if desired. Here are the first few lines:</p>\n<pre><code>Name,Historical Significance,Gender,Birthdate,Deathdate,ID\nJoseph Wyeth,religious writer,male,1663,1731,10013191\nAlexander Skene of Newtyle,local politician and author,male,1621,1694,10011149\nJames Logan,colonial official and scholar,male,1674,1751,10007567\nDorcas Erbery,Quaker preacher,female,1656,1659,10003983\nLilias Skene,Quaker preacher and poet,male,1626,1697,10011152\n</code></pre>\n<p>Notice that though the columns don&#39;t line up correctly like they do in a spreadsheet, the commas keep everything separated appropriately.</p>\n<p>When you open the edge file, you will see that we use the names from the node file to identify the nodes connected by each edge. These edges begin at a <strong>source</strong> node and end at a <strong>target</strong> node. While this language derives from so-called <strong>directed</strong> network structures, we will be using our data as an <strong>undirected</strong> network: if Person A knows Person B, then Person B must also know Person A. In directed networks, relationships need not be reciprocal (Person A can send a letter to B without getting one back), but in undirected networks the connections are always reciprocal, or <strong>symmetric</strong>. Since this is a network of who knew whom rather than, say, a correspondence network, an undirected set of relations is the most fitting. The symmetric relations in undirected networks are useful any time you are concerned with relationships that stake out the same role for both parties. Two friends have a symmetric relationship: they are each a friend of the other. A letter writer and recipient have an asymmetric relationship because each has a different role. Directed and undirected networks each have their own affordances (and sometimes, their own unique metrics), and you&#39;ll want to choose the one that best suits the kinds of relationships you are recording and the questions you want to answer. Here are the first few edges in the undirected Quaker network:</p>\n<pre><code>Source,Target\nGeorge Keith,Robert Barclay\nGeorge Keith,Benjamin Furly\nGeorge Keith,Anne Conway Viscountess Conway and Killultagh\nGeorge Keith,Franciscus Mercurius van Helmont\nGeorge Keith,William Penn\n</code></pre>\n<p>Now that you&#39;ve downloaded the Quaker data and had a look at how it&#39;s structured, it&#39;s time to begin working with that data in Python. Once both Python and pip are installed (see Prerequisites, above) you&#39;ll want to install NetworkX, by typing this into your <a href=\"/lessons/intro-to-bash\">command line</a>:[^pip]</p>\n<pre><code>pip3 install networkx==2.4\n</code></pre>\n<p>Recently, NetworkX updated to version 2.0. If you&#39;re running into any problems with the code below and have worked with NetworkX before, you might try updating the above package with <code>pip3 install networkx==2.4 --upgrade</code>.</p>\n<p>And that&#39;s it! You&#39;re ready to start coding.</p>\n<h1 id=\"getting-started\">Getting Started</h1>\n<h2 id=\"reading-files-importing-data\">Reading files, importing data</h2>\n<p>Start a new, blank plaintext file in the same directory as your data files called <code>quaker_network.py</code> (For more details on installing and running Python, see <a href=\"/lessons/mac-installation\">this tutorial</a>). At the top of that file, import the libraries you need. You&#39;ll need three libraries---the one we just installed, and two built-in Python libraries. You can type:</p>\n<pre><code class=\"language-python\">import csv\nfrom operator import itemgetter\nimport networkx as nx\nfrom networkx.algorithms import community #This part of networkx, for community detection, needs to be imported separately.\n</code></pre>\n<p>Now you can tell the program to read your CSV files and retrieve the data you need. Ironically, reading files and reorganizing data often requires more complex code than the functions for running social network analysis, so please bear with us through this first code block. Here&#39;s a set of commands for opening and reading our nodelist and edgelist files:</p>\n<pre><code class=\"language-python\">with open(&#39;quakers_nodelist.csv&#39;, &#39;r&#39;) as nodecsv: # Open the file\n    nodereader = csv.reader(nodecsv) # Read the csv\n    # Retrieve the data (using Python list comprhension and list slicing to remove the header row, see footnote 3)\n    nodes = [n for n in nodereader][1:]\n\nnode_names = [n[0] for n in nodes] # Get a list of only the node names\n\nwith open(&#39;quakers_edgelist.csv&#39;, &#39;r&#39;) as edgecsv: # Open the file\n    edgereader = csv.reader(edgecsv) # Read the csv\n    edges = [tuple(e) for e in edgereader][1:] # Retrieve the data\n</code></pre>\n<p>This code performs similar functions to the ones in <a href=\"/lessons/working-with-text-files\">this tutorial</a> but uses the CSV module to load your nodes and edges. You&#39;ll go back and get more node information later, but for now you need two things: the full list of nodes and a list of edge pairs (as tuples of nodes).[^slicing] These are the forms NetworkX will need to create a &quot;graph object,&quot; a special NetworkX data type you&#39;ll learn about in the next section.</p>\n<p>At this stage, before you start using NetworkX, you can do some basic sanity checks to make sure that your data loaded correctly using built-in Python functions and methods. Typing</p>\n<pre><code class=\"language-python\">print(len(node_names))\n</code></pre>\n<p>and</p>\n<pre><code class=\"language-python\">print(len(edges))\n</code></pre>\n<p>and then running your script will show you how many nodes and edges you successfully loaded in Python. If you see 119 nodes and 174 edges, then you&#39;ve got all the necessary data.</p>\n<h2 id=\"basics-of-networkx-creating-the-graph\">Basics of NetworkX: Creating the Graph</h2>\n<p>Now you have your data as two Python lists: a list of nodes (<code>node_names</code>) and a list of edges (<code>edges</code>). In NetworkX, you can put these two lists together into a single network object that understands how nodes and edges are related. This object is called a <strong>Graph</strong>, referring to one of the common terms for data organized as a network [n.b. it does not refer to any visual representation of the data. Graph here is used purely in a mathematical, network analysis sense.] First you must <em>initialize</em> a Graph object with the following command:</p>\n<pre><code class=\"language-python\">G = nx.Graph()\n</code></pre>\n<p>This will create a new Graph object, <em>G</em>, with nothing in it. Now you can add your lists of nodes and edges like so:</p>\n<pre><code class=\"language-python\">G.add_nodes_from(node_names)\nG.add_edges_from(edges)\n</code></pre>\n<p>This is one of several ways to add data to a network object. You can check out the <a href=\"https://networkx.github.io/documentation/stable/tutorial.html#adding-attributes-to-graphs-nodes-and-edges\">NetworkX documentation</a> for information about adding weighted edges, or adding nodes and edges one-at-a-time.</p>\n<p>Finally, you can get basic information about your newly-created network using the <code>info</code> function:</p>\n<pre><code class=\"language-python\">print(nx.info(G))\n</code></pre>\n<p>The <code>info</code> function gives five items as output: the name of your graph (which will be blank in our case), its type, the number of nodes, the number of edges, and the average degree[^averagedegree] in the network. The output should look like this:</p>\n<pre><code>Name:\nType: Graph\nNumber of nodes: 119\nNumber of edges: 174\nAverage degree:   2.9244\n</code></pre>\n<p>This is a quick way of getting some general information about your graph, but as you&#39;ll learn in subsequent sections, it is only scratching the surface of what NetworkX can tell you about your data.</p>\n<p>To recap, by now your script will look like this:</p>\n<pre><code class=\"language-python\">import csv\nfrom operator import itemgetter\nimport networkx as nx\nfrom networkx.algorithms import community\n\n# Read in the nodelist file\nwith open(&#39;quakers_nodelist.csv&#39;, &#39;r&#39;) as nodecsv:\n    nodereader = csv.reader(nodecsv)\n    nodes = [n for n in nodereader][1:]\n\n# Get a list of just the node names (the first item in each row)\nnode_names = [n[0] for n in nodes]\n\n# Read in the edgelist file\nwith open(&#39;quakers_edgelist.csv&#39;, &#39;r&#39;) as edgecsv:\n    edgereader = csv.reader(edgecsv)\n    edges = [tuple(e) for e in edgereader][1:]\n\n# Print the number of nodes and edges in our two lists\nprint(len(node_names))\nprint(len(edges))\n\nG = nx.Graph() # Initialize a Graph object\nG.add_nodes_from(node_names) # Add nodes to the Graph\nG.add_edges_from(edges) # Add edges to the Graph\nprint(nx.info(G)) # Print information about the Graph\n</code></pre>\n<p>So far, you&#39;ve read node and edge data into Python from CSV files, and then you counted those nodes and edges. After that you created a Graph object using NetworkX and loaded your data into that object.</p>\n<h2 id=\"adding-attributes\">Adding Attributes</h2>\n<p>For NetworkX, a Graph object is one big thing (your network) made up of two kinds of smaller things (your nodes and your edges). So far you&#39;ve uploaded nodes and edges (as pairs of nodes), but NetworkX allows you to add <em>attributes</em> to both nodes and edges, providing more information about each of them. Later on in this tutorial, you&#39;ll be running metrics and adding some of the results back to the Graph as attributes. For now, let&#39;s make sure your Graph contains all of the attributes that are currently in our CSV.</p>\n<p>You&#39;ll want to return to a list you created at the beginning of your script: <code>nodes</code>. This list contains all of the rows from <code>quakers_nodelist.csv</code>, including columns for name, historical significance, gender, birth year, death year, and SDFB ID. You&#39;ll want to loop through this list and add this information to our graph. There are a couple ways to do this, but NetworkX provides two convenient functions for adding attributes to all of a Graph&#39;s nodes or edges at once: <code>nx.set_node_attributes()</code> and <code>nx.set_edge_attributes()</code>. To use these functions, you&#39;ll need your attribute data to be in the form of a Python <em>dictionary</em>, in which node names are the <em>keys</em> and the attributes you want to add are the <em>values</em>.[^dictionary] You&#39;ll want to create a dictionary for each one of your attributes, and then add them using the functions above. The first thing you must do is create five empty dictionaries, using curly braces:</p>\n<pre><code class=\"language-python\">hist_sig_dict = {}\ngender_dict = {}\nbirth_dict = {}\ndeath_dict = {}\nid_dict = {}\n</code></pre>\n<p>Now we can loop through our <code>nodes</code> list and add the appropriate items to each dictionary. We do this by knowing in advance the position, or <em>index</em>, of each attribute. Because our <code>quaker_nodelist.csv</code> file is well-organized, we know that the person&#39;s name will always be the first item in the list: index 0, since you always start counting with 0 in Python. The person&#39;s historical significance will be index 1, their gender will be index 2, and so on. Therefore we can construct our dictionaries like so:[^brackets]</p>\n<pre><code class=\"language-python\">for node in nodes: # Loop through the list, one row at a time\n    hist_sig_dict[node[0]] = node[1]\n    gender_dict[node[0]] = node[2]\n    birth_dict[node[0]] = node[3]\n    death_dict[node[0]] = node[4]\n    id_dict[node[0]] = node[5]\n</code></pre>\n<p>Now you have a set of dictionaries that you can use to add attributes to nodes in your Graph object. The <code>set_node_attributes</code> function takes three variables: the Graph to which you&#39;re adding the attribute, the dictionary of id-attribute pairs, and the name of the new attribute. The code for adding your six attributes looks like this:</p>\n<pre><code class=\"language-python\">nx.set_node_attributes(G, hist_sig_dict, &#39;historical_significance&#39;)\nnx.set_node_attributes(G, gender_dict, &#39;gender&#39;)\nnx.set_node_attributes(G, birth_dict, &#39;birth_year&#39;)\nnx.set_node_attributes(G, death_dict, &#39;death_year&#39;)\nnx.set_node_attributes(G, id_dict, &#39;sdfb_id&#39;)\n</code></pre>\n<p>Now all of your nodes have these six attributes, and you can access them at any time. For example, you can print out all the birth years of your nodes by looping through them and accessing the <code>birth_year</code> attribute, like this:</p>\n<pre><code class=\"language-python\">for n in G.nodes(): # Loop through every node, in our data &quot;n&quot; will be the name of the person\n    print(n, G.nodes[n][&#39;birth_year&#39;]) # Access every node by its name, and then by the attribute &quot;birth_year&quot;\n</code></pre>\n<p>From this statement, you&#39;ll get a line of output for each node in the network. It should look like a simple list of names and years:</p>\n<pre><code>Anne Camm 1627\nSir Charles Wager 1666\nJohn Bellers 1654\nDorcas Erbery 1656\nMary Pennyman 1630\nHumphrey Woolrich 1633\nJohn Stubbs 1618\nRichard Hubberthorne 1628\nRobert Barclay 1648\nWilliam Coddington 1601\n</code></pre>\n<p>The steps above are a common method for adding attributes to nodes that you&#39;ll be using repeatedly later on in the tutorial. Here&#39;s a recap of the codeblock from this section:</p>\n<pre><code class=\"language-python\"># Create an empty dictionary for each attribute\nhist_sig_dict = {}\ngender_dict = {}\nbirth_dict = {}\ndeath_dict = {}\nid_dict = {}\n\nfor node in nodes: # Loop through the list of nodes, one row at a time\n    hist_sig_dict[node[0]] = node[1] # Access the correct item, add it to the corresponding dictionary\n    gender_dict[node[0]] = node[2]\n    birth_dict[node[0]] = node[3]\n    death_dict[node[0]] = node[4]\n    id_dict[node[0]] = node[5]\n\n# Add each dictionary as a node attribute to the Graph object\nnx.set_node_attributes(G, hist_sig_dict, &#39;historical_significance&#39;)\nnx.set_node_attributes(G, gender_dict, &#39;gender&#39;)\nnx.set_node_attributes(G, birth_dict, &#39;birth_year&#39;)\nnx.set_node_attributes(G, death_dict, &#39;death_year&#39;)\nnx.set_node_attributes(G, id_dict, &#39;sdfb_id&#39;)\n\n# Loop through each node, to access and print all the &quot;birth_year&quot; attributes\nfor n in G.nodes():\n    print(n, G.nodes[n][&#39;birth_year&#39;])\n</code></pre>\n<p>Now you&#39;ve learned how to create a Graph object and add attributes to it. In the next section, you&#39;ll learn about a variety of metrics available in NetworkX and how to access them. But relax, you&#39;ve now learned the bulk of the code you&#39;ll need for the rest of the tutorial!</p>\n<h1 id=\"metrics-available-in-networkx\">Metrics available in NetworkX</h1>\n<p>When you start work on a new dataset, it&#39;s a good idea to get a general sense of the data. The first step, described above, is to simply open the files and see what&#39;s inside. Because it&#39;s a network, you know there will be nodes and edges, but how many of each are there? What information is appended to each node or edge?</p>\n<p>In our case, there are 174 edges and 119 nodes. These edges don&#39;t have directions (that is, there&#39;s a symmetric relationship between people) nor do they include additional information. For nodes, we know their names, historical significance, gender, birth and death dates, and SDFB ID.</p>\n<p>These details inform what you can or should do with your dataset. Too few nodes (say, 15), and a network analysis is less useful than drawing a picture or doing some reading; too many (say, 15 million), and you should consider starting with a subset or finding a supercomputer.</p>\n<p>The network&#39;s properties also guide your analysis. Because this network is <strong>undirected</strong>, your analysis must use metrics that require symmetric edges between nodes. For example, you can determine what communities people find themselves in, but you can&#39;t determine the <em>directional</em> routes through which information might flow along the network (you&#39;d need a directed network for that). By using the symmetric, undirected relationships in this case, you&#39;ll be able to find sub-communities and the people who are important to those communities, a process that would be more difficult (though still possible) with a directed network. NetworkX allows you to perform most analyses you might conceive, but you must understand the affordances of your dataset and realize some NetworkX algorithms are more appropriate than others.</p>\n<h3 id=\"the-shape-of-the-network\">The Shape of the Network</h3>\n<p>After seeing what the <em>dataset</em> looks like, it&#39;s important to see what the <em>network</em> looks like. They&#39;re different things. The dataset is an abstract representation of what you assume to be connections between entities; the network is the specific instantiation of those assumptions. The network, at least in this context, is how the computer reads the connections you encoded in a dataset. A network has a <a href=\"https://en.wikipedia.org/wiki/Topology\">topology</a>, or a connective shape, that could be centralized or decentralized; dense or sparse; cyclical or linear. A dataset does not, outside the structure of the table it&#39;s written in.</p>\n<p>The network&#39;s shape and basic properties will give you a handle on what you&#39;re working with and what analyses seem reasonable. You already know the number of nodes and edges, but what does the network &#39;look&#39; like? Do nodes cluster together, or are they equally spread out? Are there complex structures, or is every node arranged along a straight line?</p>\n<p>The visualization below, created in network visualization tool <a href=\"https://gephi.org/\">Gephi</a>, will give you an idea of the topology of this network.[^singletons] You could create a similar graph in Palladio following <a href=\"/lessons/creating-network-diagrams-from-historical-sources\">this tutorial</a>.</p>\n<p>{% include figure.html filename=&quot;exploring-and-analyzing-network-data-with-python-1.png&quot; caption=&quot;Force-directed network visualization of the Quaker data, created in Gephi&quot; %}</p>\n<p>There are lots of ways to visualize a network, and a <a href=\"https://en.wikipedia.org/wiki/Force-directed_graph_drawing\">force-directed layout</a>, of which the above image is an example, is among the most common. Force-directed graphs attempt to find the optimum placement for nodes with a calculation based on the <a href=\"http://6dfb.tumblr.com/post/159420498411/ut-tensio-sic-vis-introducing-the-hooke-graph\">tension of springs in Hooke&#39;s Law</a>, which for smaller graphs often creates clean, easy-to-read visualizations. The visualization embedded above shows you there is a single large <strong>component</strong> of connected nodes (in the center) and several small components with just one or two connections around the edges. This is a fairly common network structure. Knowing that there are multiple components in the network will usefully limit the calculations you&#39;ll want to perform on it. By displaying the number of connections (known as <strong>degree</strong>, see below) as the size of nodes, the visualization also shows that there are a few nodes with lots of connections that keep the central component tied together. These large nodes are known as <strong>hubs</strong>, and the fact that they show up so clearly here gives you a clue as to what you&#39;ll find when you measure <strong>centrality</strong> in the next section.</p>\n<p>Visualizations, however, only get you so far. The more networks you work with, the more you realize most appear similar enough that it&#39;s hard to tell one from the next. Quantitative metrics let you differentiate networks, learn about their topologies, and turn a jumble of nodes and edges into something you can learn from.</p>\n<p>A good metric to begin with is network <strong>density</strong>. This is simply the ratio of actual edges in the network to all possible edges in the network. In an undirected network like this one, there <em>could</em> be a single edge between any two nodes, but as you saw in the visualization, only a few of those possible edges are actually present. Network density gives you a quick sense of how closely knit your network is.</p>\n<p>And the good news is many of these metrics require simple, one-line commands in Python. From here forward, you can keep building on your code block from the previous sections. You don&#39;t have to delete anything you&#39;ve already typed, and because you created your network object <code>G</code> in the codeblock above, all the metrics from here on should work correctly.</p>\n<p>You can calculate network density by running <code>nx.density(G)</code>. However the best way to do this is to store your metric in a variable for future reference, and print that variable, like so:</p>\n<pre><code class=\"language-python\">density = nx.density(G)\nprint(&quot;Network density:&quot;, density)\n</code></pre>\n<p>The output of density is a number, so that&#39;s what you&#39;ll see when you print the value. In this case, the density of our network is approximately 0.0248. On a scale of 0 to 1, not a very dense network, which comports with what you can see in the visualization.[^density] A 0 would mean that there are no connections at all, and a 1 would indicate that all <em>possible</em> edges are present (a perfectly connected network): this Quaker network is on the lower end of that scale, but still far from 0.</p>\n<p>A shortest path measurement is a bit more complex. It calculates the shortest possible series of nodes and edges that stand between any two nodes, something hard to see in large network visualizations. This measure is essentially finding friends-of-friends---if my mother knows someone that I don&#39;t, then mom is the shortest path between me and that person. The Six Degrees of Kevin Bacon game, from which <a href=\"http://sixdegreesoffrancisbacon.com/\">our project</a> takes its name, is basically a game of finding shortest paths (with a <strong>path length</strong> of six or less) from Kevin Bacon to any other actor.</p>\n<p>To calculate a shortest path, you&#39;ll need to pass several input variables (information you give to a Python function): the whole graph, your source node, and your target node. Let&#39;s find the shortest path between Margaret Fell and George Whitehead. Since we used names to uniquely identify our nodes in the network, you can access those nodes (as the <strong>source</strong> and <strong>target</strong> of your path), using the names directly.</p>\n<pre><code class=\"language-python\">fell_whitehead_path = nx.shortest_path(G, source=&quot;Margaret Fell&quot;, target=&quot;George Whitehead&quot;)\n\nprint(&quot;Shortest path between Fell and Whitehead:&quot;, fell_whitehead_path)\n</code></pre>\n<p>Depending on the size of your network, this could take a little while to calculate, since Python first finds all possible paths and then picks the shortest one. The output of <code>shortest_path</code> will be a list of the nodes that includes the &quot;source&quot; (Fell), the &quot;target&quot; (Whitehead), and the nodes between them. In this case, we can see that Quaker Founder George Fox is on the shortest path between them. Since Fox is also a <strong>hub</strong> (see degree centrality, below) with many connections, we might suppose that several shortest paths run through him as a mediator. What might this say about the importance of the Quaker founders to their social network?</p>\n<p>Python includes many tools that calculate shortest paths. There are functions for the lengths of shortest paths, for all shortest paths, and for whether or not a path exists at all in the <a href=\"https://networkx.github.io/documentation/stable/reference/algorithms/shortest_paths.html\">documentation</a>. You could use a separate function to find out the length of the Fell-Whitehead path we just calculated, or you could simply take the length of the list minus one,[^path] like this:</p>\n<pre><code class=\"language-python\">print(&quot;Length of that path:&quot;, len(fell_whitehead_path)-1)\n</code></pre>\n<p>There are many network metrics derived from shortest path lengths. One such measure is <strong>diameter</strong>, which is the longest of all shortest paths. After calculating all shortest paths between every possible pair of nodes in the network, diameter is the length of the path between the two nodes that are furthest apart. The measure is designed to give you a sense of the network&#39;s overall size, the distance from one end of the network to another.</p>\n<p>Diameter uses a simple command: <code>nx.diameter(G)</code>. However, running this command on the Quaker graph will yield an error telling you the Graph is &quot;not connected.&quot; This simply means that your graph, as you already saw, has more than one component. Because there are some nodes that have no path at all to others, it is impossible to find all of the shortest paths. Take another look at the visualization of your graph:</p>\n<p>{% include figure.html filename=&quot;exploring-and-analyzing-network-data-with-python-1.png&quot; caption=&quot;Force-directed network visualization of the Quaker data, created in Gephi&quot; %}</p>\n<p>Since there is no available path between nodes of one component and nodes of another, <code>nx.diameter()</code> returns the &quot;not connected&quot; error. You can remedy this by first finding out if your Graph &quot;is connected&quot; (i.e. all one component) and, if not connected, finding the largest component and calculating diameter on that component alone. Here&#39;s the code:</p>\n<pre><code class=\"language-python\"># If your Graph has more than one component, this will return False:\nprint(nx.is_connected(G))\n\n# Next, use nx.connected_components to get the list of components,\n# then use the max() command to find the largest one:\ncomponents = nx.connected_components(G)\nlargest_component = max(components, key=len)\n\n# Create a &quot;subgraph&quot; of just the largest component\n# Then calculate the diameter of the subgraph, just like you did with density.\n#\n\nsubgraph = G.subgraph(largest_component)\ndiameter = nx.diameter(subgraph)\nprint(&quot;Network diameter of largest component:&quot;, diameter)\n</code></pre>\n<p>Since we took the largest component, we can assume there is no larger diameter for the other components. Therefore this figure is a good stand in for the diameter of the whole Graph. The network diameter of this network&#39;s largest component is 8: there is a path length of 8 between the two farthest-apart nodes in the network. Unlike density which is scaled from 0 to 1, it is difficult to know from this number alone whether 8 is a large or small diameter. For some global metrics, it can be best to compare it to networks of similar size and shape.[^random]</p>\n<p>The final structural calculation you will make on this network concerns the concept of <strong>triadic closure</strong>. Triadic closure supposes that if two people know the same person, they are likely to know each other. If Fox knows both Fell and Whitehead, then Fell and Whitehead may very well know each other, completing a <strong>triangle</strong> in the visualization of three edges connecting Fox, Fell, and Whitehead. The number of these enclosed triangles in the network can be used to find clusters and communities of individuals that all know each other fairly well.</p>\n<p>One way of measuring triadic closure is called <strong>clustering coefficient</strong> because of this clustering tendency, but the structural network measure you will learn is known as <strong>transitivity</strong>.[^transitivity] Transitivity is the ratio of all triangles over all possible triangles. A possible triangle exists when one person (Fox) knows two people (Fell and Whitehead). So transitivity, like density, expresses how interconnected a graph is in terms of a ratio of actual over possible connections. Remember, measurements like transitivity and density concern <em>likelihoods</em> rather than <em>certainties</em>. All the outputs of your Python script must be interpreted, like any other object of research. Transitivity allows you a way of thinking about all the relationships in your graph that <em>may</em> exist but currently do not.</p>\n<p>You can calculate transitivity in one line, the same way you calculated density:</p>\n<pre><code class=\"language-python\">triadic_closure = nx.transitivity(G)\nprint(&quot;Triadic closure:&quot;, triadic_closure)\n</code></pre>\n<p>Also like density, transitivity is scaled from 0 to 1, and you can see that the network&#39;s transitivity is about 0.1694, somewhat higher than its 0.0248 density. Because the graph is not very dense, there are fewer <em>possible triangles</em> to begin with, which may result in slightly higher transitivity. That is, nodes that already have lots of connections are likely to be part of these enclosed triangles. To back this up, you&#39;ll want to know more about nodes with many connections.</p>\n<h2 id=\"centrality\">Centrality</h2>\n<p>After getting some basic measures of the entire network structure, a good next step is to find which nodes are the most important ones in your network. In network analysis, measures of the importance of nodes are referred to as <strong>centrality</strong> measures. Because there are many ways of approaching the question &quot;Which nodes are the most important?&quot; there are many different ways of calculating centrality. Here you&#39;ll learn about three of the most common centrality measures: degree, betweenness centrality, and eigenvector centrality.</p>\n<p><strong>Degree</strong> is the simplest and the most common way of finding important nodes. A node&#39;s degree is the sum of its edges. If a node has three lines extending from it to other nodes, its degree is three. Five edges, its degree is five. It&#39;s really that simple. Since each of those edges will always have a node on the other end, you might think of degree as the number of people to which a given person is directly connected. The nodes with the highest degree in a social network are the people who know the most people. These nodes are often referred to as <strong>hubs</strong>, and calculating degree is the quickest way of identifying hubs.</p>\n<p>Calculating centrality for each node in NetworkX is not quite as simple as the network-wide metrics above, but it still involves one-line commands. All of the centrality commands you&#39;ll learn in this section produce dictionaries in which the keys are nodes and the values are centrality measures. That means they&#39;re ready-made to add back into your network as a node attribute, like you did in the last section. Start by calculating degree and adding it as an attribute to your network.</p>\n<pre><code class=\"language-python\">degree_dict = dict(G.degree(G.nodes()))\nnx.set_node_attributes(G, degree_dict, &#39;degree&#39;)\n</code></pre>\n<p>You just ran the <code>G.degree()</code> method on the full list of nodes in your network (<code>G.nodes()</code>). Since you added it as an attribute, you can now see William Penn&#39;s degree along with his other information if you access his node directly:</p>\n<pre><code class=\"language-python\">print(G.nodes[&#39;William Penn&#39;])\n</code></pre>\n<p>But these results are useful for more than just adding attributes to your Graph object. Since you&#39;re already in Python, you can sort and compare them. You can use the built-in function <code>sorted()</code> to sort a dictionary by its keys or values and find the top twenty nodes ranked by degree. To do this you&#39;ll need to use <code>itemgetter</code>, which we imported back at the beginning of the tutorial. Using <code>sorted</code> and <code>itemgetter</code>, you can sort the dictionary of degrees like this:</p>\n<pre><code class=\"language-python\">sorted_degree = sorted(degree_dict.items(), key=itemgetter(1), reverse=True)\n</code></pre>\n<p>There&#39;s a lot going on behind the scenes here, but just concentrate on the three input variables you gave to <code>sorted()</code>. The first is the dictionary, <code>degree_dict.items()</code>, you want to sort. The second is what to sort by: in this case, item &quot;1&quot; is the second item in the pair, or the value of your dictionary. Finally, you tell <code>sorted()</code> to go in <code>reverse</code> so that the highest degree nodes will be first in the resulting list. Once you&#39;ve created this sorted list, you can loop through it, and use list slicing[^slicing] to get only the first 20 nodes:</p>\n<pre><code class=\"language-python\">print(&quot;Top 20 nodes by degree:&quot;)\nfor d in sorted_degree[:20]:\n    print(d)\n</code></pre>\n<p>As you can see, Penn&#39;s degree is 18, relatively high for this network. But printing out this ranking information illustrates the limitations of degree as a centrality measure. You probably didn&#39;t need NetworkX to tell you that William Penn, Quaker leader and founder of Pennsylvania, was important. Most social networks will have just a few hubs of very high degree, with the rest of similar, much lower degree.[^power] Degree can tell you about the biggest hubs, but it can&#39;t tell you that much about the rest of the nodes. And in many cases, those hubs it&#39;s telling you about (like Penn or Quakerism co-founder Margaret Fell, with a degree of 13) are not especially surprising. In this case almost all of the hubs are founders of the religion or otherwise important political figures.</p>\n<p>Thankfully there are other centrality measures that can tell you about more than just hubs. <a href=\"https://networkx.github.io/documentation/stable/reference/algorithms/generated/networkx.algorithms.centrality.eigenvector_centrality.html\">Eigenvector centrality</a> is a kind of extension of degree---it looks at a combination of a node&#39;s edges and the edges of that node&#39;s neighbors. Eigenvector centrality cares if you are a hub, but it also cares how many hubs you are connected to. It&#39;s calculated as a value from 0 to 1: the closer to one, the greater the centrality. Eigenvector centrality is useful for understanding which nodes can get information to many other nodes quickly. If you know a lot of well-connected people, you could spread a message very efficiently. If you&#39;ve used Google, then you&#39;re already somewhat familiar with Eigenvector centrality. Their PageRank algorithm uses an extension of this formula to decide which webpages get to the top of its search results.</p>\n<p><a href=\"https://networkx.github.io/documentation/stable/reference/algorithms/generated/networkx.algorithms.centrality.betweenness_centrality.html\">Betweenness centrality</a> is a bit different from the other two measures in that it doesn&#39;t care about the number of edges any one node or set of nodes has. Betweenness centrality looks at all the <strong>shortest paths</strong> that pass through a particular node (see above). To do this, it must first calculate every possible shortest path in your network, so keep in mind that betweenness centrality will take longer to calculate than other centrality measures (but it won&#39;t be an issue in a dataset of this size). Betweenness centrality, which is also expressed on a scale of 0 to 1, is fairly good at finding nodes that connect two otherwise disparate parts of a network. If you&#39;re the only thing connecting two clusters, every communication between those clusters has to pass through you. In contrast to a hub, this sort of node is often referred to as a <strong>broker</strong>. Betweenness centrality is not the only way of finding brokerage (and other methods are more systematic), but it&#39;s a quick way of giving you a sense of which nodes are important not because they have lots of connections themselves but because they stand <em>between</em> groups, giving the network connectivity and cohesion.</p>\n<p>These two centrality measures are even simpler to run than degree---they don&#39;t need to be fed a list of nodes, just the graph <code>G</code>. You can run them with these functions:</p>\n<pre><code class=\"language-python\">betweenness_dict = nx.betweenness_centrality(G) # Run betweenness centrality\neigenvector_dict = nx.eigenvector_centrality(G) # Run eigenvector centrality\n\n# Assign each to an attribute in your network\nnx.set_node_attributes(G, betweenness_dict, &#39;betweenness&#39;)\nnx.set_node_attributes(G, eigenvector_dict, &#39;eigenvector&#39;)\n</code></pre>\n<p>You can sort betweenness (or eigenvector) centrality by changing the variable names in the sorting code above, as:</p>\n<pre><code class=\"language-python\">sorted_betweenness = sorted(betweenness_dict.items(), key=itemgetter(1), reverse=True)\n\nprint(&quot;Top 20 nodes by betweenness centrality:&quot;)\nfor b in sorted_betweenness[:20]:\n    print(b)\n</code></pre>\n<p>You&#39;ll notice that many, but not all, of the nodes that have high degree also have high betweenness centrality.  In fact, betweeness centrality surfaces two women, Elizabeth Leavens and Mary Penington, whose significance had been obscured by the degree centrality metric. An advantage of doing these calculations in Python is that you can quickly compare two sets of calculations. What if you want to know which of the high betweenness centrality nodes had low degree? That is to say: which high-betweenness nodes are unexpected? You can use a combination of the sorted lists from above:</p>\n<pre><code class=\"language-python\">#First get the top 20 nodes by betweenness as a list\ntop_betweenness = sorted_betweenness[:20]\n\n#Then find and print their degree\nfor tb in top_betweenness: # Loop through top_betweenness\n    degree = degree_dict[tb[0]] # Use degree_dict to access a node&#39;s degree, see footnote 2\n    print(&quot;Name:&quot;, tb[0], &quot;| Betweenness Centrality:&quot;, tb[1], &quot;| Degree:&quot;, degree)\n</code></pre>\n<p>You can confirm from these results that some people, like Leavens and Penington, have high betweenness centrality but low degree. This could mean that these women were important brokers, connecting  otherwise disparate parts of the graph. You can also learn unexpected things about people you already know about---in this list you can see that Penn has lower degree than Quaker founder George Fox, but higher betweenness centrality. That is to say, simply knowing more people isn&#39;t everything.</p>\n<p>This only scratches the surface of what can be done with network metrics in Python. NetworkX offers dozens of functions and measures for you to use in various combinations, and you can use Python to extend these measures in almost unlimited ways. A programming language like Python or R will give you the flexibility to explore your network computationally in ways other interfaces cannot by allowing you to combine and compare the statistical results of your network with other attributes of your data (like the dates and occupations you added to the network at the beginning of this tutorial!).</p>\n<h2 id=\"advanced-networkx-community-detection-with-modularity\">Advanced NetworkX: Community detection with modularity</h2>\n<p>Another common thing to ask about a network dataset is what the subgroups or communities are within the larger social structure. Is your network one big, happy family where everyone knows everyone else? Or is it a collection of smaller subgroups that are only connected by one or two intermediaries? The field of community detection in networks is designed to answer these questions. There are many ways of calculating communities, cliques, and clusters in your network, but the most popular method currently is <strong>modularity</strong>. Modularity is a measure of relative density in your network: a community (called a <strong>module</strong> or modularity <strong>class</strong>) has high density relative to other nodes within its module but low density with those outside. Modularity gives you an overall score of how fractious your network is, and that score can be used to <strong>partition</strong> the network and return the individual communities.[^overall]</p>\n<p>Very dense networks are often more difficult to split into sensible partitions. Luckily, as you discovered earlier, this network is not all that dense. There aren&#39;t nearly as many actual connections as possible connections, and there are several altogether disconnected components. Its worthwhile partitioning this sparse network with modularity and seeing if the result make historical and analytical sense.</p>\n<p>Community detection and partitioning in NetworkX requires a little more setup than some of the other metrics. There are some built-in approaches to community detection (like <a href=\"https://networkx.github.io/documentation/stable/reference/algorithms/generated/networkx.algorithms.flow.minimum_cut.html\">minimum cut</a>, but modularity is not included with NetworkX. Fortunately there&#39;s an <a href=\"https://github.com/taynaud/python-louvain/\">additional python module</a> you can use with NetworkX, which you already installed and imported at the beginning of this tutorial. You can read the <a href=\"http://perso.crans.org/aynaud/communities/api.html\">full documentation</a> for all of the functions it offers, but for most community detection purposes you&#39;ll only want <code>best_partition()</code>:</p>\n<pre><code class=\"language-python\">communities = community.greedy_modularity_communities(G)\n</code></pre>\n<p>The method <code>greedy_modularity_communities()</code> tries to determine the number of communities appropriate for the graph, and groups all nodes into subsets based on these communities. Unlike the centrality functions, the above code will not create a dictionary. Instead it creates a list of special &quot;frozenset&quot; objects (similar to lists). There&#39;s one set for each group, and the sets contain the names of the people in each group. In order to add this information to your network in the now-familiar way, you must first create a dictionary that labels each person with a number value for the group to which they belong:</p>\n<pre><code class=\"language-python\">modularity_dict = {} # Create a blank dictionary\nfor i,c in enumerate(communities): # Loop through the list of communities, keeping track of the number for the community\n    for name in c: # Loop through each person in a community\n        modularity_dict[name] = i # Create an entry in the dictionary for the person, where the value is which group they belong to.\n\n# Now you can add modularity information like we did the other metrics\nnx.set_node_attributes(G, modularity_dict, &#39;modularity&#39;)\n</code></pre>\n<p>As always, you can combine these measures with others. For example, here&#39;s how you find the highest eigenvector centrality nodes in modularity class 0 (the first one):</p>\n<pre><code class=\"language-python\"># First get a list of just the nodes in that class\nclass0 = [n for n in G.nodes() if G.nodes[n][&#39;modularity&#39;] == 0]\n\n# Then create a dictionary of the eigenvector centralities of those nodes\nclass0_eigenvector = {n:G.nodes[n][&#39;eigenvector&#39;] for n in class0}\n\n# Then sort that dictionary and print the first 5 results\nclass0_sorted_by_eigenvector = sorted(class0_eigenvector.items(), key=itemgetter(1), reverse=True)\n\nprint(&quot;Modularity Class 0 Sorted by Eigenvector Centrality:&quot;)\nfor node in class0_sorted_by_eigenvector[:5]:\n    print(&quot;Name:&quot;, node[0], &quot;| Eigenvector Centrality:&quot;, node[1])\n</code></pre>\n<p>Using eigenvector centrality as a ranking can give you a sense of the important people within this modularity class. You&#39;ll notice that some of these people, especially William Penn, William Bradford (<em>not</em> the Plymouth founder you&#39;re thinking of), and James Logan, spent lots of time in America. Also, Bradford and Tace Sowle were both prominent Quaker printers. With just a little bit of digging, we can discover that there are both geographical and occupational reasons that this group of people belongs together. This is an indication that modularity is probably working as expected.</p>\n<p>In smaller networks like this one, a common task is to find and list all of the modularity classes and their members.[^modularity] You can do this by looping through the <code>communities</code> list:</p>\n<pre><code class=\"language-python\">for i,c in enumerate(communities): # Loop through the list of communities\n    if len(c) &gt; 2: # Filter out modularity classes with 2 or fewer nodes\n        print(&#39;Class &#39;+str(i)+&#39;:&#39;, list(c)) # Print out the classes and their members\n</code></pre>\n<p>Notice in the code above that you are filtering out any modularity classes with two or fewer nodes, in the line <code>if len(c) &gt; 2</code>. You&#39;ll remember from the visualization that there were lots of small components of the network with only two nodes. Modularity will find these components and treat them as separate classes (since they&#39;re not connected to anything else). By filtering them out, you get a better sense of the larger modularity classes within the network&#39;s main component.</p>\n<p>Working with NetworkX alone will get you far, and you can find out a lot about modularity classes just by working with the data directly. But you&#39;ll almost always want to visualize your data (and perhaps to express modularity as node color). In the next section you&#39;ll learn how to export your NetworkX data for use in other programs.</p>\n<h1 id=\"exporting-data\">Exporting Data</h1>\n<p>NetworkX supports a very large number of file formats for <a href=\"https://networkx.github.io/documentation/stable/reference/readwrite/index.html\">data export</a>. If you wanted to export a plaintext edgelist to load into Palladio, there&#39;s a <a href=\"https://networkx.github.io/documentation/stable/reference/readwrite/generated/networkx.readwrite.edgelist.write_edgelist.html\">convenient wrapper</a> for that. Frequently at <em>Six Degrees of Francis Bacon</em>, we export NetworkX data in <a href=\"https://networkx.github.io/documentation/stable/reference/readwrite/generated/networkx.readwrite.json_graph.node_link_data.html\">D3&#39;s specialized JSON format</a>, for visualization in the browser. You could even <a href=\"https://networkx.github.io/documentation/stable/reference/generated/networkx.convert_matrix.to_pandas_adjacency.html\">export</a> your graph as a <a href=\"http://pandas.pydata.org/\">Pandas dataframe</a> if there were more advanced statistical operations you wanted to run. There are lots of options, and if you&#39;ve been diligently adding all your metrics back into your Graph object as attributes, all your data will be exported in one fell swoop.</p>\n<p>Most of the export options work in roughly the same way, so for this tutorial you&#39;ll learn how to export your data into Gephi&#39;s GEXF format. Once you&#39;ve exported the file, you can upload it <a href=\"https://gephi.org/users/supported-graph-formats/\">directly into Gephi</a> for visualization.</p>\n<p>Exporting data is often a simple one-line command. All you have to choose is a filename. In this case we&#39;ll use <code>quaker_network.gexf</code>. To export type:</p>\n<pre><code class=\"language-python\">nx.write_gexf(G, &#39;quaker_network.gexf&#39;)\n</code></pre>\n<p>That&#39;s it! When you run your Python script, it will automatically place the new GEXF file in the same directory as your Python file.[^import]</p>\n<h1 id=\"drawing-conclusions\">Drawing Conclusions</h1>\n<p>Having processed and reviewed an array of network metrics in Python, you now have evidence from which arguments can be made and conclusions drawn about this network of Quakers in early modern Britain. You know, for example, that the network has relatively low <strong>density</strong>, suggesting loose associations and/or incomplete original data. You know that the community is organized around several disproportionately large <strong>hubs</strong>, among them founders of the denomination like Margaret Fell and George Fox, as well as important political and religious leaders like William Penn. More helpfully, you know about women with relatively low degree, like Elizabeth Leavens and Mary Penington, who (as a result of high betweenness centrality) may have acted as <strong>brokers</strong>, connecting multiple groups. Finally you learned that the network is made of one large <strong>component</strong> and many very small ones. Within that largest component, there are several distinct <strong>communities</strong>, some of which seem organized around time or place (like Penn and his American associates). Because of the metadata you added to your network, you have the tools to explore these metrics further and to potentially explain some of the structural features you identified.</p>\n<p>Each of these findings is an invitation to more research rather than an endpoint or proof. Network analysis is a set of tools for asking targeted questions about the structure of relationships within a dataset, and NetworkX provides a relatively simple interface to many of the common techniques and metrics. Networks are a useful way of extending your research into a group by providing information about community structure, and we hope you&#39;ll be inspired by this tutorial to use these metrics to enrich your own investigations and to explore the flexibility of network analysis beyond visualization.</p>\n<p>[^slicing]: There are a couple Pythonic techniques this code makes use of. The first is <em>list comprehensions</em>, which embed loops (<code>for n in nodes</code>) to create new lists (in brackets), like so: <code>new_list = [item for item in old_list]</code>. The second is <em>list slicing</em>, which allows you to subdivide or &quot;slice&quot; a list. The list slicing notation <code>[1:]</code> takes everything <em>except</em> for the first item in the list. The 1 tells Python to begin with the second item in the list (in Python, you start counting at 0), and the colon tells Python to take everything up to the end of the list. Since the first line in both of these lists is the header row of each CSV, we don&#39;t want those headers to be included in our data.</p>\n<p>[^dictionary]: Dictionaries are a built-in datatype in Python, made up of key-value pairs. Think of a key as the headword in a dictionary, and the value as its definition. Keys have to be unique (only one of each per dictionary), but values can be anything. Dictionaries are represented by curly braces, with keys and values separate by colons: <code>{key1:value1, key2:value2, ...}</code>. Dictionaries are one of the fastest ways to store values that you know you&#39;ll need to look up later. In fact, a NetworkX Graph object is itself made up of nested dictionaries.</p>\n<p>[^brackets]: Note that this code uses brackets in two ways. It uses numbers in brackets to access specific indices within a node list (for example, the birth year at <code>node[4]</code>), but it also uses brackets to assign a <em>key</em> (always <code>node[0]</code>, the ID) to any one of our empty dictionaries: <code>dictionary[key] = value</code>. Convenient!</p>\n<p>[^path]: We take the length of the list <em>minus one</em> because we want the number of edges (or steps) between the nodes listed here, rather than the number of nodes.</p>\n<p>[^import]: Every file format that is exportable is also importable. If you have a GEXF file from Gephi that you want to put into NetworkX, you&#39;d type <code>G = nx.read_gexf(&#39;some_file.gexf&#39;)</code>.</p>\n<p>[^modularity]: In larger networks, the lists would probably be unreadably long, but you could get a sense of all the modularity classes at once by visualizing the network and adding color to the nodes based on their modularity class.</p>\n<p>[^pip]: Some installations will only want you to type <code>pip</code> without the &quot;3,&quot; but in Python 3, <code>pip3</code> is the most common. If one doesn&#39;t work, try the other!</p>\n<p>[^power]: Those of you with a stats background will note that degree in social networks typically follows a <em>power law</em>, but this is neither unusual nor especially helpful to know.</p>\n<p>[^singletons]: For the sake of simplicity, we removed any nodes that are <em>not connected to any others</em> from the dataset before we began. This was simply to reduce clutter, but it&#39;s also very common to see lots of these single nodes in your average network dataset.</p>\n<p>[^density]: But keep in mind this is the density of the <em>whole</em> network, including those unconnected components floating in orbit. There are a lot of possible connections there. If you took the density of only the largest component, you might get a very different number. You could do so by finding the largest component as we show you in the next section on <strong>diameter</strong>, and then running the same density method on only that component.</p>\n<p>[^transitivity]: Why is it called transitivity? You might remember the transitive property from high school geometry: if A=B and B=C, the A must equal C. Similarly, in triadic closure, if person A knows person B and person B knows person C, then person A probably knows person C: hence, transitivity.</p>\n<p>[^overall]: Though we won&#39;t cover it in this tutorial, it&#39;s usually a good idea to get the global modularity score first to determine whether you&#39;ll learn anything by partitioning your network according to modularity. To see the overall modularity score, take the communities you calculated with <code>communities = community.best_partition(G)</code> and run <code>global_modularity = community.modularity(communities, G)</code>. Then just <code>print(global_modularity)</code>.</p>\n<p>[^pipinstall]: In many (but not all) cases, <code>pip</code> or <code>pip3</code> will be installed automatically with Python3.</p>\n<p>[^averagedegree]: Average degree is the average number of connections of each node in your network. See more on degree in the centrality section of this tutorial.</p>\n<p>[^random]: The most principled way of doing this kind of comparison is to create <em>random graphs</em> of identical size to see if the metrics differ from the norm. NetworkX offers plenty of tools for <a href=\"https://networkx.github.io/documentation/stable/reference/generators.html#module-networkx.generators.random_graphs\">generating random graphs</a>.</p>\n"}