{"metadata":{"title":"Descargar páginas web con Python","authors":["William J. Turkel","Adam Crymble"],"date":"2012-07-17T00:00:00.000Z","translation_date":"2017-03-15T00:00:00.000Z","editors":["Miriam Posner"],"reviewers":["Miriam Posner","Jim Clifford","Frederik Elwert"],"translator":["Víctor Gayol"],"translation-editor":["Adam Crymble"],"translation-reviewer":["Jairo A. Melo","Maria José Afanador-Llach","Antonio Rojas Castro"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/42","layout":"lesson","categories":["lessons","python","original-ph"],"difficulty":2,"activity":"acquiring","topics":["python"],"abstract":"Esta lección muestra qué es un Localizador de recursos uniforme (Uniform Resource Locator = URL) y explica cómo utilizar Python para descargar y guardar los contenidos de una página web en tu disco duro.","next":"manipular-cadenas-de-caracteres-en-python","previous":"reutilizacion-de-codigo-y-modularidad","original":"working-with-web-pages","python_warning":false,"avatar_alt":"Grabado de una mujer y un hombre de pies.","doi":"10.46430/phes0029","sequence":5,"series_total":14},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"objetivos-de-la-lección\">Objetivos de la lección</h2>\n<p>Esta lección muestra qué es un Localizador de recursos uniforme (<em>Uniform Resource Locator</em> = URL) y explica cómo utilizar Python para descargar y guardar los contenidos de una página web en tu disco duro.</p>\n<h3 id=\"acerca-de-los-url\">Acerca de los URL</h3>\n<p>Una <em>página web</em> es un archivo que está almacenado en otra computadora, una máquina conocida como <em>servidor web</em>. Cuando tú “vas” a una página web, lo que en realidad sucede es que tu computadora (el <em>cliente</em>) envía una solicitud al servidor (el <em>alojamiento</em> o <em>host</em>) a través de la red, y el servidor responde enviándote una copia de la página a tu máquina. Una manera de ir a una página web con tu navegador es seguir un enlace a alguna otra parte. También tienes la posibilidad de pegar o escribir un localizador de recursos uniforme (URL) directamente en tu navegador. El URL le indica a tu navegador dónde encontrar un recurso en línea especificando el servidor, directorio y nombre del archivo que tiene que ser recuperado, así como el tipo de <em>protocolo</em> que tu navegador y el servidor estarán de acuerdo en usar mientras intercambian información (como HTTP o <em>protocolo de transferencia de hipertexto</em>). La estructura básica de un URL es:</p>\n<pre><code>protocolo://dominio:puerto//ruta?consulta\n</code></pre>\n<p>Veamos algunos ejemplos.</p>\n<pre><code class=\"language-xml\">http://oldbaileyonline.org\n</code></pre>\n<p>El tipo más básico de URL simplemente especifica el protocolo y el alojamiento. Si introduces este URL en tu navegador, te mostrará la página principal del sitio <a href=\"http://oldbaileyonline.org\">The Old Bailey Online</a>. Por defecto, la página principal en un directorio se denomina índice, por lo general <code>index.html</code>.</p>\n<p>El URL también pude incluir un <em>número de puerto</em> opcional. Sin entrar en detalles, el protocolo de red que subyace en el intercambio de información en la Internet permite a las computadoras conectarse de diferentes maneras. Los números de puerto se usan para distinguir estas diferentes formas de conexión. Dado que, por defecto, el puerto para HTTP es el número 80, el siguiente URL es equivalente al previo.</p>\n<pre><code class=\"language-xml\">http://oldbaileyonline.org:80\n</code></pre>\n<p>Como sabes, generalmente hay muchas páginas en un determinado sitio web. Éstas están almacenadas en directorios del servidor y tú puedes especificar la ruta (<em>path</em>) a una página en particular. La página “Acerca de” del <em>The Old Bailey Online</em> tiene el siguiente URL:</p>\n<pre><code class=\"language-xml\">http://oldbaileyonline.org/static/Project.jsp\n</code></pre>\n<p>Por último, muchas páginas web te permiten introducir consultas. El sitio web <em>The Old Bailey Online</em>, por ejemplo, está diseñado de tal manera que puedes solicitar una página en particular utilizando una <a href=\"https://es.wikipedia.org/wiki/Query_string\"><em>cadena de consulta</em></a>. EL siguiente URL te llevará a la página de resultados de búsqueda de registros de juicios criminales que contienen la palabra “arsenic” (arsénico)</p>\n<pre><code class=\"language-xml\">https://www.oldbaileyonline.org/search.jsp?form=searchHomePage&amp;_divs_fulltext=arsenic&amp;kwparse=and&amp;_persNames_surname=&amp;_persNames_given=&amp;_persNames_alias=&amp;_offences_offenceCategory_offenceSubcategory=&amp;_verdicts_verdictCategory_verdictSubcategory=&amp;_punishments_punishmentCategory_punishmentSubcategory=&amp;_divs_div0Type_div1Type=&amp;fromMonth=&amp;fromYear=&amp;toMonth=&amp;toYear=&amp;ref=&amp;submit.x=0&amp;submit.y=0\n</code></pre>\n<p>El fragmento de texto después de “?” representa la consulta. Puedes aprender más acerca de la construcción de consultas en <a href=\"/lessons/downloading-multiple-records-using-query-strings\">Descarga de registros múltiples usando cadenas de consulta</a> (en inglés).</p>\n<h2 id=\"abrir-urls-con-python\">Abrir URLS con Python</h2>\n<p>Como historiador digital a menudo querás utilizar los datos alojados en una base de datos académica en línea. Para obtener estos datos puedes abrir una URL a la vez y copiar y pegar su contenido a un archivo de texto, o puedes utilizar Python para hacer una cosecha por  procesamiento automático de las páginas web. Para hacer esto tienes que ser capaz de abrir cualquier URL con tus propios programas. El lenguaje Python incluye un número de formas estándar para hacer esto.</p>\n<p>Como ejemplo, vamos a trabajar con una tipo de archivo que podrás encontrar haciendo investigación histórica. Digamos que te interesan las relaciones étnicas en la Gran Bretaña del siglo XVIII. The Old Bailey Online (OBO) es una rica fuente que proporciona transcripciones de juicios de 1674 a 1913 y es un buen lugar para buscar documentación.</p>\n<p>{% include figure.html filename=&quot;old-bailey.png&quot; caption=&quot;Página principal del sitio The Old Bailey Online&quot; %}</p>\n<p>Para este ejemplo vamos a utilizar la relatoría del juicio de Benjamin Bowsey, un “moro negro” que fue procesado por romper la paz durante las <a href=\"http://en.wikipedia.org/wiki/Gordon_Riots\">revueltas de Gordon</a> en 1780. El URL para esa entrada es:</p>\n<pre><code class=\"language-xml\">http://www.oldbaileyonline.org/browse.jsp?id=t17800628-33&amp;div=t17800628-33\n</code></pre>\n<p>Si estudiamos el URL podemos aprender varias cosas. En primer lugar, OBO fue escrito en JSP (+JavaServer Pages*, un lenguaje de programación que genera HTML), y es posible obtener entradas de procesos judiciales individuales haciendo uso de cadenas de consulta. A cada proceso se le asignó, aparentemente un número de identificación (ID) (<em>id=t</em> en el URL), compuesto a partir de la fecha del juicio en formato (<em>AAAA-MM-DD</em>) y el número de proceso dentro de esa sesión de la corte, en este caso: <em>33</em>. Si cambias <code>33</code> por <code>34</code> en tu navegador y presionas Enter, eso te deberá llevar al siguiente proceso. Desafortunadamente no todos los sitios web tienen estos URL tan legibles y fiables.</p>\n<p>{% include figure.html filename=&quot;bowsey-trial-page.png&quot; caption=&quot;Página de la transcripción del juicio de Benjamin Bowsey, 1780&quot; %}</p>\n<p>Tómate unos minutos para ver la página del proceso contra Benjamin Bowsey. No estamos muy interesados en lo que dice la relatoría sino en la información que proporciona la página. Al final de la misma notarás que hay un enlace <a href=\"http://www.oldbaileyonline.org/browse.jsp?foo=bar&amp;path=sessionsPapers/17800628.xml&amp;div=t17800628-33&amp;xml=yes\">View as XML</a> que te lleva a una versión de la página del texto profusamente etiquetado con <a href=\"https://es.wikipedia.org/wiki/Extensible_Markup_Language\">XML</a> que es muy útil para cierto tipo de investigaciones. También puedes ver un escaneo del <a href=\"http://www.oldbaileyonline.org/images.jsp?doc=178006280084\">documento original</a> que fue transcrito para hacer construir esta fuente.</p>\n<p>Ahora vamos a tratar de abrir la página usando Python. Copia el siguiente programa en Komodo Edit y guárdalo como <code>abre-paginaweb.py</code> Cuando ejecutes el programa abrirá la página del proceso judicial, leerá (<code>read</code>) su contenido en una cadena de texto de Python llamada <code>contenidoWeb</code> y luego te mostrará mediante <code>print</code> los primeros trescientos caracteres de la cadena en el panel de salida de comando. Usa el comando de Firefox <code>Herramientas -&gt; Desarrollador web -&gt; Código fuente de esta página</code> (Ctrl-U) para verificar que la fuente de la página de ese URL es la misma fuente que tu programa recupera. Consulta la biblioteca de referencias de Python para saber más de <a href=\"https://docs.python.org/3/library/urllib.html\">urllib</a>.</p>\n<pre><code class=\"language-python\"># abre-paginaweb.py\n\nimport urllib.request, urllib.error, urllib.parse\n\nurl = &#39;http://www.oldbaileyonline.org/browse.jsp?id=t17800628-33&amp;div=t17800628-33&#39;\n\nrespuesta = urllib.request.urlopen(url)\ncontenidoWeb = respuesta.read().decode(&#39;UTF-8&#39;)\n\nprint(contenidoWeb[0:300])\n</code></pre>\n<p>Estas cinco líneas de código logran mucho rápidamente. Vamos a detenernos un momento para asegurarnos de que todo está claro y que puedes reconocer los bloques que permiten que este programa haga lo que queremos que haga.</p>\n<p><em>url</em>, <em>respuesta</em> y <em>contenidoWeb</em> son variables que nosotros mismos hemos llamado así.</p>\n<p><em>url</em> contiene el URL de la página web que queremos descargar. En este caso, el juicio contra Benjamien Bowsey.</p>\n<p>En la línea siguiente invocamos a la función <code>urlopen</code> que está almacenada en un módulo de Python llamado <code>urllib.py</code> y le hemos pedido a esa función que abra el sitio web en el URL que le especificamos. Entonces, guardamos el resultado de ese proceso en una variable denominada <em>respuesta</em>. Esta variable contiene una versión abierta del sitio web solicitado.</p>\n<p>Utilizamos entonces el método <code>read</code>, que ya usamos anteriormente, para copiar el contenido de esa página web abierta en una nueva variable llamada <em>contenidoWeb</em>.</p>\n<p>Asegúrate de que puedes reconocer las variables (hay 3), los módulos (1), los métodos (2) y los parámetros (1) antes de seguir adelante.</p>\n<p>Al ejecutar el programa, te darás cuenta que en el panel de salida se muestra algo etiquetado en HTML:</p>\n<pre><code class=\"language-xml\">&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Strict//EN&quot; &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd&quot;&gt;\n&lt;html xmlns=&quot;http://www.w3.org/1999/xhtml&quot; xml:lang=&quot;en&quot; lang=&quot;en&quot;&gt;\n&lt;head&gt;\n    &lt;title&gt;Browse - Central Criminal Court&lt;/title&gt;\n    &lt;meta http-equiv=&quot;content-type&quot; content=\n</code></pre>\n<p>El contenido del proceso judicial está mucho más adelante en la página. Lo que vemos aquí es solamente en código HTML de la parte superior del documento. Esto no es lo que necesitamos para una investigación histórica, pero no te preocupes: en breve aprenderás cómo quitar el exceso de etiquetas y obtener el contenido que estás buscando.</p>\n<h2 id=\"guardar-una-copia-local-de-una-página-web\">Guardar una copia local de una página web</h2>\n<p>Dado que ya sabes lo suficiente acerca de escribir en archivos, resulta bastante sencillo modificar el programa anterior para que escriba el contenido de la cadena de texto <em>contenidoWeb</em> en un archivo local de nuestra computadora en vez de en el panel de salida. Copia el siguiente programa en Komodo Edit, guárdalo como <code>guardar-paginaweb.py</code> y ejecútalo. Abre en tu navegador el archivo creado en tu disco duro (<code>obo-t17800628-33.html</code>) para confirmar que la copia que guardaste es igual a la que está en línea.</p>\n<pre><code class=\"language-python\"># guardar-paginaweb.py\n\nimport urllib.request, urllib.error, urllib.parse\n\nurl = &#39;http://www.oldbaileyonline.org/browse.jsp?id=t17800628-33&amp;div=t17800628-33&#39;\n\nrespuesta = urllib.request.urlopen(url)\ncontenidoWeb = respuesta.read().decode(&#39;UTF-8&#39;)\n\n\nf = open(&#39;obo-t17800628-33.html&#39;, &#39;w&#39;)\nf.write(contenidoWeb)\nf.close\n</code></pre>\n<p>Ahora, si tu puedes guardar un solo archivo así de fácil, ¿es posible escribir un programa que te permita descargar un puñado de archivos? ¿Es posible incrementar la cantidad de IDs de los juicios y obtener copias de todos ellos en una sola descarga? Efectivamente. Puedes aprender cómo hacerlo en la lección <a href=\"/lessons/downloading-multiple-records-using-query-strings\">Downloading Multiple Files using Query Strings</a>, que te recomendamos ver una vez completadas las lecciones introductorias de esta serie.</p>\n<h2 id=\"lecturas-sugeridas\">Lecturas sugeridas</h2>\n<ul>\n<li>Lutz, Mark. “Ch. 4: Introducing Python Object Types”, <em>Learning\nPython</em> (O’Reilly, 1999).</li>\n</ul>\n<h3 id=\"sicronización-de-código\">Sicronización de código</h3>\n<p>Para seguir a lo largo de las lecciones futuras es importante que tengas los archivos correctos y programas en el directorio &quot;programming-historian&quot; de tu disco duro. Al final de cada lección puedes descargar el archivo zip &quot;python-es-lecciones&quot; para asegurarte que tienes el código correcto.</p>\n<ul>\n<li>python-es-lecciones1.zip (<a href=\"/assets/python-es-lecciones1.zip\">zip</a>)</li>\n</ul>\n"}