{"metadata":{"title":"An Introduction to Twitterbots with Tracery\n","authors":["Shawn Graham"],"date":"2017-08-29T00:00:00.000Z","reviewers":["Lee Skallerup Bessette","Adam Crymble","Nick Ruest"],"layout":"lesson","difficulty":2,"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/75","editors":["Jessica Parr"],"activity":"presenting","topics":["api"],"abstract":"An Introduction to Twitter Bots with Tracery\nThis lesson explains how to create simple twitterbots using Tracery and the Cheap Bots Done Quick service. Tracery exists in multiple languages and can be integrated into websites, games, bots.","redirect_from":"/lessons/intro-to-twitterbots","avatar_alt":"A device with several interlocking gears","doi":"10.46430/phen0069"},"html_body":"<h1 id=\"an-introduction-to-twitter-bots-with-tracery\">An Introduction to Twitter Bots with Tracery</h1>\n<p>This lesson explains how to create simple twitterbots using the <a href=\"http://tracery.io\">Tracery generative grammar</a> and the <a href=\"http://cheapbotsdonequick.com/\">Cheap Bots Done Quick</a> service. Tracery exists in multiple languages and can be integrated into websites, games, bots. You may fork it <a href=\"https://github.com/galaxykate/tracery/tree/tracery2\">on github here</a>.</p>\n<h2 id=\"why-bots\">Why bots?</h2>\n<p>Strictly speaking, a twitter bot is a piece of software for automated controlling a Twitter account. When thousands of these are created and are tweeting more or less the same message, they have the ability to shape discourse on Twitter which then can influence other media discourses. Bots of this kind <a href=\"http://www.sciencedirect.com/science/article/pii/S0747563213003129\">can even be seen as credible sources of information</a>. Projects such as <a href=\"http://www.docnow.io/\">Documenting the Now</a> are creating tools to allow researchers to create and query archives of social media around current events - and which will naturally contain many bot-generated posts. In this tutorial, I want to demonstrate how one can build a simple twitterbot so that, knowing how they operate, historians may more easily spot the bots in our archives - and perhaps counter with bots of their own.</p>\n<p>But I believe also that there is space in digital history and the digital humanities more generally for creative, expressive, artistic work. I belive that there is space for programming historians to use the affordances of digital media to create <em>things</em> that could not otherwise exist to move us, to inspire us, to challenge us. There is room for satire; there is room for comment. With Mark Sample, I believe that there is a need for &#39;<a href=\"https://medium.com/@samplereality/a-protest-bot-is-a-bot-so-specific-you-cant-mistake-it-for-bullshit-90fe10b7fbaa\">bots of conviction</a>&#39;.</p>\n<p>These are protest bots, bots so topical and on-point that they can’t be mistaken for anything else. Per Sample, such bots should be</p>\n<p><strong>topical</strong> – “They are about the morning news — and the daily horrors that fail to make it into the news.”</p>\n<p><strong>data-based</strong> – “They draw from research, statistics, spreadsheets, databases. Bots have no subconscious, so any imagery they use should be taken literally”</p>\n<p><strong>cumulative</strong> – “The repetition builds on itself, the bot relentlessly riffing on its theme, unyielding and overwhelming, a pile-up of wreckage on our screens.”</p>\n<p><strong>oppositional</strong> – “protest bots take a stand. Society being what it is, this stance will likely be unpopular, perhaps even unnerving”</p>\n<p><strong>uncanny</strong> – “The appearance of that which we had sought to keep hidden.”</p>\n<p>I want to see more protest bots, bots that confront us with hard truths, bots that, in their inhuman persistence, call out for justice. Caleb McDaniel&#39;s <a href=\"https://twitter.com/Every3Minutes\"><em>every 3 minutes</em></a> shames us with its unrelenting reminder that every three minutes, a human being was sold into slavery in the Antebellum South.</p>\n<p>{% include figure.html filename=&quot;bot-lesson-every3minutes.png&quot; caption=&quot;A screenshot of the Every3Minutes Twitter page&quot; %}</p>\n<p><em>every3minutes alone is reason enough to want to build a history bot</em>.</p>\n<p>Some suggestions to get you thinking, from individuals on Twitter who responded to my question about what the bots of conviction for history and archaeology might look like</p>\n<blockquote>\n<p>@electricarchaeo a bot tweeting full-resolution images of cultural heritage locked behind tile viewers and fraudulent copyright claims by their holding inst?\n— Ryan Baumann (@ryanfb) April 22, 2017</p>\n</blockquote>\n<blockquote>\n<p>@electricarchaeo A bot tweeting pictures of Native American sacred places that have been desecrated in the name of corporate greed.\n— Cory Taylor (@CoryTaylor_) April 22, 2017</p>\n</blockquote>\n<blockquote>\n<p>@electricarchaeo A bot tweeting the identities of historical assets given inheritance #tax exemption because they are &quot;available&quot; to public view\n— Sarah Saunders (@Tick_Tax) April 22, 2017</p>\n</blockquote>\n<blockquote>\n<p>@electricarchaeo A bot tweeting the names of slaves owned by top universities, or of those who built government buildings like the White House.\n— Cory Taylor (@CoryTaylor_) April 22, 2017</p>\n</blockquote>\n<blockquote>\n<p>@electricarchaeo Every time someone says &quot;since the beginning of time, humans have&quot; automatically responding BULLSHIT\n— Colleen Morgan (@clmorgan) April 22, 2017</p>\n</blockquote>\n<blockquote>\n<p>@electricarchaeo A bot imagining the reactions of Afghans, Iraqis, Syrians, Yemenis, when their family members are killed by drone attacks.\n— Cory Taylor (@CoryTaylor_) April 22, 2017</p>\n</blockquote>\n<p>Given that so much historical data is expressed on the web as <a href=\"http://json.org/\">JSON</a>, a bit of digging should find you data that you can actually fold into your bot.</p>\n<p>My method is that of the bricoleur, the person who adapts and pastes together the bits and bobs of code that he finds; in truth, most programming functions this way. There are many packages available that will interface with Twitter&#39;s API, in various languages. There is little &#39;programming&#39; in this lesson in the sense of writing bots in (for instance) Python. In this introductory lesson, I will show you how to build bots that tell stories, that write poetry, that do wonderful things using Tracery.io as our <em>generative grammar</em>, in conjunction with the Cheap Bots Done Quick service to host the bot. For more tutorials on building and hosting Twitter bots with other services, see <a href=\"https://botwiki.org/tutorials/twitterbots/\">the Botwiki tutorial list</a>.</p>\n<p>My most successful bot has been <a href=\"http://twitter.com/tinyarchae\">@tinyarchae</a>, a bot that tweets scenes from a horrible dsyfunctional archaeological excavation project. Every archaeological project deals with problems of sexism, abuse, and bad faith; @tinyarchae pushes the stuff of conference whispers to a ridiculous extreme. It is a caricature that contains a kernel of uncomfortable truth. Other bots I have built glitch <a href=\"https://twitter.com/archaeoglitch\">archaeological photography</a>; one is actually useful, in that it is <a href=\"https://twitter.com/botarchaeo\">tweeting out new journal articles in archaeology</a> and so serves as a research assistant. (For more thoughts on the role bots play in public archaeology, see this <a href=\"https://electricarchaeology.ca/2017/04/27/bots-of-archaeology-machines-writing-public-archaeology/\">keynote</a> from the <a href=\"http://web.archive.org/web/20180131161516/https://publicarchaeologyconference.wordpress.com/\">Public Archaeology Twitter Conference</a>).</p>\n<h1 id=\"planning-what-will-your-bot-do\">Planning: What will your bot do?</h1>\n<p>We begin with pad and paper. As a child in elementary school, one activity we often did to learn the basics of English grammar was called &#39;mad-libs&#39; (as in, &#39;silly - mad - ad libs&#39;). The teacher performing this activity would ask the class to, say, list a noun, then and adverb, then a verb, and then another adverb. Then on the other side of the sheet there would be a story with blank spaces like this:</p>\n<p>&quot;Susie the _noun_ was _adverb_  _verb_ the _noun_.&quot;</p>\n<p>and students would fill in the blanks appropriately. It was silly; and it was fun. Twitterbots are to madlibs what sports cars are to horse and wagons. The blanks that we might fill in could be values in svg vector graphics. They could be numbers in numeric file names (and thus tweet random links to an open database, say). They could be, yes, even nouns and adverbs. Since Twitterbots live on the web, the building blocks that we put together can be more than text (although, for the time being, text will be easiest to work with).</p>\n<p>We are going to start by sketching out a <em>replacement grammar</em>. The conventions of this grammar were developed by Kate Compton (<a href=\"https://twitter.com/galaxykate\">@galaxykate</a> on Twitter); it&#39;s called <a href=\"http://tracery.io\">Tracery.io</a>. It can be used as a javascript library in webpages, in games, and in bots. A replacement grammar works rather similarly to the madlibs you might remember as a child.</p>\n<p><em>In order to make it clear what the <em>grammar</em> is doing, we are going to <em>not</em> create a history bot for the time being. I want to make it clear what the grammar does, and so we will build something surreal to surface how that grammar works.</em></p>\n<p>Let&#39;s imagine that you would like to create a bot that speaks with the voice of a potted plant - call it, <em>plantpotbot</em>. What kinds of things might <em>plantpotbot</em> say? Jot down some ideas-</p>\n<ul>\n<li>I am a plant in a pot. How boring it is!</li>\n<li>Please water me. I&#39;m begging you.</li>\n<li>This pot. It&#39;s so small. My roots, so cramped!</li>\n<li>I turned towards the sun. But it was just a lightbulb</li>\n<li>I&#39;m so lonely. Where are all the bees?</li>\n</ul>\n<p>Now, let&#39;s look at how these sentences have been constructed. We are going to replace words and phrases with <em>symbols</em> so that we can regenerate the original sentences. There are a number of sentences that being with &#39;I&#39;. We can begin to think of an &#39;being&#39; <em>symbol</em>:</p>\n<pre><code>&quot;being&quot;: &quot;am a plant&quot;,&quot;am begging you&quot;,&quot;am so lonely&quot;,&quot;turned towards the sun&quot;\n</code></pre>\n<p>This notation is saying to us that the symbol &quot;being&quot; can be replaced by (or is equivalent to) the phrases &quot;am a plant&quot;, &quot;am begging you&quot; and so on.</p>\n<p>We can mix symbols and text, in our bot. If we tell the bot to start with the word &quot;I&quot;, we can insert the <em>symbol</em> &#39;being&#39; after it and complete the phrase with &quot;am a plant&quot; or &quot;turned towards the sun&quot; and the sentence will make <em>grammatical</em> sense. Let&#39;s build another symbol; perhaps we call it &#39;placewhere&#39;:</p>\n<pre><code>&quot;placewhere&quot;: &quot;in a pot&quot;,&quot;on the windowsill&quot;,&quot;fallen over&quot;\n</code></pre>\n<p>(&quot;placewhere&quot; is the <em>symbol</em> and &quot;in a pot&quot; and so on are the <em>rules</em> that replace it)</p>\n<p>Now, in our sentences from our brainstorm, we never used the phrase, &#39;on the windowsill&#39;, but once we identified &#39;in a pot&#39;, other potential equivalent ideas jump out. Our bot will eventually use these <em>symbols</em> to make sentences. The symbols - &#39;being&#39;, &#39;placewhere&#39; - are like our madlibs when they asked for a list of nouns, adverbs and so on. Imagine then we pass the following to our bot:</p>\n<pre><code>&quot;I #being# #placewhere#&quot;\n</code></pre>\n<p>Possible outcomes will be:</p>\n<ul>\n<li>I am so lonely on the windowsill</li>\n<li>I am so lonely in a pot</li>\n<li>I turned toward the sun fallen over</li>\n</ul>\n<p>With tweaking, and breaking the units of expression into smaller symbols, we can fix any expressive infelicities (or indeed, decide to leave them in to make the voice more &#39;authentic&#39;.)</p>\n<h2 id=\"prototyping-with-a-tracery-editor\">Prototyping with a Tracery editor</h2>\n<p>There is a Tracery editor at <a href=\"http://www.brightspiral.com/tracery\">www.brightspiral.com/tracery/</a>. We will use that to work out the kinks in <em>plantpotbot</em>. The editor visualizes the way the symbols and rules of the grammar interact (how they are nested, and the kinds of output your grammar will generate). Open the editor in a new window. You should see this:</p>\n<p>{% include figure.html filename=&quot;bot-lesson-editor.png&quot; caption=&quot;The Tracery Editor at Brightspiral.com&quot; %}</p>\n<p>The dropdown menu at the top-left, marked &#39;tinygrammar&#39;, has some other example grammars that one can explore; they show just how complicated Tracery can become. For the time being, remain with &#39;tinygrammar&#39;. One of the nice things about this editor is that you can press the &#39;show colors&#39; button, which will color code each symbol and its rules, color-coding the generated text so that you can see which element belongs to what symbol.</p>\n<p>If you double-click on a symbol in the default grammar (<code>name</code> or <code>occupation</code>) and hit your delete key, you will remove the symbol from the grammar. Do so for &#39;name&#39; and &#39;occupation&#39;, leaving only &#39;origin&#39;. Now, add a new symbol by clicking on the &#39;new symbol&#39; button. Click on the name (<code>symbol1</code>) and rename it <code>being</code>. Click the <code>+</code> sign and add some of our rules above. Repeat for a new symbol called <code>placewhere</code>.</p>\n<p>{% include figure.html filename=&quot;bot-lesson-plantbot.png&quot; caption=&quot;Building the grammar for plantpotbot&quot; %}</p>\n<p>As you do that, the editor will flash an error message at the top right, &#39;ERROR: symbol &#39;name&#39; not found in tinygrammar&#39;. This is because we deleted <code>name</code>, but the symbol <code>origin</code> has as one of its rules the symbol <code>name</code>! This is interesting: it shows us that we can <em>nest</em> symbols within rules. Right? We could have a symbol called &#39;character&#39;, and character could have sub-symbols called &#39;first name&#39;, &#39;last name&#39; and &#39;occupation&#39; (and each of these containing an appropriate list of first names and last names and occupations). Each time the grammar was run, you&#39;d get e.g. &#39;Shawn Graham Archaeologist&#39; and stored in the &#39;character&#39; symbol</p>\n<p>The other interesting thing here is that <code>origin</code> is a special symbol. It&#39;s the one from which the text is ultimately generated (the grammar is <em>flattened</em> here). So let&#39;s change the <code>origin</code> symbol&#39;s rule so that <em>plantpotbot</em> may speak. (When you reference another symbol within a rule, you wrap it with <code>#</code> marks, so this should read: <code>#being# #placewhere#</code>).</p>\n<p>It still is missing something - the word &#39;I&#39;. You can mix ordinary text into the rules. Go ahead and do that now - press the <code>+</code> beside the rule for the <code>origin</code> symbol, and add the word &#39;I&#39; so that the origin now reads <code>I #being# #placewhere#</code>. Perhaps your plantbot speaks with a poetic diction by reversing <code>#placewhere# #being#</code>.</p>\n<p>If you press &#39;save&#39; in the editor, your grammar will be timestamped and will appear in the dropdown list of grammars. It&#39;s being saved to your browser&#39;s cache; if you clear the cache, you will lose it.</p>\n<p>Before we move on, there is one last thing to examine. Press the JSON button in the editor. You should see something like this:</p>\n<pre><code class=\"language-JSON\">{\n    &quot;origin&quot;: [\n        &quot;I #being# #placewhere#&quot;\n    ],\n    &quot;being&quot;: [\n        &quot;am so lonely&quot;,\n        &quot;am so lonely&quot;,\n        &quot;am begging you&quot;,\n        &quot;am turned towards the sun&quot;\n    ],\n    &quot;placewhere&quot;: [\n        &quot;in a pot&quot;,\n        &quot;in a windowsill&quot;,\n        &quot;fallen over&quot;\n    ]\n}\n</code></pre>\n<p>Every Tracery grammar is actually a JSON object consisting of key/value pairs, which is what Tracery calls symbols and rules. (For more on JSON, please see <a href=\"/lessons/json-and-jq\">this tutorial by Matthew Lincoln</a>). This is the format we will be using when we actually set our bot up to start tweeting. JSON is finicky. Note how the symbols are wrapped in <code>&quot;</code> as are the rules, but the rules are also listed with commas inside <code>[</code> and <code>]</code>. Remember:</p>\n<pre><code class=\"language-JSON\">{\n  &quot;symbol&quot;: [&quot;rule&quot;,&quot;rule&quot;,&quot;rule&quot;],\n  &quot;anothersymbol&quot;: [&quot;rule,&quot;,&quot;rule&quot;,&quot;rule&quot;]\n}\n</code></pre>\n<p>(of course, the number of symbols and rules is immaterial, but make sure the commas are right!)</p>\n<p>It is good practice to copy that JSON to a text editor and save another copy somewhere safe.</p>\n<h2 id=\"but-what-would-a-proper-historybot-look-like\">But what would a proper &#39;historybot&#39; look like?</h2>\n<p>Now, re-do the exercise above, but think hard about what a bot for history could look like given the constraints of Tracery. Build a simple grammar to express that idea, and make sure to save it. Here are some other things to think about as you design your grammar:</p>\n<p>Some of the fun of Twitterbots comes from their serendipitous placement with other tweets in your timeline (you should follow your own bot, just to keep tabs on it):</p>\n<p>{% include figure.html filename=&quot;bot-lesson-maniacallaughbot.jpg&quot; caption=&quot;Maniacallaughbot wins again&quot; %}</p>\n<p>Remember that your bot will be appearing in other people&#39;s timelines. The potential for juxtaposition of your bot&#39;s message(s) against other peoples tweets will also influence the relative success of the bot.</p>\n<p>{% include figure.html filename=&quot;bot-lesson-interaction-with-tinyarchae.png&quot; caption=&quot;An interaction with Tinyarchae prompts wistful reflection&quot; %}</p>\n<h1 id=\"get-a-twitter-account-for-your-bot-and-connect-it-to-cheap-bots-done-quick\">Get a twitter account for your bot and connect it to Cheap Bots Done Quick</h1>\n<p>You can plumb a bot into your own, current, account, but you probably don&#39;t want a bot tweeting <em>as</em> you or <em>for</em> you. In which case, set up a new Twitter account. When you set up a new Twitter account, Twitter will want an email address. You can use a brand new email address, or, if you have a Gmail account, you can use the <code>+tag</code> trick, ie instead of &#39;johndoe&#39; at gmail, you use <code>johndoe+twitterbot</code> at gmail. Twitter will accept that as a distinct email from your usual email.</p>\n<p>Normally, when one is building a Twitterbot, one has to create an app on twitter (at <a href=\"http://apps.twitter.com\">apps.twitter.com</a>), obtain the consumer secret and key, and the access token and key. Then you have to program in authentication so that Twitter knows that the program trying to access the platform is permitted.</p>\n<p>Fortunately, we do not have to do that, since George Buckenham created the bot hosting site &#39;<a href=\"http://cheapbotsdonequick.com/\">Cheap Bots Done Quick</a>&#39;. (That website also shows the JSON source grammar for a number of different bots, which can serve as inspiration). Once you&#39;ve created your bot&#39;s Twitter account - and you are logged in to Twitter as the bot account-  go to Cheap Bots Done Quick and hit the &#39;sign in with Twitter&#39; button. The site will redirect you to Twitter to approve authorization, and then bring you back to Cheap Bots Done Quick.</p>\n<p>The JSON that describes your bot can be written or pasted into the main white box. Take the JSON from the editor and paste it into the main white box. If there are any errors in your JSON, the output box at the bottom will turn red and the site will try to give you an indication of where things have gone wrong. In most cases, this will be because of an errant comma or quotation mark. If you hit the refresh button to the right of the output box (NOT the browser refresh button!), the site will generate new text from your grammar.</p>\n<p>{% include figure.html filename=&quot;bot-lesson-cbdq.png&quot; caption=&quot;The Cheap Bots Done Quick interface&quot; %}</p>\n<p>Underneath the JSON box are some settings governing how often your bot will tweet, whether your source grammar will be visible to others, and whether or not your bot will reply to messages or mentions:</p>\n<p>{% include figure.html filename=&quot;bot-lesson-settings.png&quot; caption=&quot;The settings for your bot&quot; %}</p>\n<p>Decide how often you want your bot to tweet, and whether you want the source grammar visible. Then... the moment of truth. Hit the &#39;tweet&#39; button, then go check your bot&#39;s twitter feed. Click &#39;save&#39;.</p>\n<p>Congratulations, you have built a Twitterbot!</p>\n<h2 id=\"good-bot-citizenship\">Good bot citizenship</h2>\n<p>As Cheap Bots Done Quick is a service provided by George Buckenham out of a spirit of goodwill, do not use the service to create bots that are offensive or abusive or that otherwise will spoil the service for everyone else. As he writes,</p>\n<blockquote>\n<p>If you create a bot I deem abusive or otherwise unpleasant (for example, @mentioning people who have not consented, posting insults or using slurs) I will take it down</p>\n</blockquote>\n<p>Other pointers for good bot citizenship are provided by Darius Kazemi, one of the great bot artists, are discussed <a href=\"http://tinysubversions.com/2013/03/basic-twitter-bot-etiquette/\">here</a>.</p>\n<h1 id=\"going-further-with-tracery\">Going further with Tracery</h1>\n<p>Many bots are a good deal more complicated than what we have described here, but it is enough to get you started. Some surprisingly effective bots can be created using Tracery.</p>\n<h2 id=\"modifying-symbols\">Modifying symbols</h2>\n<p>Tracery is smart enough to know when a word should take &#39;a&#39; versus &#39;an&#39;, and how to pluralize words, or capitalize them. This means that you can provide the base word in a rule, and then add modifiers as appropriate. Consider:</p>\n<pre><code>&quot;origin&quot;:[&quot;#size.capitalize# #creature.s# are nice&quot;]\n&quot;size&quot;:[&quot;small&quot;,&quot;big&quot;,&quot;medium&quot;]\n&quot;creature&quot;:[&quot;pig&quot;,&quot;cow&quot;,&quot;kangaroo&quot;]\n</code></pre>\n<p>would generate sentences like</p>\n<p><code>Big cows are nice</code></p>\n<p><code>Small pigs are nice</code></p>\n<p>The modifiers <code>.capitalize</code> and <code>.s</code> are added inside the <code>#</code> of the symbol they are meant to modify. Other modifiers are <code>.ed</code> for past tense, and <code>.a</code> for a/an. There may be more; Tracery is a work in progress.</p>\n<h2 id=\"use-emoji\">Use Emoji</h2>\n<p>Emoji can be used to great effect in Twitterbots. You can copy and paste emoji directly into the Cheap Bots Done Quick editor; each emoji should be within quotation marks as any other rule would be. Use <a href=\"http://unicode.org/emoji/charts/full-emoji-list.html\">this list</a> to find the emoji you wish to use, and make sure to copy and paste the emoji from the Twitter column to ensure that your emoji will display.</p>\n<h2 id=\"reusing-generated-symbols-with-actions\">Reusing Generated Symbols with Actions</h2>\n<p>This feature probably would not be used much in the case of a Twitterbot, but if one was using Tracery to generate a longer story or poem, it can be used so that Tracery remembers the first time it selected a particular rule for a symbol - eg we could get it to always used the same creature every time <code>creature</code> was called subsequently. This is called an &#39;action&#39; by Tracery. The form is #[someAction]someSymbol#. This can be confusing, and this aspect of Tracery is still being developed. To see it in action, copy and past the json below into this Tracery editor by Beau Gunderson: <a href=\"https://beaugunderson.com/tracery-writer/\">https://beaugunderson.com/tracery-writer/</a> (select and delete the default text. The Tracery editor we were using earlier does not handle saving data very well, so this alternative is a better tool for our present purposes).</p>\n<pre><code class=\"language-JSON\">{\n    &quot;size&quot;: [\n        &quot;small&quot;,\n        &quot;big&quot;,\n        &quot;medium&quot;\n    ],\n    &quot;creature&quot;: [\n        &quot;pig&quot;,\n        &quot;cow&quot;,\n        &quot;kangaroo&quot;\n    ],\n    &quot;poem&quot;:[&quot;My pet #animalfriend# was a very #animalfriendsize# #animalfriend# indeed. My #animalfriend# was named Lucky&quot;],\n      &quot;origin&quot;:[&quot;#[animalfriend:#creature#][animalfriendsize:#size#]poem#&quot;]\n\n}\n</code></pre>\n<p>Another, slightly more complex example is example number 5 at Kate Compton&#39;s own tutorial site at <a href=\"http://www.crystalcodepalace.com/traceryTut.html\">http://www.crystalcodepalace.com/traceryTut.html</a>:</p>\n<pre><code class=\"language-JSON\">{\n    &quot;name&quot;: [&quot;Arjun&quot;,&quot;Yuuma&quot;,&quot;Darcy&quot;,&quot;Mia&quot;,&quot;Chiaki&quot;,&quot;Izzi&quot;,&quot;Azra&quot;,&quot;Lina&quot;]\n,    &quot;animal&quot;: [&quot;unicorn&quot;,&quot;raven&quot;,&quot;sparrow&quot;,&quot;scorpion&quot;,&quot;coyote&quot;,&quot;eagle&quot;,&quot;owl&quot;,&quot;lizard&quot;,&quot;zebra&quot;,&quot;duck&quot;,&quot;kitten&quot;]\n,    &quot;mood&quot;: [&quot;vexed&quot;,&quot;indignant&quot;,&quot;impassioned&quot;,&quot;wistful&quot;,&quot;astute&quot;,&quot;courteous&quot;]\n,    &quot;story&quot;: [&quot;#hero# traveled with her pet #heroPet#.  #hero# was never #mood#, for the #heroPet# was always too #mood#.&quot;]\n,    &quot;origin&quot;: [&quot;#[hero:#name#][heroPet:#animal#]story#&quot;]\n\n}\n</code></pre>\n<p>Tracery reads the origin, and before it gets to the <code>story</code> symbol it sees an action called <code>hero</code> that it sets from the symbol <code>name</code>. The it does the same for <code>heroPet</code> from <code>animal</code>. With these set it then reads <code>story</code>. Within <code>story</code> the symbol <code>hero</code> reads what was just set by the action, and returns that same value each time. So, if &#39;Yuuma&#39; was selected by the action, then the story will read <code>Yuuma traveled with her pet... Yuuma was never...</code>. If we <em>didn&#39;t</em> set the hero&#39;s name via the action, then the story generated might change the hero&#39;s name in mid story!</p>\n<h2 id=\"responding-to-mentions-in-cheap-bots-done-quick\">Responding to mentions in Cheap Bots Done Quick</h2>\n<p><a href=\"http://cheapbotsdonequick.com/\">Cheap Bots Done Quick</a> has a beta feature that allows your bot to respond to mentions. (Warning: if you create two bots, and one mentions the other, the ensuing &#39;conversation&#39; can run for a very long time indeed; there is a 5% chance in any exchange that the bot won&#39;t respond, thus breaking the conversation).</p>\n<p>To set up a response pattern, click at the bottom of the page to set the button to &#39;reply to tweets&#39;. In the JSON editing box that appears, you set up the pattern for phrases that your bot will respond to. For instance, some of what @tinyarchae watches for:</p>\n<pre><code class=\"language-JSON\">{\n    &quot;hello&quot;:&quot;hello there!&quot;,\n    &quot;What|what&quot;:&quot;#whatanswer#&quot;,\n    &quot;Who|who&quot;:&quot;#whoanswer#&quot;,\n    &quot;When|when&quot;:&quot;#whenanswer#&quot;,\n    &quot;Where|where&quot;:&quot;#whereanswer#.&quot;,\n    &quot;Why|why&quot;:&quot;#whyanswer#&quot;,\n    &quot;How|how&quot;:&quot;#howanswer#&quot;,\n    &quot;Should|should|Maybe|maybe|if|If&quot;:&quot;#shouldanswer#&quot;\n}\n</code></pre>\n<p>The symbols here can include regular expression (Regex) patterns (see <a href=\"/lessons/understanding-regular-expressions\">this lesson</a> on regular expressions) . So, in the example above, the final symbol is watching for &#39;Should&#39; OR &#39;should&#39; OR &#39;Maybe&#39; OR &#39;maybe&#39; OR &#39;if&#39; OR &#39;IF&#39;. To respond to everything thrown its way, the symbol would be the simple dot: <code>.</code>. The rules can include simple text (as in the response to &quot;hello&quot;) or can be another symbol. The rules should be included in your main grammar in the first JSON editing box on the page. Thus, <code>#shouldanswer#</code> is in the main @tinyarchae grammar editor box as a line:</p>\n<pre><code class=\"language-JSON\">&quot;shouldanswer&quot;:[&quot;We asked #name#, who wrote &#39;An Archaeology of #verb.capitalize#&#39;. The answer is #yesno#.&quot;,&quot;This isn&#39;t magic 8 ball, you know.&quot;,&quot;This is all very meta, isn&#39;t it.&quot;,&quot;#name# says to tell you, &#39;42&#39;.&quot;],\n</code></pre>\n<p>At the very bottom of the page, you can test your mentions by writing a sample tweet that your bot will parse. If you&#39;ve set things up properly, you should see a response. If there is an error, the &#39;Response&#39; box will turn red and will give you some indication of where the error lies.</p>\n<p>{% include figure.html filename=&quot;bot-lesson-response.png&quot; caption=&quot;Testing your bot&#39;s response&quot; %}</p>\n<h2 id=\"svg-graphics\">SVG graphics</h2>\n<p>Since SVG is a text format that describes the geometry of a vector graphic, Tracery can be used to create rather artistic work - the <a href=\"https://twitter.com/TinyAdv\">Tiny Space Adventure</a> bot draws a starfield, a spaceship, and a plot. Its grammar <a href=\"https://pastebin.com/YYtZnzZ0\">may be viewed here</a>. The key issue with generating svg with Tracery is to get the components correct. The source code for the <a href=\"http://cheapbotsdonequick.com/source/softlandscapes\">softlandscapes bot</a> can be a useful model. This bot begins by defining the critical text that marks out SVG:</p>\n<pre><code>&quot;origin2&quot;: [&quot;#preface##defs##bg##mountains##clouds##ending#&quot;],\n&quot;preface&quot;:&quot;{svg &lt;svg xmlns=\\&quot;http://www.w3.org/2000/svg\\&quot; xmlns:xlink=\\&quot;http://www.w3.org/1999/xlink\\&quot; height=\\&quot;#baseh#\\&quot; width=\\&quot;#basew#\\&quot;&gt;&quot;\n</code></pre>\n<p>and then :</p>\n<pre><code>&quot;ending&quot;:&quot;&lt;/svg&gt;}&quot;\n</code></pre>\n<p>Working with SVG can be tricky, as things like backslashes, line endings, quotation marks and so on have to be escaped in order to work properly. As the site tells us,</p>\n<blockquote>\n<p> The syntax looks like this: {svg &lt;svg ...&gt; ... </svg>}. SVGs will need to specify a width and height attribute. Note that &quot;s within SVG files need to be escaped as \\&quot;, as does \\#s (\\#). {s and }s can be escaped as \\\\{ and \\\\}. Note: this feature is still in development, so the tweet button on this page will not work. And the debugging info is better in FF than other browsers.</p>\n</blockquote>\n<p>Bots that generate SVG are beyond the scope of this lesson, but careful study of existing bots should help you on your way.</p>\n<h2 id=\"music\">Music</h2>\n<p>Strictly speaking, this is no longer about bots, but since music can be notated in text, one can use Tracery to compose music and then use other libraries to convert this notation into Midi files - see <a href=\"http://www.codingblocks.net/videos/generating-music-in-javascript/\">http://www.codingblocks.net/videos/generating-music-in-javascript/</a> and my <a href=\"https://electricarchaeology.ca/2017/04/07/tracery-continues-to-be-awesome/\">own experiment</a>.</p>\n<h1 id=\"other-bot-tutorials\">Other Bot Tutorials</h1>\n<ul>\n<li>Zach Whalen <a href=\"http://www.zachwhalen.net/posts/how-to-make-a-twitter-bot-with-google-spreadsheets-version-04/\">How to make a Twitter Bot with Google Spreadsheets</a></li>\n<li>More on Tracery &amp; Twitterbots <a href=\"http://cmuems.com/2015b/tracery-twitterbots/\">http://cmuems.com/2015b/tracery-twitterbots/</a></li>\n<li>Casey Bergman, Keeping Up With the Scientific Literature using Twitterbots: The FlyPapers Experiment <a href=\"https://caseybergman.wordpress.com/2014/02/24/keeping-up-with-the-scientific-literature-using-twitterbots-the-flypapers-experiment/\">https://caseybergman.wordpress.com/2014/02/24/keeping-up-with-the-scientific-literature-using-twitterbots-the-flypapers-experiment/</a> also <a href=\"https://github.com/roblanf/phypapers\">https://github.com/roblanf/phypapers</a> ; in essence this method collects the RSS feed from journal articles, and then uses a service such as <a href=\"https://dlvrit.com/\">Dlvr.it</a> to push the links to a Twitter account.</li>\n<li>Discontinued: Stefan Bohacek has posted the code templates for a number of different kinds of bots at the code remixing site Glitch.com. If you visit his page, you will see a list of different kinds of bots; click on the &#39;remix&#39; button and then study the readme button carefully. Glitch requires a login via a Github or Facebook account.</li>\n<li>Finally, I would suggest joining the BotMakers Slack group to find more tutorials, like-minded individuals, and further resources: <a href=\"https://botmakers.org\">Sign up here</a></li>\n<li>The Botmakers&#39; Wiki also has a list of <a href=\"https://botwiki.org/tutorials/twitterbots/\">Twitterbot tutorials</a></li>\n</ul>\n<p>Finally, a list of Tracery-powered bots is maintained by Compton <a href=\"https://twitter.com/GalaxyKate/lists/tracery-bots\">here</a>. Have fun! May your bots flummox, entertain, inspire, and confound.</p>\n<h1 id=\"references\">References</h1>\n<p>Compton, K., Kybartas, B., Mateas, M.: Tracery: An author-focused generative text tool. In: Proceedings of the 8th International Conference on Interactive Digital Storytelling. pp. 154–161 (2015)</p>\n"}