{"metadata":{"title":"Poniendo Omeka a funcionar","authors":["Miriam Posner"],"date":"2016-02-17T00:00:00.000Z","translation_date":"2017-04-26T00:00:00.000Z","reviewers":["Sheila Brennan"],"editors":["Adam Crymble"],"translator":["Maria José Afanador-Llach"],"translation-editor":["Antonio Rojas Castro"],"translation-reviewer":["Antonio Rojas Castro","Alicia Calvo"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/61","layout":"lesson","original":"up-and-running-with-omeka","difficulty":1,"activity":"presenting","topics":["website"],"abstract":"Con Omeka.net es fácil crear sitios web que contengan colecciones de ítems.","avatar_alt":"Ilustración del esqueleto de un mamut en la exhibición de un museo, con gente a su alrededor.","doi":"10.46430/phes0022"},"html_body":"<p>{% include toc.html %}</p>\n<p><a href=\"http://www.omeka.net\">Omeka.net</a> facilita la creación de sitios web para mostrar colecciones de ítems.</p>\n<blockquote>\n<p><em>Nota de la traductora</em>: Antes de empezar es importante aclarar las diferencias entre <strong>Omeka.net</strong> y <strong>Omeka.org</strong>. Este tutorial es sobre <strong>Omeka.net</strong>, una plataforma de publicación en línea que permite a cualquier persona con una cuenta de acceso crear o colaborar en un sitio web para exhibir colecciones y construir exposiciones digitales. <strong>Omeka.net</strong> es una extensión de <strong>Omeka.org</strong> que está disponible para bajar e instalar en un servidor de tu propiedad. La traducción al español del tutorial de <em>The Programming Historian</em> sobre <a href=\"/lessons/installing-omeka\">cómo instalar Omeka</a> en un servidor se encuentra en proceso.\nal\nRegístrate para abrir una cuenta en Omeka</p>\n</blockquote>\n<hr>\n<p>{% include figure.html filename=&quot;up-and-running-01.png&quot; caption=&quot;Regístrate para una cuenta de prueba&quot; %}</p>\n<p>Entra a <a href=\"http://www.omeka.net\">www.omeka.net</a> y haz clic en <strong>Sign Up</strong>. Elige el plan &quot;Omeka trial&quot; (Plan de prueba). Rellena el formulario de registro. Revisa tu correo electrónico y haz clic en el enlace para activar tu cuenta.</p>\n<h2 id=\"crea-tu-nuevo-sitio-en-omeka\">Crea tu nuevo sitio en Omeka</h2>\n<p>{% include figure.html filename=&quot;up-and-running-02.png&quot; caption=&quot;Página de la cuenta de Omeka.net&quot; %}</p>\n<p>Tras hacer clic en el enlace en tu correo electrónico, haz clic en <strong>Add a Site</strong> (Añadir un sitio).</p>\n<p>Llena la información sobre el URL de tu sitio, el título que quieres usar y si quieres una descripción. Haz clic en <strong>Add Your Site</strong> (Añade tu sitio).</p>\n<h2 id=\"¡ahora-tienes-un-nuevo-sitio-en-omeka\">¡Ahora tienes un nuevo sitio en Omeka!</h2>\n<p>{% include figure.html filename=&quot;up-and-running-03.png&quot; caption=&quot;Ver sitio&quot; %}</p>\n<p>Para ver tu sitio, haz clic en <strong>View Site</strong> (Ver sitio).</p>\n<h2 id=\"un-sitio-vacío-de-omeka\">Un sitio vacío de Omeka</h2>\n<p>{% include figure.html filename=&quot;up-and-running-04.png&quot; caption=&quot;Vista pública&quot; %}\nEste es tu sitio vacío de Omeka esperando a ser llenado. Para regresar a tu panel de control (<em>dashboard</em>) haz clic en el botón <strong>Back</strong> (Atrás) o escribe  <strong><a href=\"http://www.omeka.net/dashboard\">http://www.omeka.net/dashboard</a></strong>. Esta vez haz clic en <strong>Manage Site</strong> (Administra el sitio).</p>\n<h2 id=\"cambia-de-plantilla\">Cambia de plantilla</h2>\n<p>{% include figure.html filename=&quot;up-and-running-05.png&quot; caption=&quot;Página de configuración de plantillas&quot; %}</p>\n<p>Omeka te permite cambiar la apariencia de tu sitio público por medio de las plantillas (<em>themes</em>). Para hacer esto, haz clic en <strong>Appearance</strong> (Apariencia) (en la esquina superior derecha de tu panel de control / <em>dashboard</em>). Cambia de plantilla seleccionando una de las opciones en la página. Presiona el botón verde <strong>Use this theme</strong> (Usa esta plantilla) para activar la nueva plantilla. Después visita tu sitio público haciendo clic en el nombre de tu sitio en la esquina superior izquierda de la página.</p>\n<h2 id=\"¡ahora-tienes-una-nueva-plantilla\">¡Ahora tienes una nueva plantilla!</h2>\n<p>{% include figure.html filename=&quot;up-and-running-06.png&quot; caption=&quot;Vista pública con la nueva plantilla&quot; %}</p>\n<p>Una vez hayas revisado tu nueva plantilla, regresa al tu panel de control (<em>dashboard</em>). Puedes regresar a tu plantilla antigua, quedarte con este o seleccionar una de las otras opciones.</p>\n<h2 id=\"instala-algunos-plugins\">Instala algunos plugins</h2>\n<p>{% include figure.html filename=&quot;up-and-running-07.png&quot; caption=&quot;Página de plugins&quot; %}</p>\n<p>Tu sitio de Omeka viene con plugins que ofrecen funciones adicionales. Necesitamos habilitarlos. Para hacer esto, haz clic en el menú <strong>Plugins</strong> en la parte superior. En la siguiente página haz clic en el botón <strong>Install</strong> (Instalar) para <strong>Exhibit Builder</strong> (Constructor de exposiciones) (deja las opciones como están en la página siguiente ) y para <strong>Simple Pages</strong> (Páginas simples).</p>\n<h2 id=\"añade-un-ítem-a-tu-archivo\">Añade un ítem a tu archivo</h2>\n<p>{% include figure.html filename=&quot;up-and-running-08.png&quot; caption=&quot;Add and Item (Añade un ítem)&quot; %}</p>\n<p>Haz clic en <strong>Items</strong> en el menú del lado izquierdo y después (¡naturalmente!) haz clic en <strong>Add an item</strong> (Añade un ítem).</p>\n<h2 id=\"describe-tu-nuevo-ítem\">Describe tu nuevo ítem</h2>\n<p>{% include figure.html filename=&quot;up-and-running-09.png&quot; caption=&quot;Haz tu ítem público marcando la caja que está circulada acá&quot; %}</p>\n<p>Recuerda, <strong>Dublin Core</strong> se refiere a la información descriptiva que introducirás sobre tu ítem. Toda esta información es opcional y no hay forma de que lo hagas incorrectamente. Pero trata de ser consistente.</p>\n<p>Asegúrate de marcar la caja de <strong>Public</strong> para que tu ítem sea visible por el público general. Si no marcas esa caja, solamente las personas que hayan iniciado sesión en tu sitio podrán ver el ítem.</p>\n<p>Para añadir múltiples campos —por ejemplo, si quieres añadirle múltiples temas (<em>subjects</em>) a tu ítem— usa el botón verde <strong>Add input</strong> situado a la izquierda de las cajas de texto.</p>\n<h2 id=\"una-cuestión-compleja\">Una cuestión compleja</h2>\n<p>{% include figure.html filename=&quot;up-and-running-10.png&quot; caption=&quot;¿Qué es esto?&quot; %}</p>\n<p>Estoy creando un registro de un ítem para mi perro Bertie. Pero, ¿estoy describiendo al <em>mismo</em> Bertie o una <em>fotografía</em> de Bertie? Si es lo primero, el <strong>Creator</strong> sería... bueno, supongo que eso depende de tus creencias religiosas. Si es lo segundo, el creador sería Brad Wallace, quien tomó la foto.</p>\n<p>La decisión de si vas a describir un objeto o la representación del objecto es tuya. Una vez hayas decidido sé consistente.</p>\n<h2 id=\"adjunta-un-archivo-al-registro-de-tu-ítem\">Adjunta un archivo al registro de tu ítem</h2>\n<p>{% include figure.html filename=&quot;up-and-running-11.png&quot; caption=&quot;Adjuntando archivos a un ítem&quot; %}</p>\n<p>Una vez hayas terminado de añadir metadatos Dublin Core, puedes adjuntar un archivo a tu ítem haciendo clic en <strong>Files</strong> en la parte superior del formulario de Dublin Core. (No tienes que hacer clic en <strong>Add Item</strong>, antes de hacer esto; Omeka guardará automáticamente tu información). Puedes adjuntar múltiples archivos, pero ten encuenta que el plan básico solo viene con 500 MB de espacio de almacenamiento.</p>\n<p>Una vez hayas añadido un archivo o archivos, puedes añadir <strong>Tags</strong> (Etiquetas) haciendo clic en el botón. También puedes hacer clic en <strong>Item Type Metadata</strong> (Tipos de metadatos del ítem) para seleccionar el tipo de objeto —persona, lugar, animal, vegetal, mineral— que sea tu ítem. Si no ves el tipo apropiado de ítem para tu ítem, no te preocupes. Más adelante podremos añadir un nuevo tipo de ítem.</p>\n<p>Cuando hayas acabado haz clic en el botón verde <strong>Add Item</strong> (Añadir ítem).</p>\n<h2 id=\"¡ya-tienes-un-ítem\">¡Ya tienes un ítem!</h2>\n<p>{% include figure.html filename=&quot;up-and-running-12.png&quot; caption=&quot;Explora ítems, vista de administrador&quot; %}</p>\n<p>Esta lista contiene todos los ítems que has añadido. Si el ítem no estuviera público, tendría (Private) después del título.  Para ver cómo se ve la página de tu nuevo ítem haz clic en el nombre del ítem.</p>\n<h2 id=\"esta-no-es-la-página-pública-de-tu-ítem\">Esta no es la página pública de tu ítem</h2>\n<p>{% include figure.html filename=&quot;up-and-running-13.png&quot; caption=&quot;Vista del ítem, vista de administrador&quot; %}</p>\n<p>Podría parecer que lo es, pero esta página no es lo que un usuario que no ha iniciado sesión verá cuando navegue por la página de tu ítem. Para ver lo que un usuarío vería haz clic en el botón azul <strong>View Public Page</strong> (Ver Página pública) a la derecha. (O puedes editar el ítem haciendo clic en <strong>Edit this item</strong> (Editar este ítem) arriba a la derecha).</p>\n<h2 id=\"esta-es-la-página-pública-para-tu-ítem\">Esta es la página pública para tu ítem</h2>\n<p>{% include figure.html filename=&quot;up-and-running-14.png&quot; caption=&quot;Vista del ítem, vista pública&quot; %}</p>\n<p>Esto es lo que un usuario general verá si navega por tu página.</p>\n<h2 id=\"crea-una-colección\">Crea una colección</h2>\n<p>{% include figure.html filename=&quot;up-and-running-15.png&quot; caption=&quot;Añade una collección&quot; %}</p>\n<p>Puedes empezar a ordenar tu lista de ítems al agruparlos en colecciones. Para hacer esto, regresa a tu panel de control (dashboard) y haz clic en la pestaña <strong>Collections</strong> (Colecciones) y en <strong>Add a Collection</strong> (Añade una colección).</p>\n<h2 id=\"introduce-información-sobre-tu-colección\">Introduce información sobre tu colección</h2>\n<p>{% include figure.html filename=&quot;up-and-running-16.png&quot; caption=&quot;Añade metadatos a tu colección&quot; %}</p>\n<p>¡En Omeka, los metadatos son clave! Introduce alguna información sobre tu colección y acuérdate de hacer clic en el botón <strong>Public</strong> cerca a la parte inferior de la página. Después guarda tu colección.</p>\n<h2 id=\"añade-ítems-a-tu-colección\">Añade ítems a tu colección</h2>\n<p>{% include figure.html filename=&quot;up-and-running-17.png&quot; caption=&quot;Haz clic en la caja al lado de cada ítem para editar en grupo&quot; %}</p>\n<p>Para llenar la colección que acabas de crear haz clic en la pestaña de <strong>Items</strong>. Desde tu lista de <strong>Browse Items</strong>, haz clic en las cajas de los ítems que pertenecen a tu nueva colección. Después haz clic en el botón <strong>Edit</strong> (Editar).</p>\n<h2 id=\"escoge-la-colección\">Escoge la colección</h2>\n<p>{% include figure.html filename=&quot;up-and-running-18.png&quot; caption=&quot;Selecciona una colección del menú desplegable&quot; %}</p>\n<p>En la página de <strong>Batch Edit Items</strong> (Editar ítems en grupo), selecciona la colección a la que le quieres añadir tus ítems. (También ten en cuenta todas las otras cosas que puedes hacer en esta página).</p>\n<h2 id=\"revisa-tu-nueva-colección\">Revisa tu nueva colección</h2>\n<p>{% include figure.html filename=&quot;up-and-running-19.png&quot; caption=&quot;Navega colecciones (<em>Browse collections</em>), vista pública&quot; %}</p>\n<p>Regresa a tu sitio público. Si haces clic en la pestaña <strong>Browse Collections</strong> (Navega colecciones) en el sitio público, debes ahora poder ver la nueva colección que contiene los ítems que identificaste en el paso anterior.</p>\n<p>Ahora que has añadido algunos ítems y los has agrupado en una colección, tómate un tiempo para jugar con tu sitio. Está empezando a tomar forma ahora que tienes ítems individuales y unidades temáticas. Pero Omeka puede hacer mucho más. Hablaremos sobre esto en la siguiente lección.</p>\n<h2 id=\"recursos-adicionales\">Recursos adicionales</h2>\n<p>El equipo de Omeka ha compilado un conjunto de muy buenos recursos en las <a href=\"http://info.omeka.net\">páginas de ayuda</a> del software.\n<a href=\"https://issuu.com/ralcaraz/docs/omeka-manual\">Este manual en español</a> contiene información útil para evaluar las ventajas y desventajas de usar <strong>Omeka.net</strong> u <strong>Omeka.org</strong>, al igual que instrucciones generales sobre cómo instalar Omeka en tu servidor.</p>\n"}