{"metadata":{"title":"Manipular cadenas de caracteres en Python","authors":["William J. Turkel","Adam Crymble"],"date":"2012-07-17T00:00:00.000Z","translation_date":"2017-03-15T00:00:00.000Z","editors":["Miriam Posner"],"reviewers":["Jim Clifford"],"translator":["Víctor Gayol"],"translation-editor":["Adam Crymble"],"translation-reviewer":["Jairo A. Melo","Maria José Afanador-Llach","Antonio Rojas Castro"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/43","layout":"lesson","next":"de-html-a-lista-de-palabras-1","previous":"trabajar-con-paginas-web","original":"manipulating-strings-in-python","python_warning":false,"difficulty":2,"activity":"transforming","topics":["python"],"abstract":"Esta lección es una rápida introducción a técnicas de manipulación de cadenas de caracteres (o strings) en Python.","avatar_alt":"Grabado de un joven tocando una guitarra","doi":"10.46430/phes0018","sequence":6,"series_total":14},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"objetivos-de-la-lección\">Objetivos de la lección</h2>\n<p>Esta lección es una rápida introducción a técnicas de manipulación de <a href=\"https://es.wikipedia.org/wiki/Cadena_de_caracteres\">cadenas de caracteres</a> (o <em>strings</em>) en Python. Saber cómo manipular cadenas de caracteres juega un papel fundamental en la mayoría de las tareas de procesamiento de texto. Si quieres experimentar con las siguientes lecciones puedes escribir y ejecutar pequeños programas tal como lo hicimos en lecciones previas, o puedes abrir tu intérprete de comandos de Python / Terminal para probarlos ahí.</p>\n<h2 id=\"manipular-cadenas-de-caracteres-en-python\">Manipular cadenas de caracteres en Python</h2>\n<p>Si has estado expuesto antes a otro lenguaje de programación, sabrás que necesitas <em>declarar</em> o <em>escribir</em> variables antes de que puedas almacenar cualquier cosa en ellas. Esto no es necesario cuando trabajas con cadenas de caracteres en Python. Podemos crear una cadena de caracteres simplemente encerrando contenido entre comillas después de un signo de igual (=).</p>\n<pre><code class=\"language-python\">mensaje = “Hola Mundo”\n</code></pre>\n<h2 id=\"operadores-de-cadenas-de-caracteres-adición-y-multiplicación\">Operadores de cadenas de caracteres: adición y multiplicación</h2>\n<p>Una cadena de caracteres en un objeto que consiste precisamente en una serie de signos o caracteres. Python sabe cómo tratar un número de representaciones poderosas y de propósito general, incluidas las cadenas de caracteres. Una forma de manipular cadenas de caracteres es utilizar <em>operadores de cadenas de caracteres</em>. Dichos operadores se representan con símbolos que asociamos a las matemáticas, como +, -, *, / y =. Estos signos realizan acciones similares a sus contrapartes matemáticas cuando se usan con las cadenas de carateres, aunque no iguales.</p>\n<h3 id=\"concatenar\">Concatenar</h3>\n<p>Este término significa juntar cadenas de caracteres. El proceso de <em>concatenación</em> se realiza mediante el operador de suma (+). Ten en cuenta que debes marcar explícitamente dónde quieres los espacios en blanco y colocarlos entre comillas.</p>\n<p>En este ejemplo, la cadena de caracteres &quot;mensaje1&quot; tiene el contenido &quot;Hola Mundo&quot;</p>\n<pre><code class=\"language-python\">mensaje1 = &#39;Hola&#39; + &#39; &#39; + &#39;Mundo&#39;\nprint(mensaje1)\n-&gt; Hola Mundo\n</code></pre>\n<h3 id=\"multiplicar\">Multiplicar</h3>\n<p>Si quieres varias copias de una cadena de caracteres utiliza el operador de multiplicación (*). En este ejemplo, la cadena de caracteres <em>mensaje2a</em> lleva el contenido &quot;Hola&quot; tres veces, mientras que la cadena de caracteres <em>mensaje2b</em> tiene el contenido &quot;Mundo&quot;. Ordenemos imprimir las dos cadenas.</p>\n<pre><code class=\"language-python\">mensaje2a = &#39;Hola &#39; * 3\nmensaje2b = &#39;Mundo&#39;\nprint(mensaje2a + mensaje2b)\n-&gt; Hola Hola Hola Mundo\n</code></pre>\n<h3 id=\"añadir\">Añadir</h3>\n<p>¿Qué pasa si quieres añadir material de manera sucesiva al final de una cadena de caracteres? El operador especial para ello es compuesto (+=).</p>\n<pre><code class=\"language-python\">mensaje3 = &#39;Hola&#39;\nmensaje3 += &#39; &#39;\nmensaje3 += &#39;Mundo&#39;\nprint(mensaje3)\n-&gt; Hola Mundo\n</code></pre>\n<h2 id=\"métodos-para-cadenas-de-caracteres-buscar-cambiar\">Métodos para cadenas de caracteres: buscar, cambiar</h2>\n<p>En adición a los operadores, Python trae preinstalado docenas de métodos que te permiten hacer cosas con las cadenas de caracteres. Solos o en combinación, los métodos pueden hacer casi todo lo que te imagines con las cadenas de caracteres. Puedes usar como referencia la lista de métodos de cadenas de caracteres (<em>String Methods</em>) en el <a href=\"https://docs.python.org/2/library/stdtypes.html#string-methods\">sitio web de Python</a>, que incluye información de cómo utilizar correctamente cada uno. Para asegurar que tengas una comprensión básica de métodos para cadenas de caracteres, lo que sigue es una breve descripción de los utilizados más comúnmente.</p>\n<h3 id=\"extensión\">Extensión</h3>\n<p>Puedes determinar el número de caracteres en una cadena utilizando el método <code>len</code>. Acuérdate que los espacios en blanco cuentan como un carácter.</p>\n<pre><code class=\"language-python\">mensaje4 = &#39;hola&#39; + &#39; &#39; + &#39;mundo&#39;\nprint(len(mensaje4))\n-&gt; 10\n</code></pre>\n<h3 id=\"encontrar\">Encontrar</h3>\n<p>Puedes buscar una sub-cadena en una cadena de caracteres utilizando el método <code>find</code> y tu programa te indicará el índice de inicio de la misma. Esto es muy útil para procesos que veremos más adelante. Ten en mente que los índices están numerados de izquierda a derecha y que el número en el que se comienza a contar la posición es el 0, no el 1.</p>\n<pre><code class=\"language-python\">mensaje5 = &quot;Hola Mundo&quot;\nmensaje5a = mensaje5.find(&quot;Mundo&quot;)\nprint(mensaje5a)\n-&gt; 5\n</code></pre>\n<p>Si la sub-cadena no está presente el programa imprimirá el valor -1.</p>\n<pre><code class=\"language-python\">mensaje6 = &quot;Hola Mundo&quot;\nmensaje6a = mensaje6.find(&quot;ardilla&quot;)\nprint(mensaje6a)\n-&gt; -1\n</code></pre>\n<h3 id=\"minúsculas\">Minúsculas</h3>\n<p>A veces es útil convertir una cadena de caracteres a minúsculas. Para ello se utiliza el método <code>lower</code>. Por ejemplo, al uniformar los caracteres permitimos que la computadora reconozca fácilmente que &quot;Algunas Veces&quot; y &quot;algunas veces&quot; son la misma frase.</p>\n<pre><code class=\"language-python\">mensaje7 = &quot;HOLA MUNDO&quot;\nmensaje7a = mensaje7.lower()\nprint(mensaje7a)\n-&gt; hola mundo\n</code></pre>\n<p>Convertir las minúsculas en mayúsculas se logra cambiando <code>.lower()</code> por <code>upper()</code>.</p>\n<h3 id=\"reemplazar\">Reemplazar</h3>\n<p>Si necesitas cambiar una sub-cadena de una cadena se puede utilizar el método <code>replace</code>.</p>\n<pre><code class=\"language-python\">mensaje8 = &quot;HOLA MUNDO&quot;\nmensaje8a = mensaje7.replace(&quot;L&quot;, &quot;pizza&quot;)\nprint(mensaje8a)\n-&gt; HOpizzaA MUNDO\n</code></pre>\n<h3 id=\"cortar\">Cortar</h3>\n<p>Si quieres <code>cortar</code> partes que no quieras del principio o del final de la cadena de caracteres, lo puedes hacer creando una sub-cadena. El mismo tipo de técnica te permite separar una cadena muy larga en componentes más manejables.</p>\n<pre><code class=\"language-python\">mensaje9 = &quot;Hola Mundo&quot;\nmensaje9a = mensaje9[1:8]\nprint(mensaje9a)\n-&gt; ola Mun\n</code></pre>\n<p>Puedes sustituir las variables por números enteros como en este ejemplo:</p>\n<pre><code class=\"language-python\">mensaje9 = &quot;Hola Mundo&quot;\nstartLoc = 2\nendLoc = 8\nmensaje9b = mensaje9[startLoc: endLoc]\nprint(mensaje9b)\n-&gt; la Mun\n</code></pre>\n<p>Esto hace mucho más simple usar este método en conjunción con el método <code>find</code> como en el próximo ejemplo, que busca la letra &quot;d&quot; en los seis primeros caracteres de &quot;Hola Mundo&quot; y correctamente nos dice que no se encuentra ahí (-1). Esta técnica es mucho más eficaz en cadenas largas -documentos enteros, por ejemplo. Observa que la ausencia de un número entero antes de los dos puntos significa que queremos empezar desde el principio de la cadena. Podemos usar la misma técnica para decirle al programa que pase hasta el final de la cadena de caracteres dejando vacío después de los dos puntos. Y recuerda que la posición del índice empieza a contar desde 0, no desde 1.</p>\n<pre><code class=\"language-python\">mensaje9 = &quot;Hola Mundo&quot;\nprint(mensaje9[:5].find(&quot;d&quot;))\n-&gt; -1\n</code></pre>\n<p>Hay muchos más, pero los métodos para cadenas de caracteres anteriores son un buen comienzo. Fíjate que en el ejemplo anterior utilizamos corchetes en vez de paréntesis. Esta diferencia en los símbolos de la <em>sintaxis</em> es muy importante. Los paréntesis en Python son utilizados generalmente para <em>llevar un argumento</em> a una función. De tal manera que cuando vemos algo como:</p>\n<pre><code class=\"language-python\">print(len(mensaje7))\n</code></pre>\n<p>quiere decir que se lleva la cadena de caracteres &quot;mensaje7&quot; a la función <code>len</code> y entonces enviar el valor resultante de esa función a la declaración <code>print</code> para ser impresa. Una función puede ser llamada sin un argumento, pero de todas formas tienes que incluir un par de paréntesis vacíos después del nombre de la función. Vimos un ejemplo de ello también.</p>\n<pre><code class=\"language-python\">mensaje7 = &quot;Hola Mundo&quot;\nmensaje7a = mensaje7.lower()\nprint(mensaje7a)\n-&gt; Hola Mundo\n</code></pre>\n<p>Esta declaración le dice a Python que aplique la función <code>lower</code> a la cadena <em>mensaje7</em> y guarde el valor resultante en la cadena <em>mensaje7a</em>.</p>\n<p>Los corchetes sirven para propósitos diferentes. La cadena es una secuencia de caracteres; así que si quieres acceder al contenido de la cadena a partir de su posición en la secuencia, tienes que indicarle a Python un lugar en la secuencia. Eso es lo que hacen los corchetes: señalan el lugar del principio y del final de la secuencia, tal y como vimos en el método <code>cortar</code>.</p>\n<h3 id=\"secuencias-de-escape\">Secuencias de escape</h3>\n<p>¿Qué haces cuando necesitas incluir comillas en una cadena de caracteres? No quieres que el intérprete de Python se equivoque y piense que la cadena termina en donde se encuentre una comilla. En Python puedes poner una barra invertida (\\) enfrente de la comilla para que no acabe ahí la cadena. Esto es conocido como secuencia de escape.</p>\n<pre><code class=\"language-python\">print(&#39;\\&quot;&#39;)\n-&gt; &quot;\n</code></pre>\n<pre><code class=\"language-python\">print(&#39;El programa imprime \\&quot;Hola Mundo\\&quot;&#39;)\n-&gt; El programa imprime &quot;Hola Mundo&quot;\n</code></pre>\n<p>Otras dos secuencias de escape te permiten incluir marcas de tabulación (t) y saltos de línea (n):</p>\n<pre><code class=\"language-python\">print(&#39;Hola\\tHola\\tHola\\nMundo&#39;)\n-&gt; Hola Hola Hola\nMundo\n</code></pre>\n<h2 id=\"lecturas-sugeridas\">Lecturas sugeridas</h2>\n<ul>\n<li>Lutz, <em>Learning Python</em><ul>\n<li>Ch. 7: Strings</li>\n<li>Ch. 8: Lists and Dictionaries</li>\n<li>Ch. 10: Introducing Python Statements</li>\n<li>Ch. 15: Function Basics</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"sicronización-de-código\">Sicronización de código</h3>\n<p>Para seguir a lo largo de las lecciones futuras es importante que tengas los archivos correctos y programas en el directorio &quot;programming-historian&quot; de tu disco duro. Al final de cada lección puedes descargar el archivo zip &quot;python-es-lecciones&quot; para asegurarte que tienes el código correcto.</p>\n<ul>\n<li>python-es-lecciones1.zip (<a href=\"/assets/python-es-lecciones1.zip\">zip</a>)</li>\n</ul>\n"}