{"metadata":{"title":"De HTML a lista de palabras (parte 1)","authors":["William J. Turkel","Adam Crymble"],"date":"2012-07-17T00:00:00.000Z","translation_date":"2017-03-15T00:00:00.000Z","editors":["Miriam Posner"],"reviewers":["Jim Clifford","Frederik Elwert"],"translator":["Víctor Gayol"],"translation-editor":["Adam Crymble"],"translation-reviewer":["Jairo A. Melo","Maria José Afanador-Llach","Antonio Rojas Castro"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/44","layout":"lesson","next":"de-html-a-lista-de-palabras-2","previous":"manipular-cadenas-de-caracteres-en-python","original":"from-html-to-list-of-words-1","python_warning":false,"difficulty":2,"activity":"transforming","topics":["python"],"abstract":"En esta lección en dos partes partiremos de lo que has aprendido sobre Descargar páginas web con Python, para aprender cómo remover las etiquetas HTML de la página web de la transcripción del juicio criminal contra Benjamin Bowsey de 1780. Lograremos esto utilizando una variedad de operadores de cadenas, métodos de cadenas y habilidades de lectura cercana. Vamos a presentar bucles (looping) y condicionales (branching), de manera que los programas puedan repetir tareas y pruebas para ciertas condiciones, haciendo posible separar el contenido de las etiquetas HTML. Por último, convertimos el contenido de una cadena larga a una lista de palabras que posteriormente podrán ser ordenadas, indexadas y contadas.","avatar_alt":"Grabado de una jirafa de perfil mirando a un hombre también de perfil parado sujetando muletas para simular la postura de la jirafa.","doi":"10.46430/phes0005","sequence":7,"series_total":14},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"objetivos-de-la-lección\">Objetivos de la lección</h2>\n<p>En esta lección en dos partes partiremos de lo que has aprendido en <a href=\"/es/lecciones/trabajar-con-paginas-web\">Descargar páginas web con Python</a>, para aprender cómo remover las <em>etiquetas HTML</em> de la página web de la <a href=\"http://www.oldbaileyonline.org/browse.jsp?id=t17800628-33&amp;div=t17800628-33\">transcripción del juicio criminal contra Benjamin Bowsey de 1780</a>. Lograremos esto utilizando una variedad de <em>operadores de cadenas</em>, <em>métodos de cadenas</em> y habilidades de lectura cercana. Vamos a presentar <em>bucles</em> (<em>looping</em>) y <em>condicionales</em> (<em>branching</em>), de manera que los programas puedan repetir tareas y pruebas para ciertas condiciones, haciendo posible separar el contenido de las etiquetas HTML. Por último, convertimos el contenido de una cadena larga a una <em>lista de palabras</em> que posteriormente podrán ser ordenadas, indexadas y contadas.</p>\n<h2 id=\"el-reto\">El reto</h2>\n<p>Para tener una idea más clara de la tarea que tenemos por delante, abre el archivo <em>obo-t17800628-33.html</em> que creaste en la lección <a href=\"/es/lecciones/trabajar-con-paginas-web\">Descargar páginas web con Python</a> (o <a href=\"/assets/obo-t17800628-33.html\">descarga y guarda el juicio</a>, si aún no tienes una copia). Entonces observa el código HTML en tu navegador de Fierfox usando <code>Herramientas -&gt; Desarrollador web -&gt; Código fuente de esta página</code>. A medida que te desplazas a través del código fuente te darás cuenta que hay etiquetas HTML mezcladas con el texto. Si eres nuevo en HTML te recomendamos tomar el tutorial de W3Schools <a href=\"http://www.w3schools.com/html/\">HTML</a> para familiarizarte con el marcado. Si tu trabajo requiere a menudo que tengas que retirar etiquetas sin duda te va a servir para entenderlo en cuanto lo veas.</p>\n<h2 id=\"archivos-necesarios-para-esta-lección\">Archivos necesarios para esta lección</h2>\n<ul>\n<li><em><a href=\"/assets/obo-t17800628-33.html\">obo-t17800628-33.html</a></em></li>\n</ul>\n<h2 id=\"idear-un-algoritmo\">Idear un algoritmo</h2>\n<p>Dado que el objetivo es deshacerse del HTML, el primer paso es crear un algoritmo que devuelva solamente el texto (menos las etiquetas HTML) del artículo. Un algoritmo es un procedimiento que se ha especificado con suficiente detalle de tal forma que puede ser implementado en una computadora. Es muy útil escribir primero tus algoritmos en español llano; es una idea excelente delinear exactamente qué es lo que quieres que haga antes de sumergirte en el código. Para construir este algoritmo te vas a servir de tus habilidades de lectura cercana para encontrar la manera de capturar solamente el contenido textual de la biografía.</p>\n<p>Al examinar el código fuente de <em>obo-t17800628-33.html</em> notarás que la transcripción real no se inicia de forma inmediata. Por el contrario, hay un número de etiquetas HTML y algo de información para citar. En este caso el contenido no comienza ¡sino hasta la línea 81!</p>\n<pre><code class=\"language-xml\">&lt;p&gt;324.                                  &lt;a class=&quot;invisible&quot; name=&quot;t17800628-33-defend448&quot;&gt; &lt;/a&gt;                     BENJAMIN                      BOWSEY                                                                                                          (a blackmoor                  ) was indicted for                                                          that he together with five hundred other persons and more, did, unlawfully, riotously, and tumultuously assemble on the 6th of June\n</code></pre>\n<p>Solamente nos interesa la transcripción del juicio, no los metadatos extra contenidos en las etiquetas. No obstante, te darás cuenta que el final de los metadatos coincide con el principio de la transcripción. Esto hace que la ubicación de los metadatos sea un marcador potencialmente útil para aislar texto transcrito.</p>\n<p>A primera vista, podemos ver que la transcripción del juicio inicia con una etiqueta HTML: <code>&lt;p&gt;</code> que significa &quot;párrafo&quot;. Ésta es la primera etiqueta de párrafo en el documento. Debemos ser capaces de usar esto para encontrar el punto de inicio de nuestro documento transcrito. Tenemos suerte en este caso porque resulta que esta etiqueta es una manera confiable para determinar el principio de la transcripción del texto del juicio (si quieres, échale un vistazo a otros juicios para comprobarlo).</p>\n<p>El texto del juicio termina en la línea 82 con otra etiqueta HTML: <code>&lt;br/&gt;</code>, que significa un salto de línea. Resulta que es el último salto de línea del documento. Estas dos etiquetas (la del primer párrafo y la del último salto de línea) nos proveen el recurso para aislar el texto transcrito. Los sitios web bien estructurados siempre tienen una única manera de señalar el final del contenido. Solmamente necesitas observar con atención.</p>\n<p>Lo siguiente que querrás hacer es retirar todas las marcas de HTML que permanecen mezcladas con el contenido. Como sabes, las etiquetas HTML se encuentras siempre entre un par de corchetes angulares que se corresponden, por lo que probablemente una apuesta segura es que al quitar todo lo que esté dentro de dos corchetes angulares quitarás el código HTML y dejarás solamente la transcripción. Ten en cuenta que estamos asumiendo que la transcricpión no contiene símbolos matemáticos como &quot;menor que&quot; y &quot;mayor que&quot;. Si Bowsey hubiese sido un matemático, nuestro supuesto no sería tan seguro.</p>\n<p>Lo que sigue describe nuestro algoritmo en palabras.</p>\n<p>Para aislar el contenido:</p>\n<ul>\n<li>Descarga el texto transcrito</li>\n<li>Busca el HTML y guarda la localización de la primera etiqueta <code>&lt;p&gt;</code></li>\n<li>Busca el HTML y guarda la localización de la útlima etiqueta <code>&lt;p&gt;</code></li>\n<li>Guarda todo lo que aparezca después de la primera etiqueta <code>&lt;p&gt;</code> y antes de la etiqueta <code>&lt;br/&gt;</code> en una cadena de texto: <em>contenidoPagina</em></li>\n</ul>\n<p>En este punto tenemos la trascripción del texto del juicio más el marcado de HTML. Después:</p>\n<ul>\n<li>Mira con atención cada carácter en la cadena de texto <em>contenido-de-pagina</em>, carácter por carácter</li>\n<li>Si el carácter es un corchete angular izquierdo (&lt;) nos encontramos dentro de una etiqueta así que ignora cada uno de los caracteres siguientes</li>\n<li>Si el carácter es un corchete angular derecho (&gt;) estamos saliendo de una etiqueta; ignora el carácter actual, pero mira cada uno de los caracteres siguientes</li>\n<li>Si no estamos dentro de una etiqueta, adjunta el carácter actual a una nueva variable: <em>texto</em></li>\n</ul>\n<p>Finalmente:</p>\n<ul>\n<li>Divide la cadena de texto en una lista de palabras individuales que después puedan manipularse más</li>\n</ul>\n<h2 id=\"aislar-el-contenido-deseado\">Aislar el contenido deseado</h2>\n<p>El siguiente paso utiliza los comandos de Python aprendidos en la lección <a href=\"/es/lecciones/manipular-cadenas-de-caracteres-en-python\">Manipular cadenas de caracteres en Python</a> para implementar la primera mitad del algoritmo: retirar todo el contenido antes de la etiqueta <code>&lt;p&gt;</code> y después de la etiqueta <code>&lt;br/&gt;</code>. En resumen, el algoritmo fue el siguiente:</p>\n<ul>\n<li>Descarga el texto transcrito</li>\n<li>Busca el HTML y guarda la localización de la primera etiqueta <code>&lt;p&gt;</code></li>\n<li>Busca el HTML y guarda la localización de la útlima etiqueta <code>&lt;p&gt;</code></li>\n<li>Guarda todo lo que aparezca después de la primera etiqueta <code>&lt;p&gt;</code> y antes de la etiqueta <code>&lt;br/&gt;</code> a una cadena de texto: <em>contenidoPagina</em></li>\n</ul>\n<p>Para lograr esto, utilizarás el método de cadena de caracteres &quot;find&quot; y el método .rfind() (que permite encontrar la última coincidencia de algo) y crearás una nueva subcadena conteniendo solamente el contenido deseado entre esas posiciones indexadas.</p>\n<p>A medida que trabajas, vas a construir archivos separados para contener tu código. Uno de estos archivos se llamará <em>obo.py</em> (a partir de &quot;Old Bailey Online&quot;). Este archivo va a contener todo el código que tú quieres reutilizar; en otras palabras, <em>obo.py</em> es un módulo. Discutimos la idea de módulos en la lección <a href=\"/es/lecciones/reutilizacion-de-codigo-y-modularidad\">Reutilizacion de código y modularidad</a> cuando guardamos nuestras funciones en <em>saludo.py</em>.</p>\n<p>Crea un nuevo archivo llamado <em>obo.py</em> y guárdalo en tu carpeta <em>programming-historian</em>. Vamos a utilizar este archivo para mantener copias de las funciones necesarias para procesar The Old Bailey Online. Teclea o copia el siguiente código en tu archivo.</p>\n<pre><code class=\"language-python\"># obo.py\n\ndef quitarEtiquetas(contenidoPagina):\n    contenidoPagina = str(contenidoPagina)\n    lugarInicio = contenidoPagina.find(&quot;&lt;p&gt;&quot;)\n    lugarFin = contenidoPagina.rfind(&quot;&lt;br/&gt;&quot;)\n\n    contenidoPagina = contenidoPagina[lugarInicio:lugarFin]\n    return contenidoPagina\n</code></pre>\n<p>Ahora crea un segundo archivo llamado <em>contenido-juicio.py</em> y guarda el programa que se muestra a continuación:</p>\n<pre><code class=\"language-python\"># contenido-juicio.py\n\nimport urllib.request, urllib.error, urllib.parse, obo\n\nurl = &#39;http://www.oldbaileyonline.org/browse.jsp?id=t17800628-33&amp;div=t17800628-33&#39;\n\nrespuesta = urllib.request.urlopen(url)\nHTML = respuesta.read().decode(&#39;UTF-8&#39;)\n\nprint((obo.quitarEtiquetas(HTML)))\n</code></pre>\n<p>Cuando ejecutes <em>contenido-juicio.py</em> éste obtendrá la página Web de la transcripción del juicio de Bowsey, entonces mira en el módulo <em>obo.py</em> la función <em>quitarEtiquetas</em>. El programa utilizará esa función para extraer todo lo que esté después de la primera etiqueta <code>&lt;p&gt;</code> y antes de la última <code>&lt;br/&gt;</code>. Con algo de suerte esto debe ser el contenido textual de la transcripción de Bowsey acompañada con algo de marcado en HTML. No te preocupes si tu pantalla de salida de comandos termina en una línea gruesa negra. La pantalla de salida de Komodo Edit tiene un número máximo de caracteres a desplegar, después de lo cual los caracteres empiezan a escribirse unos sobre otros en la pantalla, literalmente, dando la apriencia de una mancha negra. No te preocupes: el texto está ahí aún cuando tú no puedas leerlo; así que puedes copiar y pegarlo en un archivo de texto para confirmarlo.</p>\n<p>Tomemos un momento para estar seguros de que entendemos de qué manera <em>contenido-juico.py</em> es capaz de utilizar las funciones almacenadas en <em>obo.py</em>. La función <em>quitarEtiquetas</em> que guardamos en <em>obo.py</em> requiere un argumento. En otras palabras, para ejecutarse con propiedad requiere que se le suministre una unidad de información. Recordemos el ejemplo del perro entrenado de lecciones previas. Para que ladre, el perro necesita dos cosas: aire y una deliciosa recompensa. La función <em>quitarEtiquetas</em> en <em>obo.py</em> requiere una cosa: una cadena de texto llamada <em>contenidoPagina</em>. Pero te darás cuenta que cuando llamamos a <em>quitarEtiquetas</em> en el último programa (<em>contenido-juicio.py</em>), no hay ninguna mención a &quot;<em>contenidoPagina</em>&quot;. En cambio, se le ha dado a la función HTML como argumento. Esto puede ser confuso para las personas que están empezando a programar. Una vez que una función ha sido declarada, no necesitamos utilizar el mismo nombre de la variable cuando llamamos a la función. Mientras que proporcionemos el tipo de argumento adecuado, todo debe funcionar correctamente sin importar cómo lo llamamos. En este caso, queremos que <em>contenidoPagina</em> utilice el contenido de nuestra variable HTML. Podría pasar por cualquier cadena de texto, incluida alguna que se ingrese directamente en el paréntesis. Intenta volver a ejecutar <em>contenido-juicio.py</em> cambiando el argumento <em>quitarEtiquetas</em> a &quot;Soy aficionado a los perros&quot;, y mira lo que sucede. Toma en cuenta que dependiendo de cómo definas tu función (y lo que hace), tu argumento necesitará posiblemente ser algo distinto que una cadena: un <em>entero</em> por ejemplo.</p>\n<h2 id=\"lecturas-sugeridas\">Lecturas sugeridas</h2>\n<ul>\n<li>Lutz, <em>Learning Python</em><ul>\n<li>Ch. 7: Strings</li>\n<li>Ch. 8: Lists and Dictionaries</li>\n<li>Ch. 10: Introducing Python Statements</li>\n<li>Ch. 15: Function Basics</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"sincronización-de-código\">Sincronización de código</h2>\n<p>Para seguir a lo largo de las lecciones futuras es importante que tengas los archivos correctos y programas en el directorio &quot;programming-historian&quot; de tu disco duro. Al final de cada lección puedes descargar el archivo zip &quot;python-es-lecciones&quot; para asegurarte que tienes el código correcto.</p>\n<ul>\n<li>python-es-lecciones2.zip (<a href=\"/assets/python-es-lecciones2.zip\">zip</a>)</li>\n</ul>\n"}