{"metadata":{"title":"Getting Started with Topic Modeling and MALLET","layout":"lesson","date":"2012-09-02T00:00:00.000Z","authors":["Shawn Graham","Scott Weingart","Ian Milligan"],"reviewers":["John Fink","Alan MacEachern"],"editors":["Adam Crymble"],"difficulty":2,"exclude_from_check":["review-ticket"],"activity":"analyzing","topics":["distant-reading"],"abstract":"In this lesson you will first learn what topic modeling is and why you might want to employ it in your research. You will then learn how to install and work with the MALLET natural language processing toolkit to do so.","redirect_from":"/lessons/topic-modeling-and-mallet","avatar_alt":"A man striking an anvil with a large hammer","doi":"10.46430/phen0017"},"html_body":"<p>{% include toc.html %}</p>\n<h2 id=\"editors-note\">Editor&#39;s Note</h2>\n<p>This lesson requires you to use the command line. If you have no\nprevious experience using the command line you may find it helpful to\nwork through the Programming Historian <a href=\"/lessons/intro-to-bash\">Bash Command Line</a> lesson.</p>\n<h2 id=\"lesson-goals\">Lesson Goals</h2>\n<p>In this lesson you will first learn what <em>topic modeling</em> is and why you\nmight want to employ it in your research. You will then learn how to\ninstall and work with the MALLET <em>natural language processing</em> toolkit\nto do so. MALLET involves modifying an <em>environment variable</em>\n(essentially, setting up a short-cut so that your computer always knows\nwhere to find the MALLET program) and working with the <em>command line</em>\n(ie, by typing in commands manually, rather than clicking on icons or\nmenus). We will run the topic modeller on some example files, and look\nat the kinds of outputs that MALLET installed. This will give us a\ngood idea of how it can be used on a corpus of texts to identify topics\nfound in the documents without reading them individually.</p>\n<p>Please see the MALLET users&#39; <a href=\"http://mallet.cs.umass.edu/mailinglist.php\">discussion list</a> for the full range of\nthings one can do with the software.</p>\n<p>(We would like to thank Robert Nelson and Elijah Meeks for hints and\ntips in getting MALLET to run for us the first time, and for their\nexamples of what can be done with this tool.)</p>\n<h2 id=\"what-is-topic-modeling-and-for-whom-is-this-useful\">What is Topic Modeling And For Whom is this Useful?</h2>\n<p>A <em>topic modeling</em> tool takes a single text (or corpus) and looks for\npatterns in the use of words; it is an attempt to inject semantic\nmeaning into vocabulary. Before you begin with topic modeling, you\nshould ask yourself whether or not it is likely to be useful for your\nproject. Matthew Kirschenbaum&#39;s <em><a href=\"http://www.cs.umbc.edu/~hillol/NGDM07/abstracts/talks/MKirschenbaum.pdf\">Distant Reading</a></em> (a talk given at the\n2009 National Science Foundation Symposium on the Next Generation of\nData Mining and Cyber-Enabled Discovery for Innovation) and Stephen\nRamsay&#39;s <em><a href=\"http://www.worldcat.org/title/reading-machines-toward-an-algorithmic-criticism/oclc/708761605&amp;referer=brief_results\">Reading Machines</a></em> are good places for beginning to\nunderstand in which circumstances a technique such as this could be most\neffective. As with all tools, just because you can use it, doesn&#39;t\nnecessarily mean that you should. If you are working with a small number\nof documents (or even a single document) it may well be that simple\nfrequency counts are sufficient, in which case something like <a href=\"http://voyant-tools.org\">Voyant\nTools</a> might be appropriate. However, if you have hundreds of\ndocuments from an archive and you wish to understand something of what\nthe archive contains without necessarily reading every document, then\ntopic modeling might be a good approach.</p>\n<p>Topic models represent a family of computer programs that extract\n<em>topics</em> from <em>texts</em>. A topic to the computer is a list of words that\noccur in statistically meaningful ways. A text can be an email, a blog\npost, a book chapter, a journal article, a diary entry – that is, any\nkind of unstructured text. By unstructured we mean that there are no\ncomputer-readable annotations that tell the computer the semantic\nmeaning of the words in the text.</p>\n<p>Topic modeling programs do not know anything about the meaning of the\nwords in a text. Instead, they assume that any piece of text is composed\n(by an author) by selecting words from possible baskets of words where\neach basket corresponds to a topic. If that is true, then it becomes\npossible to mathematically decompose a text into the probable baskets\nfrom whence the words first came. The tool goes through this process\nover and over again until it settles on the most likely distribution of\nwords into baskets, which we call topics.</p>\n<p>There are many different topic modeling programs available; this\ntutorial uses one called MALLET. If one used it on a series of\npolitical speeches for example, the program would return a list of\ntopics and the keywords composing those topics. Each of these lists is a\ntopic according to the algorithm. Using the example of political\nspeeches, the list might look like:</p>\n<ol>\n<li>Job Jobs Loss Unemployment Growth</li>\n<li>Economy Sector Economics Stock Banks</li>\n<li>Afghanistan War Troops Middle-East Taliban Terror</li>\n<li>Election Opponent Upcoming President</li>\n<li><em>et cetera</em></li>\n</ol>\n<p>By examining the keywords we can discern that the politician who gave\nthe speeches was concerned with the economy, jobs, the Middle East, the\nupcoming election, and so on.</p>\n<p>As Scott Weingart warns, there are many <a href=\"http://www.scottbot.net/HIAL/?p=16713\">dangers</a> that face those who\nuse topic modeling without fully understanding it. For instance, we\nmight be interested in word use as a proxy for placement along a\npolitical spectrum. Topic modeling could certainly help with that, but\nwe have to remember that the proxy is not in itself the thing we seek to\nunderstand – as Andrew Gelman demonstrates in his mock study of <a href=\"http://arxiv.org/abs/1003.6087/\">zombies\nusing Google Trends</a>. Ted Underwood and Lisa Rhody (see Further\nReading) argue that we as historians would be better to think of these\ncategories as discourses; however for our purposes here we will continue\nto use the word: topic.</p>\n<p>Note: You will sometimes come across the term &quot;<em>LDA</em>&quot; when looking into\nthe bibliography of topic modeling. LDA and Topic Model are often used\nsynonymously, but the LDA technique is actually a special case of topic\nmodeling created by <a href=\"http://en.wikipedia.org/wiki/Latent_Dirichlet_allocation\">David Blei and friends</a> in 2002. It was not the\nfirst technique now considered topic modeling, but it is by far the most\npopular. The myriad variations of topic modeling have resulted in an\nalphabet soup of techniques and programs to implement them that might be\nconfusing or overwhelming to the uninitiated; ignore them for now. They\nall work in much the same way. MALLET uses LDA.</p>\n<h3 id=\"examples-of-topic-models-employed-by-historians\">Examples of topic models employed by historians:</h3>\n<ul>\n<li>Rob Nelson, <em><a href=\"http://dsl.richmond.edu/dispatch/\">Mining the Dispatch</a></em></li>\n<li>Cameron Blevins, &quot;<a href=\"http://historying.org/2010/04/01/topic-modeling-martha-ballards-diary/\">Topic Modeling Martha Ballard&#39;s Diary</a>&quot;\n<em>Historying</em>, April 1, 2010.</li>\n<li>David J Newman and Sharon Block, &quot;Probabilistic topic decomposition\nof an eighteenth century American newspaper,&quot; <em>Journal of the\nAmerican Society for Information Science and Technology</em> vol. 57,\nno. 6 (April 1, 2006): 753-767.</li>\n</ul>\n<h2 id=\"installing-mallet\">Installing MALLET</h2>\n<p>There are many tools one could use to create topic models, but at the\ntime of this writing (summer 2017) the simplest tool to run your text\nthrough is called MALLET. <a href=\"http://mallet.cs.umass.edu/index.php\">MALLET</a> uses an implementation of\n<a href=\"http://en.wikipedia.org/wiki/Gibbs_sampling\"><em>Gibbs sampling</em></a>, a statistical technique meant to quickly construct\na sample distribution, to create its topic models. MALLET requires\nusing the command line – we&#39;ll talk about that more in a moment,\nalthough you typically use the same few commands over and over.</p>\n<p>The installation instructions are different for Windows and Mac. Follow\nthe instructions appropriate for you below:</p>\n<p>{% include figure.html filename=&quot;windows-150x150.png&quot; caption=&quot;&quot; %}</p>\n<h3 id=\"windows-instructions\">Windows Instructions</h3>\n<ol>\n<li>Go to the <a href=\"http://mallet.cs.umass.edu/index.php\">MALLET</a> project page. You can <a href=\"http://mallet.cs.umass.edu/download.php\">download MALLET here</a>.</li>\n<li>You will also need the <a href=\"http://www.oracle.com/technetwork/java/javase/downloads/index.html\">Java developer&#39;s kit</a> – that is, not the\nregular Java that&#39;s on every computer, but the one that lets you\nprogram things. Install this on your computer.</li>\n<li>Unzip MALLET into your <code>C:</code> directory . This is important: it\ncannot be anywhere else. You will then have a directory called\n<code>C:\\mallet-2.0.8</code> or similar. For simplicity&#39;s sake, rename this\ndirectory just <code>mallet</code>.</li>\n<li>MALLET uses an <em>environment variable</em> to tell the computer where to\nfind all the various components of its processes when it is running.\nIt&#39;s rather like a shortcut for the program. A programmer cannot\nknow exactly where every user will install a program, so the\nprogrammer creates a variable in the code that will always stand in\nfor that location. We tell the computer, once, where that location\nis by setting the environment variable. If you moved the program to\na new location, you&#39;d have to change the variable.</li>\n</ol>\n<p>To create an environment variable in Windows 10, click Start (Windows icon) or press the Windows key on your keyboard then type &#39;Control Panel&#39;. Within Control Panel, select System and Security.  In System and Security, type &#39;Advanced&#39; into the search field (upper right) and choose &#39;View advanced system settings&#39; from the results. In the pop-up dialogue box, click &#39;Environmental Variables&#39;. Next, click &#39;New&#39; and type <code>MALLET_HOME</code> in the variable name\nbox (Figures 1,2,3). It must be like this – all caps, with an underscore – since that is\nthe shortcut that the programmer built into the program and all of its\nsubroutines. Then type the exact path (location) of where you unzipped\nMALLET in the variable value, e.g., <code>c:\\mallet</code>. </p>\n<p>To see if you have been successful, please read on to the next section.</p>\n<p>{% include figure.html filename=&quot;fig1-advanced-system-settings.png&quot; caption=&quot;Figure 1: Advanced System Settings on Windows&quot; %}</p>\n<p>{% include figure.html filename=&quot;fig2-environment-variables-location.png&quot; caption=&quot;Figure 2: Environment Variables Location&quot; %}</p>\n<p>{% include figure.html filename=&quot;fig3-environment-variable.png&quot; caption=&quot;Figure 3: Environment Variable&quot; %}</p>\n<h4 id=\"running-mallet-using-the-command-line\">Running MALLET using the Command Line</h4>\n<p>MALLET is run from the command line, also known as <em>Command Prompt</em>\n(Figure 4). If you remember MS-DOS, or have ever played with a Unix\ncomputer Terminal, this will be familiar. The command line is where you\ncan type commands directly, rather than clicking on icons and menus.</p>\n<p>{% include figure.html filename=&quot;fig-4-command-prompt-window.png&quot; caption=&quot;Figure 4: Command Prompt on Windows&quot; %}</p>\n<ol>\n<li>Click on your\n<code>Start Menu -&gt; All Programs -&gt; Accessories -&gt; Command Prompt</code>.<br> You&#39;ll get the command prompt window, which will have a cursor at\n<code>c:\\user\\user&gt;</code> (or similar; see Figure 4).</li>\n<li>Type <code>cd ..</code> (That is: cd-space-period-period) to <em>change\ndirectory</em>. Keep doing this until you&#39;re at the <code>C:\\</code> . (as in\nFigure 5)</li>\n</ol>\n<p>{% include figure.html filename=&quot;fig-5-command-prompt-window-getting-to-c.png&quot; caption=&quot;Figure 5: Navigating to the C:\\ Directory in Command Prompt&quot; %}</p>\n<ol>\n<li>Then type <code>cd mallet </code>and you are in the MALLET directory. Anything\nyou type in the command prompt window is a <em>command</em>. There are\ncommands like <code>cd</code> (change directory) and <code>dir</code> (list directory\ncontents) that the computer understands. You have to tell the\ncomputer explicitly that &#39;this is a MALLET command&#39; when you want\nto use MALLET. You do this by telling the computer to grab its\ninstructions from the MALLET <em>bin</em>, a subfolder in MALLET that\ncontains the core operating routines.</li>\n<li>Type <code>bin\\mallet</code> as in Figure 6. If all has gone well, you should\nbe presented with a list of MALLET commands – congratulations! If\nyou get an error message, check your typing. Did you use the wrong\nslash? Did you set up the environment variable correctly? Is\nMALLET located at <code>C:\\mallet</code> ?</li>\n</ol>\n<p>{% include figure.html filename=&quot;fig-6command-prompt-mallet-installed.png&quot; caption=&quot;Figure 6: Command Prompt MALLET Installed&quot; %}</p>\n<p>You are now ready to skip ahead to the next section.</p>\n<p>{% include figure.html filename=&quot;apple-150x150.png&quot; caption=&quot;&quot; %}</p>\n<h3 id=\"mac-instructions\">Mac Instructions</h3>\n<p>Many of the instructions for OS X installation are similar to Windows,\nwith a few differences. In fact, it is a bit easier.</p>\n<ol>\n<li>Download and <a href=\"http://mallet.cs.umass.edu/download.php\">install MALLET</a>.</li>\n<li>Download the <a href=\"http://www.oracle.com/technetwork/java/javase/downloads/index.html\">Java Development Kit</a>.</li>\n</ol>\n<p>Unzip MALLET into a directory on your system (for ease of following\nalong with this tutorial, your <code>/user/</code> directory works but anywhere is\nokay). Once it is unzipped, open up your Terminal window (in the\n<code>Applications</code> directory in your Finder. Navigate to the directory where\nyou unzipped MALLET using the Terminal (it will be <code>mallet-2.0.8</code> . If\nyou unzipped it into your <code>/user/</code> directory as was suggested in this\nlesson, you can navigate to the correct directory by typing\n<code>cd mallet-2.0.8</code>). cd is short for &quot;change directory&quot; when working in\nthe Terminal.</p>\n<p>The same command will suffice to run commands from this directory,\nexcept you need to append <code>./</code> (period-slash) before each command. This\nneeds to be done before all MALLET commands when working on a Mac.</p>\n<p>Going forward, the commands for MALLET on a Mac will be nearly\nidentical to those on Windows, except for the direction of slashes\n(there are a few other minor differences that will be noted when they\narise). If on Windows a command would be <code>\\bin\\mallet</code>, on a Mac you\nwould instead type:</p>\n<pre><code class=\"language-bash\">./bin/mallet\n</code></pre>\n<p>A list of commands should appear. If it does, congratulations – you&#39;ve\ninstalled it correctly!</p>\n<h2 id=\"typing-in-mallet-commands\">Typing in MALLET Commands</h2>\n<p>Now that you have MALLET installed, it is time to learn what commands\nare available to use with the program. There are nine MALLET commands\nyou can use (see Figure 6 above). Sometimes you can combine multiple\ninstructions. At the Command Prompt or Terminal (depending on your\noperating system), try typing:</p>\n<pre><code class=\"language-bash\">import-dir --help\n</code></pre>\n<p>You are presented with the error message that <code>import-dir</code> is not\nrecognized as an internal or external command, operable program, or\nbatch file. This is because we forgot to tell the computer to look in\nthe MALLET <code>bin</code> for it. Try again, with</p>\n<pre><code>bin\\mallet import-dir --help\n</code></pre>\n<p>Remember, the direction of the slash matters (See Figure 7, which\nprovides an entire transcript of what we have done so far in the\ntutorial). We checked to see that we had installed MALLET by typing in\n<code>bin\\mallet</code>. We then made the mistake with <code>import-dir</code> a few lines\nfurther down. After that, we successfully called up the help file, which\ntold us what <code>import-dir</code> does, and it listed all of the potential\n<em>parameters</em> you can set for this tool.</p>\n<p>{% include figure.html filename=&quot;fig-7-command-prompt-typing-help.png&quot; caption=&quot;Figure 7: The Help Menu in MALLET&quot; %}</p>\n<p>Note: there is a difference in MALLET commands between a single hyphen\nand a double hyphen. A single hyphen is simply part of the name; it\nreplaces a space (e.g., <code>import-dir</code> rather than import dir), since\nspaces offset multiple commands or parameters. These parameters let us\ntweak the file that is created when we import our texts into MALLET. A\ndouble hyphen (as with <code>–-help</code> above) modifies, adds a sub-command, or\nspecifies some sort of parameter to the command.</p>\n<p>For Windows users, if you got the error <em>&#39;exception in thread &quot;main&quot;\njava.lang.NoClassDefFoundError:&#39;</em> it might be because you installed\nMALLET somewhere other than in the <code>C:\\</code> directory. For instance,\ninstalling MALLET at <code>C:\\Program Files\\mallet</code> will produce this error\nmessage. The second thing to check is that your environment variable is\nset correctly. In either of these cases, check the Windows installation\ninstructions and double check that you followed them properly.</p>\n<h2 id=\"working-with-data\">Working with data</h2>\n<p>MALLET comes pre-packaged with sample <code>.txt</code> files with which you can\npractice. Type <code>dir</code> at the <code>C:\\mallet&gt; prompt</code>, and you are given the\nlisting of the MALLET directory contents. One of those directories is\ncalled <code>sample-data</code>. You know it is a directory because it has the word\n&lt;dir&gt; beside it.</p>\n<p>Type <code>cd sample-data</code>. Type <code>dir</code> again. Using what you know, navigate\nto first the <code>web</code> then the <code>en</code> directories. You can look inside these\n<code>.txt</code> files by typing the full name of the file (with extension).</p>\n<p>Note that you cannot now run any MALLET commands from this directory.\nTry it:</p>\n<pre><code>bin\\mallet import-dir --help\n</code></pre>\n<p>You get the error message. You will have to navigate back to the main\nMALLET folder to run the commands. This is because of the way MALLET\nand its components are structured.</p>\n<h2 id=\"importing-data\">Importing data</h2>\n<p>In the <code>sample data</code> directory, there are a number of <code>.txt</code> files. Each\none of these files is a single document, the text of a number of\ndifferent web pages. The entire folder can be considered to be a corpus\nof data. To work with this corpus and find out what the topics are that\ncompose these individual documents, we need to transform them from\nseveral individual text files into a single MALLET format file.\nMALLET can import more than one file at a time. We can import the\nentire directory of text files using the <code>import</code> command. The commands\nbelow import the directory, turn it into a MALLET file, keep the\noriginal texts in the order in which they were listed, and strip out the\n<em>stop words</em> (words such as <em>and</em>, <em>the</em>, <em>but</em>, and <em>if</em> that occur in\nsuch frequencies that they obstruct analysis) using the default English\n<code>stop-words</code> dictionary. Try the following, which will use sample data.</p>\n<pre><code>bin\\mallet import-dir --input sample-data\\web\\en --output tutorial.mallet --keep-sequence --remove-stopwords\n</code></pre>\n<p>If you type <code>dir</code> now (or <code>ls</code> for Mac), you will find a file called\n<code>tutorial.mallet</code>. (If you get an error message, you can hit the cursor\nup key on your keyboard to recall the last command you typed, and look\ncarefully for typos). This file now contains all of your data, in a\nformat that MALLET can work with.</p>\n<p>Try running it again now with different data. For example, let&#39;s imagine we wanted to use the German sample data instead. We would use:</p>\n<pre><code>bin\\mallet import-dir --input sample-data\\web\\de --output tutorial.mallet --keep-sequence --remove-stopwords\n</code></pre>\n<p>And then finally, you could use your own data. Change <code>sample-data\\web\\de</code> to a directory that contains your own research files. Good luck!</p>\n<p>If you are unsure how directories work, we suggest the <em>Programming Historian</em> lesson <a href=\"/lessons/intro-to-bash\">&quot;Introduction to the Bash Command Line&quot;</a>.</p>\n<h3 id=\"for-mac\">For Mac</h3>\n<p>Mac instructions are similar to those above for Windows, but note some of the differences below:</p>\n<pre><code class=\"language-bash\">./bin/mallet import-dir --input sample-data/web/en --output tutorial.mallet --keep-sequence --remove-stopwords\n</code></pre>\n<h2 id=\"issues-with-big-data\">Issues with Big Data</h2>\n<p>If you&#39;re working with large file collections – or indeed,\nvery large files – you may run into issues with your <em>heap space</em>, your\ncomputer&#39;s working memory. This issue will initially arise during the\nimport sequence, if it is relevant. By default, MALLET allows for 1GB\nof memory to be used. If you run into the following error message,\nyou&#39;ve run into your limit:</p>\n<pre><code>Exception in thread &quot;main&quot; java.lang.OutOfMemoryError: Java heap space\n</code></pre>\n<p>If your system has more memory, you can try increasing the memory\nallocated to your <em>Java virtual machine</em>. To do so, you need to edit the\ncode in the <code>mallet</code> file found in the <code>bin</code> subdirectory of your\nMALLET folder. Using Komodo Edit, (See <a href=\"/lessons/mac-installation\">Mac</a>,\n<a href=\"/lessons/windows-installation\">Windows</a>, <a href=\"/lessons/linux-installation\">Linux</a> for installation instructions), open the\n<code>Mallet.bat</code> file (<code>C:\\Mallet\\bin\\mallet.bat</code>) if you are using Windows,\nor the <code>mallet</code> file (<code>~/Mallet/bin/mallet</code>) if you are using Linux or OS X.</p>\n<p>Find the following line:</p>\n<p><code>MEMORY=1g</code></p>\n<p>You can then change the 1g value upwards – to 2g, 4g, or even higher\ndepending on your system&#39;s RAM, which you can find out by looking up the\nmachine&#39;s system information.</p>\n<p>Save your changes. You should now be able to avoid the error. If not,\nincrease the value again.</p>\n<h2 id=\"your-first-topic-model\">Your first topic model</h2>\n<p>At the command prompt in the MALLET directory, type:</p>\n<pre><code>bin\\mallet train-topics  --input tutorial.mallet\n</code></pre>\n<p>This command opens your <code>tutorial.mallet</code> file, and runs the topic model\nroutine on it using only the default settings. As it iterates through\nthe routine, trying to find the best division of words into topics, your\ncommand prompt window will fill with output from each run. When it is\ndone, you can scroll up to see what it was outputting (as in Figure 8).</p>\n<p>{% include figure.html filename=&quot;fig-8-basic-topic-model-output.png&quot; caption=&quot;Figure 8: Basic Topic Model Output&quot; %}</p>\n<p>The computer is printing out the key words, the words that help define a\nstatistically significant topic, per the routine. In Figure 8, the first\ntopic it prints out might look like this (your key words might look a\nbit different):</p>\n<pre><code>0    5    test cricket Australian hill acting England northern leading ended innings record runs scored run team batsman played society English\n</code></pre>\n<p>If you are a fan of cricket, you will recognize that all of these words\ncould be used to describe a cricket match. What we are dealing with here\nis a topic related to Australian cricket. If you go to\n<code>C:\\mallet\\sample-data\\web\\en\\hill.txt</code>, you will see that this file is\na brief biography of the noted Australian cricketer Clem Hill. The 0 and\nthe 5 we will talk about later in the lesson. Note that MALLET\nincludes an element of randomness, so the keyword lists will look\ndifferent every time the program is run, even if on the same set of\ndata.</p>\n<p>Go back to the main MALLET directory, and type <code>dir</code>. You will see\nthat there is no output file. While we successfully created a topic\nmodel, we did not save the output! At the command prompt, type</p>\n<pre><code>bin\\mallet train-topics  --input tutorial.mallet --num-topics 20 --output-state topic-state.gz --output-topic-keys tutorial_keys.txt --output-doc-topics tutorial_compostion.txt\n</code></pre>\n<p>Here, we have told MALLET to create a topic model (<code>train-topics</code>) and\neverything with a double hyphen afterwards sets different parameters</p>\n<p>This command</p>\n<ul>\n<li>opens your <code>tutorial.mallet</code> file</li>\n<li>trains MALLET to find 20 topics</li>\n<li>outputs every word in your corpus of materials and the topic it\nbelongs to into a compressed file (<code>.gz</code>; see <a href=\"http://www.gzip.org\">www.gzip.org</a> on how to\nunzip this)</li>\n<li>outputs a text document showing you what the top key words are for\neach topic (<code>tutorial_keys.txt</code>)</li>\n<li>and outputs a text file indicating the breakdown, by percentage, of\neach topic within each original text file you imported\n(<code>tutorial_composition.txt</code>). (To see the full range of possible\nparameters that you may wish to tweak, type\n<code>bin\\mallet train-topics –-help</code> at the prompt.)</li>\n</ul>\n<p>Type <code>dir</code>. Your outputted files will be at the bottom of the list of\nfiles and directories in <code>C:\\Mallet</code>. Open <code>tutorial_keys.txt</code> in a word\nprocessor (Figure 9). You are presented with a series of paragraphs. The\nfirst paragraph is topic 0; the second paragraph is topic 1; the third\nparagraph is topic 2; etc. (The output begins counting at 0 rather than\n1; so if you ask it to determine 20 topics, your list will run from 0 to\n19). The second number in each paragraph is the <em>Dirichlet parameter</em> for\nthe topic. This is related to an option which we did not run, and so its\ndefault value was used (this is why every topic in this file has the\nnumber 2.5).</p>\n<p>{% include figure.html filename=&quot;fig-9-tutorial-key-words-in-Word.png&quot; caption=&quot;Figure 9: Keywords Shown in a Word Processor&quot; %}</p>\n<p>If when you ran the topic model routine you had included</p>\n<pre><code>--optimize-interval 20\n</code></pre>\n<p>as below</p>\n<pre><code>bin\\mallet train-topics  --input tutorial.mallet  --num-topics 20 --optimize-interval 20 --output-state topic-state.gz  --output-topic-keys tutorial_keys.txt --output-doc-topics tutorial_composition.txt\n</code></pre>\n<p>the output might look like this:</p>\n<pre><code>0 0.02995 xi ness regular asia online cinema established alvida acclaim veenr commercial\n</code></pre>\n<p>That is, the first number is the topic (topic 0), and the second number\ngives an indication of the <em>weight</em> of that topic. In general, including\n<code>-–optimize-interval</code> leads to better topics.</p>\n<h3 id=\"the-composition-of-your-documents\">The composition of your documents</h3>\n<p>What topics compose your documents? The answer is in the\n<code>tutorial_composition.txt</code> file. To stay organized, import the\n<code>tutorial_composition.txt</code> file into a spreadsheet (Excel, Open Office,\netc). You will have a spreadsheet with a #doc, source, topic,\nproportion columns. All subsequent columns run topic, proportion, topic,\nproportion, etc., as in figure 10.</p>\n<p>{% include figure.html filename=&quot;fig-10-topic-composition.png&quot; caption=&quot;Figure 10: Topic Composition&quot; %}</p>\n<p>This can be a somewhat difficult file to read. The topics begin in the third\ncolumn, in this case Column C, and continue until the last topic in Column V.\nThis is because we have trained 20 topics – if we trained 25, for example,\nthey would run until column AA.</p>\n<p>From this, you can see that doc# 0 (ie, the first document loaded into MALLET),\n<code>elizabeth_needham.txt</code> has topic 0 at a percentage of 0.43% (column C).\nWe can see that topic 17 is the principal topic, at 59.05%, by locating the highest\nvalue. Your own topics may be different given the nature of MALLET.</p>\n<p>If you have a corpus of text files that are arranged in chronological\norder (e.g., <code>1.txt</code> is earlier than <code>2.txt</code>), then you can graph this\noutput in your spreadsheet program, and begin to see changes over time,\nas Robert Nelson has done in <a href=\"http://dsl.richmond.edu/dispatch/\">Mining the Dispatch</a>.</p>\n<p>How do you know the number of topics to search for? Is there a <em>natural</em>\nnumber of topics? What we have found is that one has to run the\ntrain-topics with varying numbers of topics to see how the composition\nfile breaks down. If we end up with the majority of our original texts\nall in a very limited number of topics, then we take that as a signal\nthat we need to increase the number of topics; the settings were too\ncoarse. There are computational ways of searching for this, including\nusing MALLETs <code>hlda command</code>, but for the reader of this tutorial, it is\nprobably just quicker to cycle through a number of iterations (but for\nmore see Griffiths, T. L., &amp; Steyvers, M. (2004). Finding scientific\ntopics. Proceedings of the National Academy of Science, 101, 5228-5235).</p>\n<h3 id=\"getting-your-own-texts-into-mallet\">Getting your own texts into MALLET</h3>\n<p>The <code>sample data</code> folder in MALLET is your guide to how you should\narrange your texts. You want to put everything you wish to topic model\ninto a single folder within <code>c:\\mallet</code>, ie <code>c:\\mallet\\mydata</code>. Your\ntexts should be in <code>.txt</code> format (that is, you create them with Notepad,\nor in Word choose <code>Save As -&gt; MS Dos text</code>). You have to make some\ndecisions. Do you want to explore topics at a paragraph by paragraph\nlevel? Then each <code>txt</code> file should contain one paragraph. Things like\npage numbers or other identifiers can be indicated in the name you give\nthe file, e.g., <code>pg32_paragraph1.txt</code>. If you are working with a diary,\neach text file might be a single entry, e.g., <code>april_25_1887.txt</code>. (Note\nthat when naming folders or files, do not leave spaces in the name.\nInstead use underscores to represent spaces). If the texts that you are\ninterested in are on the web, you might be able to <a href=\"http://electricarchaeology.ca/2012/07/09/mining-a-day-of-archaeology/\">automate this\nprocess</a>.</p>\n<h3 id=\"further-reading-about-topic-modeling\">Further Reading about Topic Modeling</h3>\n<p>To see a fully worked out example of topic modeling with a body of\nmaterials culled from webpages, see <a href=\"http://electricarchaeology.ca/2012/06/08/mining-the-open-web-with-looted-heritage-draft/\">Mining the Open Web with Looted\nHeritage Draft</a>.</p>\n<p>You can grab the data for yourself at <a href=\"https://ndownloader.figshare.com/files/90972\">Figshare.com</a>, which includes a\nnumber of <code>.txt</code> files. Each individual <code>.txt</code> file is a single news\nreport.</p>\n<ul>\n<li>For extensive background and bibliography on topic modeling you may\nwish to begin with Scott Weingart&#39;s <a href=\"http://www.scottbot.net/HIAL/?p=19113\">Guided Tour to Topic\nModeling</a></li>\n<li>Ted Underwood&#39;s &#39;<a href=\"http://tedunderwood.wordpress.com/2012/04/07/topic-modeling-made-just-simple-enough/\">Topic modeling made just simple enough</a>&#39; is an\nimportant discussion on interpreting the meaning of topics.</li>\n<li>Lisa Rhody&#39;s post on interpreting topics is also illuminating.\n&#39;<a href=\"http://web.archive.org/web/20160704150726/http://www.lisarhody.com:80/some-assembly-required/\">Some Assembly Required</a>&#39; <em>Lisa @ Work</em> August 22, 2012.</li>\n<li>Clay Templeton, &#39;<a href=\"http://mith.umd.edu/topic-modeling-in-the-humanities-an-overview/\">Topic Modeling in the Humanities: An Overview |\nMaryland Institute for Technology in the Humanities</a>&#39;, n.d.</li>\n<li>David Blei, Andrew Ng, and Michael Jordan, &#39;<a href=\"http://dl.acm.org/citation.cfm?id=944937\">Latent dirichlet\nallocation</a>,&#39; The Journal of Machine Learning Research 3 (2003).</li>\n<li>Finally, also consult David Mimno&#39;s <a href=\"http://mimno.infosci.cornell.edu/topics.html\">bibliography of topic modeling\narticles</a>. They&#39;re tagged by topic to make finding the right one\nfor a particular application that much easier. Also take a look at\nhis recent article on <a href=\"http://www.perseus.tufts.edu/publications/02-jocch-mimno.pdf\">Computational Historiography</a> from ACM\nTransactions on Computational Logic which goes through a hundred\nyears of Classics journals to learn something about the field. While\nthe article should be read as a good example of topic modeling, his\n&#39;Methods&#39; section is especially important, in that it discusses\npreparing text for this sort of analysis.</li>\n</ul>\n"}