{"metadata":{"title":"Introducción a Markdown\n","authors":["Sarah Simpkin"],"date":"2015-11-13T00:00:00.000Z","translation_date":"2017-07-31T00:00:00.000Z","editors":["Ian Milligan"],"reviewers":["John Fink","Nancy Lemay"],"translator":["Víctor Gayol"],"translation-editor":["Maria José Afanador-Llach"],"translation-reviewer":["Juan Cobo","Maria José Afanador-Llach"],"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/56","difficulty":1,"activity":"presenting","layout":"lesson","topics":["data-management"],"abstract":"En esta lección se ofrece una introducción a Markdown, un lenguaje de marcado con sintaxis en texto plano para generar textos con formato. Descubrirás el porqué se utiliza, cómo dar formato a los archivos de Markdown y cómo obtener una vista previa en la web de los documentos formados con Markdown.","original":"getting-started-with-markdown","avatar_alt":"Tipografía de varias consonantes","doi":"10.46430/phes0014"},"html_body":"<h2 id=\"introducción-a-markdown\">Introducción a Markdown</h2>\n<h3 id=\"objetivos-de-la-lección\">Objetivos de la lección</h3>\n<p>En esta lección se ofrece una introducción a Markdown, un lenguaje de marcado con sintaxis en texto plano para generar textos con formato. Descubrirás el porqué se utiliza, cómo dar formato a los archivos de Markdown y cómo obtener una vista previa en la web de los documentos formados con Markdown.</p>\n<p>Dado que las lecciones de <em>The Programming Historian en español</em> deben ser enviadas como archivos Markdown, hemos incluido ejemplos específicos de <em>PH</em> en la medida de lo posible. Espero que esta guía sea útil si estás considerando contribuir con una lección en este sitio.</p>\n<h3 id=\"¿qué-es-markdown\">¿Qué es Markdown?</h3>\n<p>Markdown fue desarrollado en 2004 por <a href=\"http://daringfireball.net/projects/markdown/\">John Gruber</a>, y se refiere tanto a (1) una manera de formar archivos de texto, como a (2) una utilidad del lenguaje de programación Perl para convertir archivos Markdown en HTML. En esta lección nos centraremos en la primera acepción y aprenderemos a escribir archivos utilizando la sintaxis de Markdown.</p>\n<p>Los archivos de texto plano tienen muchas ventajas sobre otro tipo de formato. Por un lado, se pueden leer prácticamente en todos los dispositivos. También han resistido la prueba del paso del tiempo mejor que otro tipo de archivos -si alguna vez has intentado abrir un documento guardado en un formato de <a href=\"https://es.wikipedia.org/wiki/Sistema_heredado\">procesador de textos heredado</a>, estarás familiarizado con los problemas de compatibilidad que implican-.</p>\n<p>Al utilizar la sintaxis de Markdown, serás capaz de producir archivos que pueden ser legibles como texto plano y que a la vez están listos para ser formados en otras plataformas. Muchos generadores de bitácoras y de sitios estáticos, así como sitios como GitHub, también aceptan Markdown y traducen estos archivos a HTML para su visualización en la web. Además, herramientas como Pandoc pueden convertir archivos en o desde Markdown. Para más información sobre Pandoc puedes consultar la lección sobre <a href=\"/es/lecciones/escritura-sostenible-usando-pandoc-y-markdown\">Escritura sostenible utilizando Pandoc y Markdown</a> de Dennise Tenen y Grant Wythoff.</p>\n<h3 id=\"sintaxis-en-markdown\">Sintaxis en Markdown</h3>\n<p>Los archivos en Markdown se guardan con la extensión <code>.md</code> y se pueden abrir en un editor de texto como TextEdit, Notepad, Sublime Text o Vim. Muchos sitios web o plataformas de publicación también ofrecen editores basados en la web y/o extensiones para introducir texto utilizando la sintaxis de Markdown.</p>\n<p>En este tutorial vamos a practicar la sintaxis de Markdown en el navegador usando <a href=\"https://stackedit.io/\">StackEdit</a>. Podrás introducir texto formado en Markdown a la izquierda e inmediatamente ver la versión traducida junto a él a la derecha.</p>\n<p>Dado que todas las lecciones de <em>The Programming Historian</em> están escritas en Markdown, también podemos examinar sus archivos en StackEdit. Copia el texto en formato markdown de la lección <a href=\"/es/lecciones/introduccion-a-bash\">Introducción a la línea de comandos en Bash</a> en el siguiente enlace: </p>\n<pre><code>https://raw.githubusercontent.com/programminghistorian/jekyll/gh-pages/es/lecciones/introduccion-a-bash.md\n</code></pre>\n<p>Accede al <a href=\"https://stackedit.io/\">editor de StackEdit</a> haciendo click en &quot;start writing&quot; (empezar a escribir) en la parte superior de la página y pega el texto de la lección.</p>\n<p>Verás que mientras que el panel de la derecha cuenta con una presentación más elegante del texto, el archivo de Markdown a la izquierda es aún bastante legible.</p>\n<p>Vamos a sumergirnos ahora en la lección escribiendo nuestra propia sintaxis de Markdown. Crea un nuevo documento en StackEdit haciendo click en el ícono de la carpeta en la esquina superior derecha seleccionando &quot;New document&quot;. Debes ponerle nombre al documento en la caja de texto en la parte superior de la página.</p>\n<h4 id=\"encabezados\">Encabezados</h4>\n<p>Markdown dispone de cuatro niveles de encabezados definidos por el número de <code>#</code> antes del texto del encabezado. Pega los siguientes ejemplos en la caja de texto de la izquierda:</p>\n<pre><code># Primer nivel de encabezado\n## Segundo nivel de encabezado\n### Tercer nivel de encabezado\n#### Cuarto nivel de encabezado\n</code></pre>\n<p>El primer y segundo nivel de encabezado también se pueden escribir como sigue:</p>\n<pre><code>Primer nivel de encabezado\n==========================\n\nSegundo nivel de encabeado\n--------------------------\n</code></pre>\n<p>Estos se representarán como:</p>\n<h1 id=\"primer-nivel-de-encabezado\">Primer nivel de encabezado</h1>\n<h2 id=\"segundo-nivel-de-encabezado\">Segundo nivel de encabezado</h2>\n<h3 id=\"tercer-nivel-de-encabezado\">Tercer nivel de encabezado</h3>\n<h4 id=\"cuarto-nivel-de-encabezado\">Cuarto nivel de encabezado</h4>\n<h1 id=\"primer-nivel-de-encabezado-1\">Primer nivel de encabezado</h1>\n<h2 id=\"segundo-nivel-de-encabeado\">Segundo nivel de encabeado</h2>\n<p>Observa que la sintaxis de Markdown sigue siendo comprensible aún en la versión de texto plano.</p>\n<h4 id=\"párrafos-y-saltos-de-línea\">Párrafos y saltos de línea</h4>\n<p>Escribe la siguiente frase en la caja de texto:</p>\n<pre><code>¡Bienvenidos a *The Programming Historian en español*!\n\nHoy aprenderemos la sintaxis de Mardown.\nEsta frase está separada de la anterior por un solo salto de línea.\n</code></pre>\n<p><strong>Esto queda representado como:</strong></p>\n<p>¡Bienvenidos a <em>The Programming Historian en español</em>!</p>\n<p>Hoy aprenderemos la sintaxis de Markdown.\nÉsta frase esta separada de la anterior por un solo salto de línea.</p>\n<p>Los párrafos deben estar separados por una línea vacía. Deja una línea entre la que contiene <code>Markdown.</code> y <code>Ésta</code> para que veas cómo trabaja. Los saltos de línea sencillos deben indicarse con dos espacios en blanco en algunas implementaciones de Markdown. Esto no es necesario en la variente de <a href=\"https://help.github.com/articles/github-flavored-markdown/\">GitHub Flavored Markdown</a>, que es la que utiliza por defecto StackEdit.</p>\n<h4 id=\"añadir-énfasis\">Añadir énfasis</h4>\n<p>El texto se puede poner en cursivas encerrándolo entre los símbolos <code>*</code> o <code>-</code>. De la misma forma, el texto en negritas se escribe encerrando la palabra entre <code>**</code>o <code>__</code>.</p>\n<p>Añade énfasis a una frase utilizando estos métodos:</p>\n<pre><code>¡Estoy **muy** entusiasmado con los tutoriales de _The Programming Historian en español_!\n</code></pre>\n<p>Lo cual queda representado así:</p>\n<p>¡Estoy <strong>muy</strong> entusiasmado con los tutoriales de <em>The Programming Historian en español</em>!</p>\n<h4 id=\"listados\">Listados</h4>\n<p>Markdown soporta la creación de listas ordenadas y sin ordenar. Escribe la siguiente lista dentro de la caja de texto:</p>\n<pre><code>Lista de compras\n---------------\n* Frutas\n  * Manzanas\n  * Naranjas\n  * Uvas\n* Lácteos\n  * Leche\n  * Queso\n</code></pre>\n<p>Poner sangría al <code>*</code> te permite crear listas anidadas.</p>\n<p><strong>Esto se depliega así:</strong></p>\n<h2 id=\"lista-de-compras\">Lista de compras</h2>\n<ul>\n<li>Frutas<ul>\n<li>Manzanas</li>\n<li>Naranjas</li>\n<li>Uvas</li>\n</ul>\n</li>\n<li>Lácteos<ul>\n<li>Leche</li>\n<li>Queso</li>\n</ul>\n</li>\n</ul>\n<p>Las listas ordenadas se escriben numerando cada línea. Una vez más, el objetivo de Markdown es producir documentos que sean legibles como texto plano y que a la vez puedan traducirse a otros formatos.</p>\n<pre><code>Lista de pendientes\n------------------\n1. Terminar el tutorial de Markdown\n2. Ir a la tienda de abarrotes\n3. Preparar el almuerzo\n</code></pre>\n<p>Lo cual se visualiza de la siguiente manera:</p>\n<h2 id=\"lista-de-pendientes\">Lista de pendientes</h2>\n<ol>\n<li>Terminar el tutorial de Markdown</li>\n<li>Ir a la tienda de abarrotes</li>\n<li>Preparar el almuerzo</li>\n</ol>\n<h4 id=\"fragmentos-de-código-snippets\">Fragmentos de código (<em>snippets</em>)</h4>\n<p>Representar fragmentos de código en forma distinta al resto del documento es una buena práctica que lo hace más legible. La escritura de código se representa generalmente a espacio sencillo. Dado que Markdown no distingue las tipografías involucradas, representamos los fragmentos de código encerrados entre dos signos de acento grave <code>`</code>. Por ejemplo: <code>`&lt;br/&gt;`</code>. Cuando queremos representar un bloque completo de código lo debemos encerrar entre dos líneas de tres acentos graves. En la ventana de vista previa de StackEdit esto se representará como una caja de texto sombreada y escrita a espacio seguido.</p>\n<p>Escribe lo siguiente en la caja de texto:</p>\n<pre><code>```html\n&lt;html&gt;\n    &lt;head&gt;\n        &lt;title&gt;Título del sitio Web&lt;/title&gt;\n    &lt;/head&gt;\n    &lt;body&gt;\n    &lt;/body&gt;\n&lt;/html&gt;\n```\n</code></pre>\n<p><strong>Y se representará así:</strong></p>\n<pre><code>    &lt;html&gt;\n        &lt;head&gt;\n            &lt;title&gt;Título del sitio Web&lt;/title&gt;\n        &lt;/head&gt;\n        &lt;body&gt;\n        &lt;/body&gt;\n    &lt;/html&gt;\n</code></pre>\n<p>Observa cómo el bloque de código se representa a renglón seguido.</p>\n<h4 id=\"bloque-de-citas\">Bloque de citas</h4>\n<p>Escribe el siguiente texto en la caja de texto:</p>\n<pre><code>&gt; Hola. Éste es un párrafo de texto incluido en un bloque de cita. Fíjate que tengo una sangría con respecto al margen izquierdo.\n</code></pre>\n<p>Lo cual se representará:</p>\n<blockquote>\n<p>Hola. Éste es un párrafo de texto incluido como un bloque de cita textual. Fíjate que tengo una sangría con respecto al margen izquierdo.</p>\n</blockquote>\n<h4 id=\"enlaces-de-internet\">Enlaces de Internet</h4>\n<p>Los enlaces de Internet se pueden escribir de dos maneras.</p>\n<p>El título del enlace se encierra primero entre corchetes y después se incluye la dirección completa del URL entre paréntesis.</p>\n<p><code>Para más tutoriales visita la página [The Programming Historian en español](/es).</code></p>\n<p><strong>Lo cual se representa así:</strong></p>\n<p>Para más tutoriales visita la página <a href=\"/es\">The Programming Historian en español</a>.</p>\n<p>Los enlaces también se utilizan para crear notas a pie de página y son útiles porque, además, ayudan a mantener más ordenado tu documento en texto plano. Las notas a pie se escriben con un par adicional de corchetes con el número de referencia para establecer el vínculo que identifique la etiqueta.</p>\n<p><code>Un ejemplo es el sitio *[The Programming Historian en español][1]*</code></p>\n<p>Entonces puedes incluir el URL en otra parte del documento:</p>\n<p><code>[1]: http://programminghistorian.org/</code></p>\n<p>Lo cual se despliega de la siguiente manera:</p>\n<p>Un ejemplo es el sitio <em><a href=\"http://programminghistorian.org/\">The Programming Historian en español</a></em></p>\n<h4 id=\"imágenes\">Imágenes</h4>\n<p>Se pueden referir las imágenes mediante el uso de <code>!</code>, seguido de un texto alternativo entre corchetes, seguido a su vez por el URL de la imagen y un título opcional entre comillas. Esto no se representará como texto en tu documento pero te permitirá incluir la imagen en la visualización de una página en HTML.</p>\n<p><code>![Logo de Wikipedia](https://upload.wikimedia.org/wikipedia/en/8/80/Wikipedia-logo-v2.svg &quot;Wikipedia logo&quot;)</code></p>\n<p><strong>Esto aparece como:</strong></p>\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/8/80/Wikipedia-logo-v2.svg\" alt=\"Logo de Wikipedia\" title=\"Wikipedia logo\"></p>\n<h4 id=\"reglas-y-líneas-horizontales\">Reglas y líneas horizontales</h4>\n<p>Puedes incluir líneas horizontales si escribes en una misma línea cualquiera de los siguientes tres signos: <code>-</code>. <code>*</code> o <code>_</code>, sin importar los espacios que dejes entre ellos. Cualquiera de estas combinaciones generarán una línea horizontal:</p>\n<pre><code>___\n* * *\n- - - - - -\n</code></pre>\n<p>Es decir:</p>\n<hr>\n<hr>\n<hr>\n<h4 id=\"tablas\">Tablas</h4>\n<p>La versión básica de Markdown no incluye tablas; sin embargo, algunos sitios web y aplicaciones usan variantes de Markdown que pueden incluir tablas y otras características especiales. <a href=\"https://help.github.com/articles/github-flavored-markdown/\">GitHub Flavored Markdown</a> es una de estas variantes y es utilizado para visualizar archivos <code>.md</code> en el navegador del sitio de GitHub.</p>\n<p>Para crear una tabla en GitHub, usa barras verticales <code>|</code>para separar columnas y guiones entre los encabezados y el resto del contenido de la tabla. Dado que las barras verticales son sólo estrictamente necesarias entre columnas, puedes usarlas en los extremos de la tabla para darle una vista más acabada. Las celdas pueden tener contenido de cualquier extensión, y no es necesario que las barras verticales estén alineadas verticalmente entre sí.</p>\n<pre><code>| Encabezado 1 | Encabezado 2 | Encabezado 3 |\n| --------- | --------- | --------- |\n| renglón 1, columna 1 | renglón 1, columna 2 | renglón 1, columna 3|\n| renglón 2, columna 1 | renglón 2, columna 2 | renglón 2, columna 3|\n| renglón 3, columna 1 | renglón 3, columna 2 | renglón 3, columna 3|\n</code></pre>\n<p><strong>Esto se visualiza así:</strong></p>\n<table>\n<thead>\n<tr>\n<th>Encabezado 1</th>\n<th>Encabezado 2</th>\n<th>Encabezado 3</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>renglón 1, columna 1</td>\n<td>renglón 1, columna 2</td>\n<td>renglón 1, columna 3</td>\n</tr>\n<tr>\n<td>renglón 2, columna 1</td>\n<td>renglón 2, columna 2</td>\n<td>renglón 2, columna 3</td>\n</tr>\n<tr>\n<td>renglón 3, columna 1</td>\n<td>renglón 3, columna 2</td>\n<td>renglón 3, columna 3</td>\n</tr>\n</tbody></table>\n<p>Para especificar la alineación del contenido de cada columna se pueden agregar dos puntos <code>:</code>al renglón de los encabezados como sigue:</p>\n<pre><code>| Alineado-izquierda | Centrado | Alineado-derecha |\n| :-------- | :-------: | --------: |\n| Manzanas | rojo | 5000 |\n| Plátanos | amarillo | 75 |\n</code></pre>\n<p>Lo cual se representa de este modo:</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Alineado-izquierda</th>\n<th align=\"center\">Centrado</th>\n<th align=\"right\">Alineado-derecha</th>\n</tr>\n</thead>\n<tbody><tr>\n<td align=\"left\">Manzanas</td>\n<td align=\"center\">rojo</td>\n<td align=\"right\">5000</td>\n</tr>\n<tr>\n<td align=\"left\">Plátanos</td>\n<td align=\"center\">amarillo</td>\n<td align=\"right\">75</td>\n</tr>\n</tbody></table>\n<h3 id=\"limitaciones-de-markdown\">Limitaciones de Markdown</h3>\n<p>Aunque Markdown se está haciendo cada vez más popular, particularmente para los documentos con formato que se pueden ver en la web, muchas persones y editores siguen solicitando archivos tradicionales en Word, PDF y otros formatos. Esto puede arreglarse en parte utilizando herramientas de conversión en línea como <a href=\"http://johnmacfarlane.net/pandoc/\">Pandoc</a>. No obstante, algunas características de los procesadores de texto, como la de control de cambios, no tienen soporte aún. Por favor, visita la lección de Programming Historian en español sobre <a href=\"/es/lecciones/escritura-sostenible-usando-pandoc-y-markdown\">Escritura sostenible en texto plano usando Pandoc y Markdown</a> para mayor información sobre Pandoc.</p>\n<h3 id=\"conclusiones\">Conclusiones</h3>\n<p>Markdown es un término medio muy útil entre los archivos de texto plano sin estilo y los documentos de procesadores de texto heredados. Su sintaxis simple se aprende rápidamente y es altamente legible en el mismo documento y cuando se transforma en HTML u otro tipo de documentos. En conclusión, escribir tus documentos en Markdown significa que serán capaces de ser utilizados y leídos a largo plazo.</p>\n"}