{"metadata":{"title":"Introduction to MySQL with R","authors":["Jeff Blackadar"],"date":"2018-05-03T00:00:00.000Z","editors":["Amanda Visconti"],"reviewers":["Jesse Sadler","Simon Appleford"],"layout":"lesson","difficulty":2,"review-ticket":"https://github.com/programminghistorian/ph-submissions/issues/153","collection":"lessons","slug":"getting-started-with-mysql-using-r","activity":"transforming","topics":["data-manipulation","distant-reading"],"abstract":"This lesson will help you store large amounts of historical data in a structured manner, search and filter that data, and visualize some of the data as a graph.","redirect_from":"/lessons/getting-started-with-mysql-using-r","avatar_alt":"A hand holding a newspaper","doi":"10.46430/phen0076"},"html_body":"<p>This lesson is for you if you want to store large amounts of data from your digital history projects in a structured manner. We will use a database called MySQL to store data.</p>\n<p>R can perform analysis and data storage without the use of a relational database. However, there are times when databases are very useful including:</p>\n<ul>\n<li>Placing the results of an R script on a web site where the data can be interacted with.</li>\n<li>Handling more data than R can store in memory alone.</li>\n<li>When data is stored in a relational database already.</li>\n<li>Working with the data of different entities that are related to one another.  An example would be a database of soldiers of two different armies that fought a battle where we wanted to know what squad, platoon, company and brigade each soldier was part of.</li>\n</ul>\n<p>A further short discussion of this is on <a href=\"http://www.jason-french.com/blog/2014/07/03/using-r-with-mysql-databases/\">Jason A. French&#39;s blog</a>[^2].</p>\n<p>By the end of this lesson you will be able to install a database system on your computer, create a database table, store information in the table and then query the data. At the conclusion of the lesson we&#39;ll use a query of the database to make a graph.</p>\n<p>We are using the R computer language for the examples, but the techniques can be used with other languages such as Python.</p>\n<p>To do this lesson you will need a computer where you have permission to install software such as R and RStudio, if you are not running that already. In addition to programming in R, we will be installing some components of a database system called MySQL which works on Windows, Mac and Linux.</p>\n<p>Some knowledge of installing software as well as organizing data into fields is helpful for this lesson which is of medium difficulty.</p>\n<p>{% include toc.html %}</p>\n<h1 id=\"introduction\">Introduction</h1>\n<p>MySQL is a relational database used to store and query information. This lesson will use the R language to provide a tutorial and examples to:</p>\n<ul>\n<li>Set up and connect to a table in MySQL.</li>\n<li>Store records to the table.</li>\n<li>Query the table.</li>\n</ul>\n<p>In this tutorial you will make a database of newspaper stories that contain words from a search of a newspaper archive. The program will store the title, date published and URL of each story in a database. We&#39;ll use another program to query the database and look for historically significant patterns. Sample data will be provided from the <a href=\"http://newspapers.library.wales\">Welsh Newspapers Online</a> newspaper archive. We are working toward having a list of stories we can query for information. At the end of the lesson, we will run a query to generate a graph of the number of newspaper stories in the database to see if there is a pattern that is significant.</p>\n<h1 id=\"required-software\">Required Software</h1>\n<p>R, R Studio, MySQL Server and MySQL Workbench are the pieces of software required for this lesson.  Notes on installing these software packages are below.</p>\n<h2 id=\"r\">R</h2>\n<p>In their lesson <a href=\"/lessons/basic-text-processing-in-r\">Basic Text Processing in R</a>[^3], Taylor Arnold and Lauren Tilton provide an excellent summary of the knowledge of R required for this lesson.  Only basic knowledge of R is assumed. Taryn Dewar&#39;s lesson <a href=\"/lessons/r-basics-with-tabular-data\">&#39;R Basics with Tabular Data&#39;</a>[^4]\ncovers how to install R and become familiar with it.</p>\n<h3 id=\"download-r\">Download R</h3>\n<p>You can download R from the <a href=\"https://cran.r-project.org/\">Comprehensive R Archive Network</a>. Click on the link that matches your computer&#39;s operating system. Select <em>base</em> to install R for the first time. Once downloaded, click on the file to run the installer.</p>\n<h2 id=\"rstudio\">RStudio</h2>\n<p>Examples in this lesson use RStudio which is software used for writing and running R programs.  This lesson was done using Version 1.0.153 of RStudio.</p>\n<h3 id=\"download-rstudio\">Download RStudio</h3>\n<p>Download and install RStudio from <a href=\"https://www.rstudio.com/products/rstudio/#Desktop\">rstudio.com</a>. Since RStudio is open source, you can select the free version of RStudio Desktop then scroll down and click on one of the <em>Installers for Supported Platforms</em> that match your computer&#39;s operating system. Once downloaded, click on the file to run the installer.</p>\n<h2 id=\"mysql\">MySQL</h2>\n<p>SQL stands for Structured Query Language which is a set of commands used to store and retrieve information using a relational database. MySQL is a type of relational database and there are many others such as Microsoft SQL Server, IBM DB2 and Microsoft Access. This lesson uses MySQL since it is open-source, used by a large community, has a long track record and has a freely downloadable version.</p>\n<h3 id=\"downloading-and-installing-mysql\">Downloading and Installing MySQL</h3>\n<p>In this section we are going to install MySQL, which is the system that holds the database, as well as MySQL Workbench which is where you will work to set up the structure of the database. To use MySQL, you don&#39;t need MySQL Workbench, you can use typed commands. This lesson uses MySQL Workbench since it is a GUI that facilitates learning about MySQL.</p>\n<p>Complete these instructions to install MySQL Community Server and MySQL Workbench on your computer.</p>\n<h3 id=\"mysql-community-server\">MySQL Community Server</h3>\n<p>This is the server where the database is stored.  It needs to be installed and started for you to connect to it and store data.  Below we will download the files, install and start the server.  This lesson was done using Version 5.7 of MySQL and 6.3 of MySQL Workbench.</p>\n<h4 id=\"download-install-file-for-mysql-community-server\">Download install file for MySQL Community Server</h4>\n<p>Click on this link: <a href=\"https://dev.mysql.com/downloads/mysql/\">https://dev.mysql.com/downloads/mysql/</a>. Scroll down and click to <strong>Select Operating System</strong> that matches your computer.  If necessary, <strong>Select OS Version</strong>.  Once you have done that click the blue <strong>Download</strong> button.  On the download page, scroll down, you have the option of starting the download by clicking <strong>No thanks, just start my download.</strong></p>\n<h4 id=\"installation-of-mysql-community-server\">Installation of MySQL Community Server</h4>\n<p>Here are the MySQL Installation instructions:  <a href=\"https://dev.mysql.com/doc/workbench/en/wb-installing.html\">https://dev.mysql.com/doc/workbench/en/wb-installing.html</a></p>\n<p>Below are tips on the installation for the PC and Mac:</p>\n<h5 id=\"installation-tips-for-a-pc\">Installation tips for a PC</h5>\n<p>Using the MySQL Installer for Windows is the recommended way to install the components of MySQL. Once the file is downloaded, double click on the downloaded file to install it.  Follow the prompts to accept the licence.\nAfter the products are installed, you will be prompted for options:</p>\n<h6 id=\"1-choosing-a-setup-type\">1. Choosing a Setup Type</h6>\n<p>Select: <strong>Developer Default</strong>. This <em>installs the MySQL Server and the tools required for MySQL application development. This is useful if you intend to develop applications for an existing server.</em>\n(See below)</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-6.png&quot; caption=&quot;Setup Type Developer Default&quot; %}</p>\n<h6 id=\"2-check-requirements\">2. Check Requirements</h6>\n<p>Click the <strong>Execute</strong> button if you have <em>failing requirements</em> listed under Check Requirements. Your list of requirements may be different than what is shown here. Once the execute process installs the missing requirements click the Next button.\n(See below)</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-16.png&quot; caption=&quot;Click the Execute button if needed&quot; %}</p>\n<h6 id=\"3-type-and-networking\">3. Type and Networking</h6>\n<p>Select: <strong>Standalone MySQL Server</strong>\n(See below)</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-7.png&quot; caption=&quot;Select Standalone MySQL Server&quot; %}</p>\n<h6 id=\"4-type-and-networking\">4. Type and Networking</h6>\n<p>Config type: Select: <strong>Development Machine</strong>\nCheck: TCP/IP.  Port number: 3306.\n(See below)</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-8.png&quot; caption=&quot;Development Machine TCPIP port 3306&quot; %}</p>\n<h6 id=\"5-accounts-and-roles\">5. Accounts and Roles</h6>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-9.png&quot; caption=&quot;Write down and then type in a root password&quot; %}</p>\n<h6 id=\"6-windows-service\">6. Windows Service</h6>\n<p>Settings here are optional, but I find it easier to set up MySQL as a Windows Service and have it start automatically. A Windows Service is a process that runs on your computer while you are working. You can change your Windows Service settings later to start the MySQL service manually so that it does not start when you don&#39;t need it.</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-10.png&quot; caption=&quot;MySQL as a Windows Service&quot; %}</p>\n<p>Click the Execute and Next buttons to finish the installation and start the server.</p>\n<h6 id=\"7-root-password\">7. Root password</h6>\n<p>When prompted for the root password, enter the root password you wrote down in step <em>5. Accounts and Roles</em> above.\n(See below)</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-15.png&quot; caption=&quot;Root password&quot; %}</p>\n<p>Look in the Start menu under MySQL for MySQL Workbench.  If it is there, click to launch.  If not, click on MySQL Installer - Community to re-run the installation and add MySQL Workbench to the installed products.</p>\n<h5 id=\"installation-tips-for-a-mac\">Installation tips for a Mac</h5>\n<h6 id=\"1-install-mysql-community-server\">1. Install MySQL Community Server</h6>\n<p>Once the MySQL Community Server install file is downloaded, double click on the downloaded file to install it.  (See below)</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-17.png&quot; caption=&quot;Install file&quot; %}</p>\n<h6 id=\"2-write-down-temporary-password\">2. Write down temporary password</h6>\n<p>Follow the prompts to accept the licence and installation location.  <strong>Important: There will be a prompt for a temporary password.  Write this down carefully.</strong>  (See below for an example.  Your temporary password will be different than what is shown below.) If you make an error, you can remove the installed server and reinstall it, but that is a minor hassle. One of the lesson reviewers found <a href=\"https://stackoverflow.com/a/37524283\">this StackOverflow answer</a> helpful for this part.</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-18.png&quot; caption=&quot;Temporary password&quot; %}</p>\n<p>Once installed, we are going to change the root password for the MySQL server.</p>\n<h6 id=\"3-change-the-root-password-for-the-mysql-server\">3. Change the root password for the MySQL server</h6>\n<p><strong>This section of the lesson has caused difficulty for others.  Take your time and please note that the MySQL commands end with a semicolon. Watch for them in some of the commands below.</strong></p>\n<p>3.1. Open a terminal window</p>\n<p>3.2. Add /usr/local/mysql/bin to the PATH per the command below. The PATH is a list of directories the computer looks in when you type a command to run a program.  In the next step below, when you run <em>mysql</em>, the PATH searches the directories it has for the <em>mysql</em> program.  PATH finds <em>mysql</em> in the directory <em>/usr/local/mysql/bin</em> and runs it.  PATH just saves typing the whole path, in this case  <em>/usr/local/mysql/bin/mysql</em>, to a program when you want to run it.</p>\n<pre><code>export PATH=${PATH}:/usr/local/mysql/bin\n</code></pre>\n<p>3.3. Start the MySQL server.</p>\n<p>Go to System Preferences &gt; MySQL icon at bottom &gt; click on &quot;Start MySQL server&quot;</p>\n<p>3.4. Start a MySQL session. In the command below after <em>--password</em> enter the password you wrote down in step <em>2. Write down temporary password</em>.</p>\n<pre><code>mysql --user=root --password=the_root_password_you_wrote_down_above\n</code></pre>\n<p>3.5. Set the root password to a <strong>new</strong> password. Choose and write down a new password carefully. At the mysql&gt; prompt enter this command, replacing the password inside single quotes in the SET PASSWORD=PASSWORD(&#39;password&#39;) command with the new password you have written down.</p>\n<pre><code>SET PASSWORD=PASSWORD(&#39;your_new_password_you_just_wrote_down_in_step_3.5&#39;);\n</code></pre>\n<p>3.6. Restart the machine.  After restarting the machine you may need to repeat step <em>3.3 Start the MySQL server</em> above.</p>\n<h6 id=\"mysql-workbench-downloads\">MySQL Workbench downloads</h6>\n<p>Click on this link: <a href=\"http://dev.mysql.com/downloads/workbench/\">http://dev.mysql.com/downloads/workbench/</a>. Scroll down and click to <strong>Select Operating System</strong> that matches your computer.  If necessary, <strong>Select OS Version</strong>.  Once you have done that click the blue <strong>Download</strong> button.  On the download page, scroll down, you have the option of starting the download by clicking <strong>No thanks, just start my download.</strong></p>\n<p>Once the file is downloaded, double click on the downloaded file to install it. Once the installation of MySQL Workbench is done, as per the instructions on the screen, drag the icon to the Applications folder on the left. (See below)</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-22.png&quot; caption=&quot;MySQL Workbench&quot; %}</p>\n<h1 id=\"create-a-database\">Create a database</h1>\n<p>Here we will create a database which serves as a container for the tables we will store our information into. A table is the structure that holds the data we want to store. Tables hold many rows of records. An example record of basic contact information would contain fields for name, phone number and e-mail address. In a table, fields are organized into <em>columns</em>.</p>\n<p>Here is a sample table with a row of data that represents a record.</p>\n<table>\n<thead>\n<tr>\n<th>name</th>\n<th>phone number</th>\n<th>e-mail address</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>Pat Abraham</td>\n<td>613-555-1212</td>\n<td><a href=\"mailto:&#112;&#97;&#116;&#64;&#122;&#109;&#97;&#105;&#x6c;&#x2e;&#x63;&#x61;\">&#112;&#97;&#116;&#64;&#122;&#109;&#97;&#105;&#x6c;&#x2e;&#x63;&#x61;</a></td>\n</tr>\n</tbody></table>\n<h2 id=\"open-mysql-workbench\">Open MySQL Workbench</h2>\n<p>Open MySQL Workbench.  Double-click on the <em>Local Instance MySQL57</em>. (on a Mac this may appear as <em>Local Instance 3306</em>.) You may be prompted for the root password created in steps above.  After opening the Local Instance MySQL57 you should see a screen similar to the picture below.  On some Macs, a Query Tab will already be open; if it is not, open a Query Tab by doing <em>File &gt; New Query Tab</em>.</p>\n<h2 id=\"create-database\">CREATE DATABASE</h2>\n<p>Now we will create a new database. Using MySQL Workbench perform these steps:</p>\n<ol>\n<li>In the <strong>Query window</strong> type:<pre><code>CREATE DATABASE newspaper_search_results;\n</code></pre>\n</li>\n<li>Run the CREATE DATABASE command.  Click on the <strong>lightning bolt</strong> or using the menu, click <em>Query</em> and then <em>Execute Current Statement</em>.</li>\n<li>The new database <strong>newspaper_search_results</strong> should be visible under <strong>SCHEMAS</strong>, on the lower left of the screen. If you don&#39;t already see an item called newspaper_search_results, click the refresh icon. (See screenshot below.)</li>\n</ol>\n<p>(See below:)</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-1.png&quot; caption=&quot;CREATE a database in MySQL Workbench&quot; %}</p>\n<h2 id=\"use-database\">USE database</h2>\n<p>Next, we will enter a USE statement to inform MySQL Workbench which database to use. This becomes more important when you have you have more than one database on your machine.</p>\n<p>In the Query window, delete all of the CREATE DATABASE command and type:</p>\n<pre><code>USE newspaper_search_results;\n</code></pre>\n<p>Again, click on the <strong>lightning bolt</strong> or using the menu, click <em>Query</em> and then <em>Execute Current Statement</em>. You can also use a keyboard command for this. On Mac it is Command+Return. On a PC use Ctrl+Shift+Enter. From this point on in the lesson, each time you enter a command into the Query Window you will run it this way.</p>\n<p>(See below:)</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-25.png&quot; caption=&quot;USE a database in MySQL Workbench&quot; %}</p>\n<h1 id=\"add-a-table\">Add a table</h1>\n<ol>\n<li>In MySQL Workbench, look in the left side in the <strong>Navigator</strong> panel, under <strong>SCHEMAS</strong> for <strong>newspaper_search_results</strong>.</li>\n<li>Right-click on <strong>Tables</strong> and click <strong>Create Table</strong>.</li>\n<li>for <strong>Table Name:</strong> type <strong>tbl_newspaper_search_results</strong></li>\n</ol>\n<h2 id=\"add-columns-to-the-table\">Add columns to the table</h2>\n<p>Add these columns:</p>\n<ol>\n<li><strong>id</strong> Data type: <strong>INT</strong>. Click PK (Primary Key), NN (Not Null) and AI (Auto Increment).  This id column will be used to relate records in this table to records in other tables.</li>\n<li><strong>story_title</strong> Data type: <strong>VARCHAR(99)</strong>. This column will store the title of each article result we gather from the search.</li>\n<li><strong>story_date_published</strong> Data type: <strong>DATETIME</strong>. This column will store the date the newspaper was published.</li>\n<li><strong>story_url</strong> Data type: <strong>VARCHAR(99)</strong>. This column will store the URL of each result we gather from the search.</li>\n<li><strong>search_term_used</strong> Data type: <strong>VARCHAR(45)</strong>. This column will store the word we used to search the newspapers.\nClick the <strong>Apply</strong> button.</li>\n</ol>\n<p>All of the above steps can be done with a command if you prefer.  This command could be run in the Query window to create the table with the columns noted below.</p>\n<pre><code>CREATE TABLE newspaper_search_results.tbl_newspaper_search_results (\nid INT NOT NULL AUTO_INCREMENT,\nstory_title VARCHAR(99) NULL,\nstory_date_published DATETIME NULL,\nstory_url VARCHAR(99) NULL,\nsearch_term_used VARCHAR(45) NULL,\nPRIMARY KEY (id));\n</code></pre>\n<p><em>Tip: Take your time to think about table design and naming since a well designed database will be easier to work with and understand.</em></p>\n<h2 id=\"add-a-user-to-connect-to-the-database\">Add a user to connect to the database</h2>\n<p>A user is an account that has permission to connect to a database. Below, we are adding a new user so that this account connects only to the new database. Using this user account for one connection to this database limits exposure to other databases in case the password for this user is compromised. Giving a user the least privileges it needs to perform what you need it to do reduces the risk if someone else learns your user&#39;s password. For example, if a user can only read a database, it is less of a risk if the password is cracked than for a user that can also change or delete the database.</p>\n<p>In the MySQL Workbench menu click <strong>Server</strong> and then <strong>Users and Privileges</strong></p>\n<p><strong>Mac users</strong> Some Mac computers, like my testing laptop, don&#39;t display the <strong>Schema Privileges</strong> panel correctly.  See the note below the screenshot if this happens to you.</p>\n<p>Click the <strong>Add Account</strong> button and complete the Details for account newuser dialog box:</p>\n<ol>\n<li>Login Name: <strong>newspaper_search_results_user</strong></li>\n<li>Authentication Type: select <strong>Standard</strong></li>\n<li>Limit to Hosts Matching: <strong>localhost</strong></li>\n<li>Enter and confirm a password <em>SomethingDifficult</em></li>\n<li>Click on the <strong>Administrative Roles</strong> tab.  Make sure nothing is checked.  This account is for accessing the database only.</li>\n<li>Click on the <strong>Schema Privileges</strong> tab and click <strong>Add Entry</strong></li>\n<li>In the <strong>New Schema Privilege Definition</strong> diablog box, click the <strong>Selected schema:</strong> radio button and select <strong>newspaper_search_results</strong>.</li>\n<li>Click all of the Object Rights: SELECT, INSERT, UPDATE, DELETE, EXECUTE, SHOW VIEW as per the image below. (This user will need to do many things later in the lesson so we are giving it many rights.)</li>\n<li>Click the <strong>Apply</strong> button.</li>\n</ol>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-2.png&quot; caption=&quot;Setting permissions for new account&quot; %}</p>\n<h3 id=\"schema-privileges-not-displaying\">Schema Privileges not displaying</h3>\n<p>Some Mac computers, like my testing laptop, don&#39;t display the <strong>Schema Privileges</strong> panel correctly.  In that case, you can accomplish the above with a script using the Query Window.</p>\n<p>If you have already created the user above run this command to grant the user privileges:</p>\n<pre><code>GRANT SELECT, INSERT, UPDATE, DELETE, EXECUTE, SHOW VIEW ON newspaper_search_results.* TO &#39;newspaper_search_results_user&#39;@&#39;localhost&#39;;\n</code></pre>\n<p>If you have not created a user yet run these two commands to create the user and then grant the user privileges:</p>\n<pre><code>CREATE USER &#39;newspaper_search_results_user&#39;@&#39;localhost&#39; IDENTIFIED BY &#39;SomethingDifficult&#39;;\nGRANT SELECT, INSERT, UPDATE, DELETE, EXECUTE, SHOW VIEW ON newspaper_search_results.* TO &#39;newspaper_search_results_user&#39;@&#39;localhost&#39;;\n</code></pre>\n<h3 id=\"mysql-version-8-and-user-authentication-type\">MySQL version 8 and user Authentication Type.</h3>\n<p>When a user is created in MySQL 8 Workbench the <strong>Authentication Type</strong> is defaulted to <strong>caching_sha2_password</strong>. That type of authentication causes an error for the R package we will use to connect to the database later in this lesson. The error is <em>Authentication plugin &#39;caching_sha2_password&#39; cannot be loaded</em> and it is described in <a href=\"https://stackoverflow.com/questions/49194719/authentication-plugin-caching-sha2-password-cannot-be-loaded\">Stack Overflow</a>.</p>\n<p>To avoid this error we can change the user&#39;s Authentication Type to Standard. To do this, run this command:</p>\n<pre><code>ALTER USER &#39;newspaper_search_results_user&#39;@&#39;localhost&#39; IDENTIFIED WITH mysql_native_password BY &#39;SomethingDifficult&#39;;\n</code></pre>\n<h1 id=\"create-an-r-script-that-connects-to-the-database\">Create an R Script that connects to the database</h1>\n<p>Open RStudio, which you installed earlier in this lesson.  See the <a href=\"#rstudio\">RStudio</a> section.</p>\n<p>We&#39;ll now use RStudio to make a new R Script and save the script with the name newspaper_search.R. (Sometimes in this lesson I will refer to an R Script as a program.)</p>\n<p>Go to File &gt; New File &gt; R Script, then save that new file with the name newspaper_search.R.</p>\n<p>We will use the RMariaDB package to connect to MySQL.  (If you&#39;re curious, documentation for the RMariaDB package is <a href=\"https://cran.r-project.org/web/packages/RMariaDB/RMariaDB.pdf\">here</a>.)</p>\n<p>If you don&#39;t have the library RMariaDB installed (which is likely, if this is the first time you&#39;re using RStudio), install it using the RStudio Console.  After opening RStudio, copy and paste the following into the left window at the &gt; prompt, then press enter:</p>\n<pre><code>install.packages(&quot;RMariaDB&quot;)\n</code></pre>\n<p>Add this statement to the newspaper_search.R program</p>\n<pre><code>library(RMariaDB)\n</code></pre>\n<h2 id=\"connecting-to-the-database-with-a-password\">Connecting to the database with a password</h2>\n<p>We will connect to the database at first using a password. (Later we&#39;ll use a better way to connect.)  For now, we will use a variable to store the password.  Each time you start R you&#39;ll need to reset this variable, but that is better than publishing a hardcoded password if you share your programs, like you may do using GitHub.</p>\n<p>In the RStudio console type the command below, replacing <em>SomethingDifficult</em> with the password you created for newspaper_search_results_user in the steps you did above to add a user to connect to the database.</p>\n<pre><code>localuserpassword &lt;- &quot;SomethingDifficult&quot;\n</code></pre>\n<p>Add the following R statements to your newspaper_search.R file and save it.</p>\n<p>To run this script, select all the text and click the Run button. (There are other ways to run just a part of an R script or the whole script.  If you are curious, look in the menu under Code &gt; Run Region. CTRL+ALT+R will run all of the R code in the script.)</p>\n<pre><code>library(RMariaDB)\n# The connection method below uses a password stored in a variable.\n# To use this set localuserpassword=&quot;The password of newspaper_search_results_user&quot;\n\nstoriesDb &lt;- dbConnect(RMariaDB::MariaDB(), user=&#39;newspaper_search_results_user&#39;, password=localuserpassword, dbname=&#39;newspaper_search_results&#39;, host=&#39;localhost&#39;)\ndbListTables(storiesDb)\ndbDisconnect(storiesDb)\n</code></pre>\n<p>In the console you should see:</p>\n<pre><code>&gt; dbListTables(storiesDb)\n[1] &quot;tbl_newspaper_search_results&quot;\n&gt; dbDisconnect(storiesDb)\n</code></pre>\n<p>Success! you have:</p>\n<ol>\n<li>Connected to the database with dbConnect.</li>\n<li>Listed the table in the database with dbListTables.</li>\n<li>Disconnected from the database using dbDisconnect.</li>\n</ol>\n<h3 id=\"connecting-to-the-database-with-a-password-stored-in-a-configuration-file\">Connecting to the database with a password stored in a configuration file</h3>\n<p>The above example to connect is one way to make a connection.  The connection method described below stores the database connection information in a configuration file so that you do not have to type a password into a variable every time you start a new session in R. I found this to be a finicky process, but it is a more standard and secure way of protecting the credentials used to log into your database.  This connection method will be used in the code for the remainder of this tutorial, but it can be subsituted with the simpler connection method above if you prefer.</p>\n<h4 id=\"create-the-cnf-file-to-store-the-mysql-database-connection-information\">Create the .cnf file to store the MySQL database connection information</h4>\n<ol>\n<li><p>Open a text editor, like notepad, nano or TextEdit, and paste in the items below, changing the password to the one you created for newspaper_search_results_user in the steps you did above to add a user to connect to the database.</p>\n<pre><code>[newspaper_search_results]\nuser=newspaper_search_results_user\npassword=SomethingDifficult\nhost=127.0.0.1\nport=3306\ndatabase=newspaper_search_results\n</code></pre>\n</li>\n<li><p>Save this file somewhere outside of your R working directory.  I saved mine in the same folder as other MySQL settings files.  On my PC machine this was: C:\\ProgramData\\MySQL\\MySQL Server 5.7\\  Depending on your operating system and version of MySQL this location may be somewhere else. On a Mac I used /Users/blackadar/Documents/ as the folder.  I have tested putting this file in different places, it just needs to be somewhere R can locate it when the program runs. Name the file <strong>newspaper_search_results.cnf</strong>.</p>\n</li>\n<li><p>Update the newspaper_search.R program above to connect to the database using the configuration file.</p>\n</li>\n</ol>\n<pre><code>library(RMariaDB)\n# The connection method below uses a password stored in a settings file.\n\n# R needs a full path to find the settings file.\nrmariadb.settingsfile&lt;-&quot;C:\\\\ProgramData\\\\MySQL\\\\MySQL Server 8.0\\\\newspaper_search_results.cnf&quot;\n\nrmariadb.db&lt;-&quot;newspaper_search_results&quot;\nstoriesDb&lt;-dbConnect(RMariaDB::MariaDB(),default.file=rmariadb.settingsfile,group=rmariadb.db)\n\n# list the table. This confirms we connected to the database.\ndbListTables(storiesDb)\n\n# disconnect to clean up the connection to the database.\ndbDisconnect(storiesDb)\n</code></pre>\n<ol start=\"4\">\n<li>Run your script.</li>\n</ol>\n<p>In the console, among other lines, you should see again:</p>\n<pre><code>&gt; dbListTables(storiesDb)\n[1] &quot;tbl_newspaper_search_results&quot;\n</code></pre>\n<p>You have successfully connected to the database using a configuration file.</p>\n<h1 id=\"storing-data-in-a-table-with-sql\">Storing data in a table with SQL</h1>\n<p>In this section of the lesson we&#39;ll create a SQL statement to insert a row of data into the database table about this <a href=\"http://newspapers.library.wales/view/4121281/4121288/94/\">newspaper story</a>.  We&#39;ll insert the record first in MySQL workbench and later we&#39;ll do it in R.</p>\n<ol>\n<li>In MySQL Workbench, click the icon labelled SQL+ to create a new SQL tab for executing queries.</li>\n<li>Paste this statement below into the query window. This will insert a record into the table.<pre><code>INSERT INTO tbl_newspaper_search_results (\nstory_title,\nstory_date_published,\nstory_url,\nsearch_term_used)\nVALUES(&#39;THE LOST LUSITANIA.&#39;,\n&#39;1915-05-21&#39;,\nLEFT(RTRIM(&#39;http://newspapers.library.wales/view/4121281/4121288/94/&#39;),99),\n&#39;German+Submarine&#39;);\n</code></pre>\n</li>\n<li>Click the lightening bolt icon in the SQL tab to execute the SQL statement.</li>\n</ol>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-3.png&quot; caption=&quot;Inserting a record into a table using MySQL Workbench&quot; %}</p>\n<h2 id=\"explanation-of-the-insert-statement\">Explanation of the INSERT statement</h2>\n<table>\n<thead>\n<tr>\n<th>SQL</th>\n<th>Meaning</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>INSERT INTO tbl_newspaper_search_results (</td>\n<td>INSERT a record into the table named tbl_newspaper_search_results</td>\n</tr>\n<tr>\n<td>story_title,</td>\n<td>name of field to be populated by a value</td>\n</tr>\n<tr>\n<td>story_date_published,</td>\n<td>&quot;</td>\n</tr>\n<tr>\n<td>story_url,</td>\n<td>&quot;</td>\n</tr>\n<tr>\n<td>search_term_used)</td>\n<td>&quot;</td>\n</tr>\n<tr>\n<td>VALUES(&#39;THE LOST LUSITANIA.&#39;,</td>\n<td>The value to be inserted into the story_title field</td>\n</tr>\n<tr>\n<td>&#39;1915-05-21&#39;,</td>\n<td>story_date_published field</td>\n</tr>\n<tr>\n<td>LEFT(RTRIM(&#39;<a href=\"http://newspapers.library.wales/view/4121281/4121288/94/&#39;),99\">http://newspapers.library.wales/view/4121281/4121288/94/&#39;),99</a>),</td>\n<td>story_url field.  This field is a VARCHAR(99) so it has a maximum length of 99 characters.  Inserting a URL longer than 99 characters would cause an error and so two functions are used to control for that.  RTRIM() trims trailing spaces to the right of the URL.  LEFT(value,99) returns only the leftmost 99 characters of the trimmed URL.  This URL is much shorter than that and so these functions are here for an example only.</td>\n</tr>\n<tr>\n<td>&#39;German+Submarine&#39;);</td>\n<td>search_term_used field</td>\n</tr>\n</tbody></table>\n<p>Optional: Modify the INSERT statement above and execute it a few more times. For example</p>\n<pre><code>INSERT INTO tbl_newspaper_search_results (\nstory_title,\nstory_date_published,\nstory_url,\nsearch_term_used)\nVALUES(&#39;test insert.&#39;,\n&#39;1916-07-01&#39;,\nLEFT(RTRIM(&#39;http://newspapers.library.wales/view/4121281/4121288/94/&#39;),99),\n&#39;German+Submarine&#39;);\n</code></pre>\n<h2 id=\"querying-data-in-a-table-with-sql\">Querying data in a table with SQL</h2>\n<p>In this section of the lesson we&#39;ll create a SQL statement to select a row of data from the database table we just inserted.  We&#39;ll select the record first in MySQL workbench and later we&#39;ll do it in R.</p>\n<ol>\n<li>Paste this statement below into a query window in MySQL workbench. This will select records from the table.<pre><code>SELECT story_title FROM tbl_newspaper_search_results;\n</code></pre>\n</li>\n<li>Highlight the SELECT statement and click the lightening bolt icon in the SQL tab to execute it. You should see the story title &quot;THE LOST LUSITANIA.&quot; in the Result Grid. See below.</li>\n</ol>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-4.png&quot; caption=&quot;Selecting records from a table using MySQL Workbench&quot; %}</p>\n<p>Optional: Modify the SELECT statement above by changing the fields selected and run it again. Add more than one field to the SELECT statement and run it:</p>\n<pre><code>SELECT story_title, story_date_published FROM tbl_newspaper_search_results;\n</code></pre>\n<h2 id=\"storing-data-in-a-table-with-sql-using-r\">Storing data in a table with SQL using R</h2>\n<p>Let&#39;s do this using R! Below is an expanded version of the R Script we used above to connect to the database. For brevity, the first 3 comments we had in the R Script above are removed.  We no longer need them.</p>\n<p>In line 4 of the program below, remember to change the path to the rmariadb.settingsfile that matches your computer.</p>\n<pre><code>library(RMariaDB)\n# The connection method below uses a password stored in a settings file.\n\n# R needs a full path to find the settings file.\nrmariadb.settingsfile&lt;-&quot;C:\\\\ProgramData\\\\MySQL\\\\MySQL Server 8.0\\\\newspaper_search_results.cnf&quot;\n\nrmariadb.db&lt;-&quot;newspaper_search_results&quot;\nstoriesDb&lt;-dbConnect(RMariaDB::MariaDB(),default.file=rmariadb.settingsfile,group=rmariadb.db)\n\n# Optional. List the table. This confirms we connected to the database.\ndbListTables(storiesDb)\n\n# Create the query statement.\nquery&lt;-&quot;INSERT INTO tbl_newspaper_search_results (\nstory_title,\nstory_date_published,\nstory_url,\nsearch_term_used)\nVALUES(&#39;THE LOST LUSITANIA.&#39;,\n&#39;1915-05-21&#39;,\nLEFT(RTRIM(&#39;http://newspapers.library.wales/view/4121281/4121288/94/&#39;),99),\n&#39;German+Submarine&#39;);&quot;\n\n# Optional. Prints out the query in case you need to troubleshoot it.\nprint(query)\n\n# Execute the query on the storiesDb that we connected to above.\nrsInsert &lt;- dbSendQuery(storiesDb, query)\n\n# Clear the result.\ndbClearResult(rsInsert)\n\n# Disconnect to clean up the connection to the database.\ndbDisconnect(storiesDb)\n</code></pre>\n<p>In the script above we do two steps to insert a record:</p>\n<ol>\n<li>Define the INSERT statement in the line beginning with: query&lt;-&quot;INSERT INTO tbl_newspaper_search_results (</li>\n<li>Execute the INSERT statement stored in the query variable with: rsInsert &lt;- dbSendQuery(storiesDb, query)</li>\n</ol>\n<p>Run the script above in R Studio and then execute a SELECT in MySQL Workbench. Do you see the new record you added?</p>\n<h3 id=\"clean-up-the-test-data\">Clean up the test data</h3>\n<p>At this point you likely have more than one record with the story title of &quot;THE LOST LUSITANIA.&quot; which is fine for testing, but we don&#39;t want duplicate data. We will remove the test data and start again.  Using the query window in MySQL Workbench run this SQL statement:</p>\n<pre><code>TRUNCATE tbl_newspaper_search_results;\n</code></pre>\n<p>In the Action Output pane of MySQL Workbench you should see:</p>\n<pre><code>TRUNCATE tbl_newspaper_search_results    0 row(s) affected    0.015 sec\n</code></pre>\n<p>To practice what we just did:</p>\n<ol>\n<li>Run a SELECT statement again.  You should not get any rows back.</li>\n<li>Re-run the R program above to insert a record.</li>\n<li>Perform the SELECT statement.  You should see one row of data.</li>\n</ol>\n<h3 id=\"change-the-insert-statement-to-use-variables\">Change the INSERT statement to use variables</h3>\n<p>We will be inserting a lot of data into the table using R, so we will change the INSERT statement to use variables. See the code below the <em>#Assemble the query</em> remark.</p>\n<pre><code>library(RMariaDB)\n# The connection method below uses a password stored in a settings file.\n\n# R needs a full path to find the settings file.\nrmariadb.settingsfile&lt;-&quot;C:\\\\ProgramData\\\\MySQL\\\\MySQL Server 8.0\\\\newspaper_search_results.cnf&quot;\n\nrmariadb.db&lt;-&quot;newspaper_search_results&quot;\nstoriesDb&lt;-dbConnect(RMariaDB::MariaDB(),default.file=rmariadb.settingsfile,group=rmariadb.db)\n\n# Optional. List the table. This confirms we connected to the database.\ndbListTables(storiesDb)\n\n# Assemble the query.\n\n# Assign variables.\nentryTitle &lt;- &quot;THE LOST LUSITANIA.&quot;\nentryPublished &lt;- &quot;21 MAY 1916&quot;\n#convert the string value to a date to store it into the database\nentryPublishedDate &lt;- as.Date(entryPublished, &quot;%d %B %Y&quot;)\nentryUrl &lt;- &quot;http://newspapers.library.wales/view/4121281/4121288/94/&quot;\nsearchTermsSimple &lt;- &quot;German+Submarine&quot;\n\n# Create the query statement\nquery&lt;-paste(\n  &quot;INSERT INTO tbl_newspaper_search_results (\n  story_title,\n  story_date_published,\n  story_url,\n  search_term_used)\n  VALUES(&#39;&quot;,entryTitle,&quot;&#39;,\n  &#39;&quot;,entryPublishedDate,&quot;&#39;,\n  LEFT(RTRIM(&#39;&quot;,entryUrl,&quot;&#39;),99),\n  &#39;&quot;,searchTermsSimple,&quot;&#39;)&quot;,\n  sep = &#39;&#39;\n  )\n\n# Optional. Prints out the query in case you need to troubleshoot it.\nprint(query)\n\n# Execute the query on the storiesDb that we connected to above.\nrsInsert &lt;- dbSendQuery(storiesDb, query)\n\n# Clear the result.\ndbClearResult(rsInsert)\n\n# Disconnect to clean up the connection to the database.\ndbDisconnect(storiesDb)\n</code></pre>\n<p>Let&#39;s test this program:</p>\n<ol>\n<li>Run a SELECT statement and note the rows you have.</li>\n<li>Run the R program above to insert another record.</li>\n<li>Perform the SELECT statement.  You should see an additional row of data.</li>\n</ol>\n<h3 id=\"sql-errors\">SQL Errors</h3>\n<p>Let&#39;s create a simple error in SQL to see what happens.</p>\n<p>In R change</p>\n<pre><code>entryTitle &lt;- &quot;THE LOST LUSITANIA.&quot;\n</code></pre>\n<p>to</p>\n<pre><code>entryTitle &lt;- &quot;THE LOST LUSITANIA&#39;S RUDDER.&quot;\n</code></pre>\n<p>and re-run the program.</p>\n<p>In the R Console there is an error:</p>\n<pre><code>&gt; rsInsert &lt;- dbSendQuery(storiesDb, query)\nError in result_create(conn@ptr, statement, is_statement) :\n  You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near &#39;S RUDDER.&#39;,\n  &#39;1916-05-21&#39;,\n  LEFT(RTRIM(&#39;http://newspapers.library.wales/view/4&#39; at line 6 [1064]\n</code></pre>\n<p>You can check with a SELECT statement that there is no record in the table with a story title of THE LOST LUSITANIA&#39;S RUDDER.</p>\n<p>Single apostrophes are part of SQL syntax and they indicate a text value.  If they are in the wrong place, it causes an error.  We have to handle cases where we have data with apostrophes.  SQL accepts two apostrophes in an insert statement to represent an apostrophe in data (&#39;&#39;).</p>\n<p>We&#39;ll handle apostrophes by using a gsub function to replace a single apostrophe with a double one, as per below.</p>\n<pre><code>entryTitle &lt;- &quot;THE LOST LUSITANIA&#39;S RUDDER.&quot;\n# change a single apostrophe into a double apostrophe\nentryTitle &lt;- gsub(&quot;&#39;&quot;, &quot;&#39;&#39;&quot;, entryTitle)\n</code></pre>\n<p>Now that you have handled the apostrophe in the title of the story, re-run the R program and then check with a SELECT statement in MySQL workbench.</p>\n<pre><code>SELECT * FROM newspaper_search_results.tbl_newspaper_search_results WHERE story_title = &quot;THE LOST LUSITANIA&#39;S RUDDER.&quot;;\n</code></pre>\n<p>Once you see your test record, TRUNCATE tbl_newspaper_search_results to remove this test data.</p>\n<h1 id=\"storing-a-comma-separated-value-csv-file-into-a-mysql-database\">Storing a comma separated value .csv file into a MySQL database</h1>\n<p>In the next part of the lesson we&#39;ll query the database table.  Our goal is to have enough data in the table to make a graph. To prepare for that let&#39;s load some sample data from comma separated value (.csv) text files.</p>\n<p>Download these .csv files to your R working directory. These files are stored in GitHub so download the Raw version of the files.</p>\n<ol>\n<li><a href=\"/assets/getting-started-with-mysql-using-r/sample-data-allotment-garden.csv\">sample-data-allotment-garden.csv</a> This is a list of Welsh newspaper stories published during World War I that match the search terms allotment and garden.</li>\n<li><a href=\"/assets/getting-started-with-mysql-using-r/sample-data-submarine.csv\">sample-data-submarine.csv</a> This is a list of Welsh newspaper stories published during World War I that match the search terms German and submarine.</li>\n</ol>\n<p>In R, execute the following read.csv() function and then see what is in the sampleData data frame.</p>\n<pre><code>sampleGardenData &lt;- read.csv(file=&quot;sample-data-allotment-garden.csv&quot;, header=TRUE, sep=&quot;,&quot;)\nsampleGardenData\n</code></pre>\n<p>You should see a lot of data, including what is below. Check the Environment tab on the right side of RStudio. The sampleGardenData Data Frame should contain &quot;1242 obs. of 4 variables&quot;.</p>\n<pre><code>                                                                                      story_title\n1                                                                                                                                                                             -.&amp;quote;&amp;apos;N&amp;apos;III GARDEN REQUISITES.\n&lt;...the result of the data frame results have been removed...&gt;\n     story_date_published                                                 story_url   search_term_used\n1              1918-05-11  http://newspapers.library.wales/view/3581057/3581061/27/ AllotmentAndGarden\n&lt;...the result of the data frame results have been removed...&gt;\n</code></pre>\n<p>Note that in this sample data, field names are included in the header for convenience:  story_title, story_date_published, story_url and search_term_used.</p>\n<p>As noted above, our goal here is to insert the sample data that is now stored in the sampleGardenData data frame into the MySQL table tbl_newspaper_search_results.  We can do this a couple different ways, including looping through each row of the data frame and executing an INSERT command like we did above. Here though, we&#39;ll use one command to insert all of the rows in sampleGardenData at one time: <em>dbWriteTable</em>. Don&#39;t run this statement yet, just read it.</p>\n<pre><code>dbWriteTable(storiesDb, value = sampleGardenData, row.names = FALSE, name = &quot;tbl_newspaper_search_results&quot;, append = TRUE )\n</code></pre>\n<table>\n<thead>\n<tr>\n<th>Function</th>\n<th>Meaning</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>dbWriteTable(storiesDb,</td>\n<td>Use the MySQL database connection storiesDb.</td>\n</tr>\n<tr>\n<td>value = sampleGardenData,</td>\n<td>Write the values in the sampleData data frame to the table.</td>\n</tr>\n<tr>\n<td>row.names = FALSE,</td>\n<td>No row names are specified.</td>\n</tr>\n<tr>\n<td>name = &quot;tbl_newspaper_search_results&quot;,</td>\n<td>Insert the values from sampleData into the table tbl_newspaper_search_results.</td>\n</tr>\n<tr>\n<td>append = TRUE )</td>\n<td>Append these values to what is in the table already.  If this program is run again, all of the rows in sampleData will be appended to the same table again.</td>\n</tr>\n</tbody></table>\n<p>We&#39;re not ready to run dbWriteTable() yet, we need to connect to the database first. Here is the program to do that, as well as load sample-data-submarine.csv too. Read through this and run it.</p>\n<pre><code>library(RMariaDB)\nrmariadb.settingsfile&lt;-&quot;C:\\\\ProgramData\\\\MySQL\\\\MySQL Server 8.0\\\\newspaper_search_results.cnf&quot;\n\nrmariadb.db&lt;-&quot;newspaper_search_results&quot;\nstoriesDb&lt;-dbConnect(RMariaDB::MariaDB(),default.file=rmariadb.settingsfile,group=rmariadb.db)\n\nsetwd(&quot;C:\\\\a_orgs\\\\carleton\\\\hist3814\\\\R\\\\getting-started-with-mysql&quot;)\n\n# read in the sample data from a newspaper search of Allotment And Garden\nsampleGardenData &lt;- read.csv(file=&quot;sample-data-allotment-garden.csv&quot;, header=TRUE, sep=&quot;,&quot;)\n\n# The story_title column in the database table can store values up to 99 characters long.\n# This statement trims any story_titles that are any longer to 99 characters.\nsampleGardenData$story_title &lt;- substr(sampleGardenData$story_title,0,99)\n\n# This statement formats story_date_published to represent a DATETIME.\nsampleGardenData$story_date_published &lt;- paste(sampleGardenData$story_date_published,&quot; 00:00:00&quot;,sep=&quot;&quot;)\n\ndbWriteTable(storiesDb, value = sampleGardenData, row.names = FALSE, name = &quot;tbl_newspaper_search_results&quot;, append = TRUE )\n\n# read in the sample data from a newspaper search of German+Submarine\nsampleSubmarineData &lt;- read.csv(file=&quot;sample-data-submarine.csv&quot;, header=TRUE, sep=&quot;,&quot;)\n\nsampleSubmarineData$story_title &lt;- substr(sampleSubmarineData$story_title,0,99)\nsampleSubmarineData$story_date_published &lt;- paste(sampleSubmarineData$story_date_published,&quot; 00:00:00&quot;,sep=&quot;&quot;)\n\ndbWriteTable(storiesDb, value = sampleSubmarineData, row.names = FALSE, name = &quot;tbl_newspaper_search_results&quot;, append = TRUE )\n\n#disconnect to clean up the connection to the database\ndbDisconnect(storiesDb)\n</code></pre>\n<p>If you run this more than once, you will have duplicate records.  If that happens, just TRUNCATE the table and run the program again, but only once.  You can check that you have the right number of records.  In MySQL Workbench run this in the query window:</p>\n<pre><code>SELECT COUNT(*) FROM tbl_newspaper_search_results;\n</code></pre>\n<p>You should have a count of 2880 records. 1242 from sampleGardenData and 1638 from sampleSubmarineData.</p>\n<h1 id=\"selecting-data-from-a-table-with-sql-using-r\">Selecting data from a table with SQL using R</h1>\n<p>Our goal here is to use the table of newspaper stories we have imported and make a graph of the number of stories published in Welsh Newspapers during each month of World War I that match the search terms (allotment and garden) and (German and submarine)</p>\n<p>The script below queries the database and produces the line graph plot below.  Read through the script to see what is happening. An explanation of script follows it.</p>\n<pre><code>library(RMariaDB)\nrmariadb.settingsfile&lt;-&quot;C:\\\\ProgramData\\\\MySQL\\\\MySQL Server 8.0\\\\newspaper_search_results.cnf&quot;\n\nrmariadb.db&lt;-&quot;newspaper_search_results&quot;\nstoriesDb&lt;-dbConnect(RMariaDB::MariaDB(),default.file=rmariadb.settingsfile,group=rmariadb.db)\n\nsearchTermUsed=&quot;German+Submarine&quot;\n# Query a count of the number of stories matching searchTermUsed that were published each month.\nquery&lt;-paste(&quot;SELECT ( COUNT(CONCAT(MONTH(story_date_published), &#39; &#39;,YEAR(story_date_published)))) as &#39;count&#39;\n    FROM tbl_newspaper_search_results\n    WHERE search_term_used=&#39;&quot;,searchTermUsed,&quot;&#39;\n    GROUP BY YEAR(story_date_published),MONTH(story_date_published)\n    ORDER BY YEAR(story_date_published),MONTH(story_date_published);&quot;,sep=&quot;&quot;)\n\nprint(query)\nrs = dbSendQuery(storiesDb,query)\ndbRows&lt;-dbFetch(rs)\n\ncountOfStories&lt;-c(as.integer(dbRows$count))\n\n# Put the results of the query into a time series.\nqts1 = ts(countOfStories, frequency = 12, start = c(1914, 8))\nprint(qts1)\n\n# Plot the qts1 time series data with a line width of 3 in the color red.\nplot(qts1,\n    lwd=3,\n    col = &quot;red&quot;,\n    xlab=&quot;Month of the war&quot;,\n    ylab=&quot;Number of newspaper stories&quot;,\n    xlim=c(1914,1919),\n    ylim=c(0,150),\n    main=paste(&quot;Number of stories in Welsh newspapers matching the search terms listed below.&quot;,sep=&quot;&quot;),\n    sub=&quot;Search term legend: Red = German+Submarine. Green = Allotment And Garden.&quot;)\n\nsearchTermUsed=&quot;AllotmentAndGarden&quot;\n\n# Query a count of the number of stories matching searchTermUsed that were published each month.\nquery&lt;-paste(&quot;SELECT (  COUNT(CONCAT(MONTH(story_date_published),&#39; &#39;,YEAR(story_date_published)))) as &#39;count&#39;   FROM tbl_newspaper_search_results   WHERE search_term_used=&#39;&quot;,searchTermUsed,&quot;&#39;   GROUP BY YEAR(story_date_published),MONTH(story_date_published)   ORDER BY YEAR(story_date_published),MONTH(story_date_published);&quot;,sep=&quot;&quot;)\nprint(query)\nrs = dbSendQuery(storiesDb,query)\ndbRows&lt;-dbFetch(rs)\n\ncountOfStories&lt;-c(as.integer(dbRows$count))\n\n# Put the results of the query into a time series.\nqts2 = ts(countOfStories, frequency = 12, start = c(1914, 8))\n\n# Add this line with the qts2 time series data to the the existing plot.\nlines(qts2, lwd=3,col=&quot;darkgreen&quot;)\n\n# Clear the result\ndbClearResult(rs)\n\n# Disconnect to clean up the connection to the database.\ndbDisconnect(storiesDb)\n</code></pre>\n<h2 id=\"explanation-of-the-select-and-plot-data-program\">Explanation of the select and plot data program.</h2>\n<p>The method to connect to the database is explained <a href=\"#connecting-to-the-database-with-a-password\">above</a>.</p>\n<p>This program selects two result sets of data and plots them on a graph. One of the result sets is newspaper stories matching the search German+Submarine.  They are queried with this SELECT statement:</p>\n<pre><code>SELECT (\n  COUNT(CONCAT(MONTH(story_date_published),&#39; &#39;,YEAR(story_date_published)))) as &#39;count&#39;\n  FROM tbl_newspaper_search_results\n  WHERE search_term_used=&#39;&quot;,searchTermUsed,&quot;&#39;\n  GROUP BY YEAR(story_date_published),MONTH(story_date_published)\n  ORDER BY YEAR(story_date_published),MONTH(story_date_published);\n</code></pre>\n<table>\n<thead>\n<tr>\n<th>SQL</th>\n<th>Meaning</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>SELECT (</td>\n<td>SELECT data matching the condition in the WHERE clause FROM the database table named.</td>\n</tr>\n<tr>\n<td>COUNT(CONCAT(MONTH(story_date_published),&#39; &#39;,YEAR(story_date_published))) as &#39;count&#39;</td>\n<td>This provides a count of the number of stories published that share the same month and year publishing date. CONCAT stands for concatenate which creates a single text value from two or more separate text values, in this case the month and the year.</td>\n</tr>\n<tr>\n<td>FROM tbl_newspaper_search_results</td>\n<td>This is the database table we&#39;re selecting data from.</td>\n</tr>\n<tr>\n<td>GROUP BY YEAR(story_date_published),MONTH(story_date_published)</td>\n<td>This GROUP BY statement is important for the COUNT above. Here the data is grouped by month and year so that we can count all of the records in the group.</td>\n</tr>\n<tr>\n<td>ORDER BY YEAR(story_date_published),MONTH(story_date_published);</td>\n<td>This puts the result set in order by date, which is useful since we want to make a graph by date.</td>\n</tr>\n</tbody></table>\n<p>The statements below run the query and puts the result set <em>rs</em> into data frame <em>dbRows</em></p>\n<pre><code>rs = dbSendQuery(storiesDb,query)\ndbRows&lt;-dbFetch(rs)\n</code></pre>\n<p>Below the data frame <em>dbRows</em> is put into a time series with the <em>ts()</em> function so that it can be plotted for each month, starting from August 1914.</p>\n<pre><code>#Put the results of the query into a time series\nqts1 = ts(countOfStories, frequency = 12, start = c(1914, 8))\n</code></pre>\n<p>Below, the data in the <em>qts1</em> time series is plotted on a graph</p>\n<pre><code>plot(qts1,\n    lwd=3,\n    col = &quot;red&quot;,\n    xlab=&quot;Month of the war&quot;,\n    ylab=&quot;Number of newspaper stories&quot;,\n    xlim=c(1914,1919),\n    ylim=c(0,150),\n    main=paste(&quot;Number of stories in Welsh newspapers matching the search terms listed below.&quot;,sep=&quot;&quot;),\n    sub=&quot;Search term legend: Red = German+Submarine. Green = Allotment And Garden.&quot;)\n</code></pre>\n<p>What is different about the part of the program that plots the stories matching the search &quot;Allotment And Garden&quot;? Not very much at all.  We just use the <em>lines()</em> function to plot those results on the same plot we made above.</p>\n<pre><code>lines(qts2, lwd=3,col=&quot;darkgreen&quot;)\n</code></pre>\n<h3 id=\"results-of-the-select-and-plot-data-program\">Results of the select and plot data program.</h3>\n<p>Below is what the plot should look like:</p>\n<p>{% include figure.html filename=&quot;getting-started-with-mysql-5.png&quot; caption=&quot;Plot of number of newspaper stories published each month matching search terms&quot; %}</p>\n<h1 id=\"going-further-with-mysql\">Going further with MySQL</h1>\n<p>If you wanted to put a database on a website, using MySQL as the database and the PHP language to build the pages of the site is one way to do this. An example of this type of website is one I built to <a href=\"http://www.jeffblackadar.ca/graham_fellowship/corpus_entities_equity/\">search issues of the Equity newspaper</a>. Larry Ullman&#39;s book <em>PHP and MySQL for Dynamic Web Sites</em> covers how to set up and connect to a database using MySQL and PHP in a hacker resistant way.</p>\n<p>For examples of using SQL to sort and group data as well as perform calculations, see:\n<a href=\"http://web.archive.org/web/20171228130133/https://www.ntu.edu.sg/home/ehchua/programming/sql/MySQL_Beginner.html\">MySQL by Examples for Beginners</a> or MySQL&#39;s <a href=\"https://dev.mysql.com/doc/refman/5.7/en/examples.html\">Examples of Common Queries</a>.</p>\n<h1 id=\"conclusion\">Conclusion</h1>\n<p>I hope that you now have the knowledge to set up a database table, connect to it and store records. Although we have only scratched the surface of the different ways to query data, I also hope that you now know the technique of using SELECT statements so that you can use them in your future digital history projects.</p>\n<h1 id=\"credits\">Credits</h1>\n<p>I completed this lesson thanks to the support of the <a href=\"http://grahamresearchfellow.org/\">George Garth Graham Undergraduate Digital History Research Fellowship</a>.</p>\n<p>Thank you to Dr. Amanda Visconti for her guidance and support during the preparation of this lesson.</p>\n<h1 id=\"references\">References</h1>\n<p>Ullman, L. 2005. <em>PHP and MySQL for Dynamic Web Sites, 2nd ed.</em> Berkeley, Calif: Peachpit.</p>\n<h1 id=\"endnotes\">Endnotes</h1>\n<p>[^1]: Lincoln Mullen, &quot;Natural Language Processing,&quot; RPubs, <a href=\"https://rpubs.com/lmullen/nlp-chapter\">https://rpubs.com/lmullen/nlp-chapter</a>.</p>\n<p>[^2]: Jason A. French, &quot;Using R With MySQL Databases,&quot; blog (3 July 2014), <a href=\"http://www.jason-french.com/blog/2014/07/03/using-r-with-mysql-databases/\">http://www.jason-french.com/blog/2014/07/03/using-r-with-mysql-databases/</a>.</p>\n<p>[^3]: Taylor Arnold and Lauren Tilton, &quot;Basic Text Processing in R,&quot; Programming Historian (27 March 2017), <a href=\"/lessons/basic-text-processing-in-r\">/lessons/basic-text-processing-in-r</a>.</p>\n<p>[^4]: Taryn Dewar, &quot;R Basics with Tabular Data,&quot; Programming Historian (05 September 2016), <a href=\"/lessons/r-basics-with-tabular-data\">/lessons/r-basics-with-tabular-data</a>.</p>\n<p>The R program I used to gather the sample data is <a href=\"https://github.com/jeffblackadar/getting-started-with-mysql/blob/master/newspaper-search-and-store.R\">here</a>.</p>\n"}